
AtlasLootCharDB = {
	["QuickLooks"] = {
	},
	["WishList"] = {
	},
	["AtlasLootVersion"] = "51104",
	["LastSearchedText"] = "тигр",
	["AutoQuery"] = false,
	["SearchResult"] = {
		{
			24, -- [1]
			29471, -- [2]
			"", -- [3]
			"=q4=Поводья черного боевого тигра", -- [4]
			"PvP транспорт", -- [5]
			"", -- [6]
			"", -- [7]
			"MountsPvP1|\"\"", -- [8]
		}, -- [1]
		{
			0, -- [1]
			"s26928", -- [2]
			"21934", -- [3]
			"=q2=Изысканное ожерелье тигрового глаза", -- [4]
			"Ювелирное дело: Шея", -- [5]
			"", -- [6]
			"", -- [7]
			"JewelNeck2|\"\"", -- [8]
		}, -- [2]
		{
			13, -- [1]
			49284, -- [2]
			"", -- [3]
			"=q4=Поводья резвого призрачного тигра", -- [4]
			"Задание / Содействующие / Созданный транспорт", -- [5]
			"", -- [6]
			"", -- [7]
			"MountsCraftQuestPromotion1|\"\"", -- [8]
		}, -- [3]
		{
			14, -- [1]
			49283, -- [2]
			"", -- [3]
			"=q3=Поводья призрачного тигра", -- [4]
			"Задание / Содействующие / Созданный транспорт", -- [5]
			"", -- [6]
			"", -- [7]
			"MountsCraftQuestPromotion1|\"\"", -- [8]
		}, -- [4]
		{
			7, -- [1]
			49284, -- [2]
			"", -- [3]
			"=q4=Поводья резвого призрачного тигра", -- [4]
			"Предметы настольных игровых карт", -- [5]
			"", -- [6]
			"", -- [7]
			"CardGame2|\"\"", -- [8]
		}, -- [5]
		{
			9, -- [1]
			49283, -- [2]
			"", -- [3]
			"=q3=Поводья призрачного тигра", -- [4]
			"Предметы настольных игровых карт", -- [5]
			"", -- [6]
			"", -- [7]
			"CardGame2|\"\"", -- [8]
		}, -- [6]
		{
			0, -- [1]
			29471, -- [2]
			"", -- [3]
			"=q4=Поводья черного боевого тигра", -- [4]
			"PvP аксессуары (Уровень 60)", -- [5]
			"", -- [6]
			"", -- [7]
			"PvP60Accessories1_A|\"\"", -- [8]
		}, -- [7]
		{
			2, -- [1]
			19907, -- [2]
			"", -- [3]
			"=q3=Плащ из шкуры зульского тигра", -- [4]
			"Верховный жрец Веноксис", -- [5]
			"", -- [6]
			"", -- [7]
			"ZGVenoxis|\"\"", -- [8]
		}, -- [8]
		{
			0, -- [1]
			"s3934", -- [2]
			"4368", -- [3]
			"=q2=Очки летающего тигра", -- [4]
			"Инженерное дело: Доспехи", -- [5]
			"", -- [6]
			"", -- [7]
			"EngineeringArmor3|\"\"", -- [8]
		}, -- [9]
		{
			0, -- [1]
			49343, -- [2]
			"", -- [3]
			"=q3=Призрачный тигренок", -- [4]
			"Не-Боевые питомци - Содействующие", -- [5]
			"", -- [6]
			"", -- [7]
			"PetsPromotional1|\"\"", -- [8]
		}, -- [10]
		{
			8, -- [1]
			49343, -- [2]
			"", -- [3]
			"=q3=Призрачный тигренок", -- [4]
			"Предметы настольных игровых карт", -- [5]
			"", -- [6]
			"", -- [7]
			"CardGame1|\"\"", -- [8]
		}, -- [11]
		{
			10, -- [1]
			45047, -- [2]
			"", -- [3]
			"=q3=Тигр-качалка", -- [4]
			"Предметы настольных игровых карт", -- [5]
			"", -- [6]
			"", -- [7]
			"CardGame1|\"\"", -- [8]
		}, -- [12]
		{
			0, -- [1]
			"s32179", -- [2]
			"25439", -- [3]
			"=q2=Кольцо с тигровым глазом", -- [4]
			"Ювелирное дело: Палец", -- [5]
			"", -- [6]
			"", -- [7]
			"JewelRing3|\"\"", -- [8]
		}, -- [13]
		{
			0, -- [1]
			"s24124", -- [2]
			"19688", -- [3]
			"=q3=Кираса кровавого тигра", -- [4]
			"Кожевничество: Кожанная броня", -- [5]
			"", -- [6]
			"", -- [7]
			"LeatherLeatherArmorOld1|\"\"", -- [8]
		}, -- [14]
		{
			0, -- [1]
			"s24125", -- [2]
			"19689", -- [3]
			"=q3=Наплечники кровавого тигра", -- [4]
			"Кожевничество: Кожанная броня", -- [5]
			"", -- [6]
			"", -- [7]
			"LeatherLeatherArmorOld1|\"\"", -- [8]
		}, -- [15]
		{
			17, -- [1]
			19689, -- [2]
			"", -- [3]
			"=q3=Наплечники кровавого тигра", -- [4]
			"Доспехи Кровавого тигра", -- [5]
			"", -- [6]
			"", -- [7]
			"LeatherworkingLeatherBloodTigerH|\"\"", -- [8]
		}, -- [16]
		{
			18, -- [1]
			19688, -- [2]
			"", -- [3]
			"=q3=Кираса кровавого тигра", -- [4]
			"Доспехи Кровавого тигра", -- [5]
			"", -- [6]
			"", -- [7]
			"LeatherworkingLeatherBloodTigerH|\"\"", -- [8]
		}, -- [17]
		{
			21, -- [1]
			19902, -- [2]
			"", -- [3]
			"=q4=Стремительный зульский тигр", -- [4]
			"Редкий транспорт", -- [5]
			"", -- [6]
			"", -- [7]
			"MountsRare1|\"\"", -- [8]
		}, -- [18]
		{
			27, -- [1]
			19773, -- [2]
			"", -- [3]
			"=q1=Выкройка: наплечники кровавого тигра", -- [4]
			"Племя Зандалар", -- [5]
			"", -- [6]
			"", -- [7]
			"Zandalar1|\"\"", -- [8]
		}, -- [19]
		{
			0, -- [1]
			"s3497", -- [2]
			"3854", -- [3]
			"=q2=Клинок ледяного тигра", -- [4]
			"Кузнечное дело: Оружие", -- [5]
			"", -- [6]
			"", -- [7]
			"SmithingWeaponOld2|\"\"", -- [8]
		}, -- [20]
		{
			3, -- [1]
			19768, -- [2]
			"", -- [3]
			"=q1=Кожа древнего тигра", -- [4]
			"Существа (Зул'Гуруб)", -- [5]
			"", -- [6]
			"", -- [7]
			"ZGTrash1|\"\"", -- [8]
		}, -- [21]
		{
			28, -- [1]
			19772, -- [2]
			"", -- [3]
			"=q1=Выкройка: кираса кровавого тигра", -- [4]
			"Племя Зандалар", -- [5]
			"", -- [6]
			"", -- [7]
			"Zandalar2|\"\"", -- [8]
		}, -- [22]
		{
			4, -- [1]
			19902, -- [2]
			"", -- [3]
			"=q4=Стремительный зульский тигр", -- [4]
			"Верховный жрец Текал", -- [5]
			"", -- [6]
			"", -- [7]
			"ZGThekal|\"\"", -- [8]
		}, -- [23]
	},
}
AtlasLootFilterDB = {
	["Relics"] = {
		["Idol"] = true,
		["Libram"] = true,
		["Sigils"] = true,
		["Totem"] = true,
	},
	["WeaponsMeele"] = {
		["Axe"] = true,
		["Shield"] = true,
		["Held in Off-Hand"] = true,
		["Staff"] = true,
		["Dagger"] = true,
		["Mace"] = true,
		["Fist Weapon"] = true,
		["Polearm"] = true,
		["Sword"] = true,
	},
	["Armor"] = {
		["Leather"] = true,
		["Plate"] = true,
		["Cloth"] = true,
		["Mail"] = true,
	},
	["WeaponsMeeleTwoHand"] = {
		["Mace"] = true,
		["Sword"] = true,
		["Axe"] = true,
	},
	["Other"] = {
		["Neck"] = true,
		["Trinket"] = true,
		["Ring"] = true,
		["Back"] = true,
	},
	["WeaponsRanged"] = {
		["Crossbow"] = true,
		["Wand"] = true,
		["Gun"] = true,
		["Bow"] = true,
		["Thrown"] = true,
	},
}
