
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["Minadzuki"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
					},
					["Messages"] = {
						"Joysct Правосудие праведности Minadzuki Crit -3672 (Holy)", -- [1]
						"Joysct Атака ближнего боя Minadzuki Crit -3155 (Physical)", -- [2]
						"Minadzuki умирает.", -- [3]
					},
					["DeathAt"] = 1696717181,
					["HealthNum"] = {
						45.83271869007228, -- [1]
						45.83271869007228, -- [2]
						0, -- [3]
					},
					["MessageTimes"] = {
						-0.2299999999813736, -- [1]
						-0.1020000000135042, -- [2]
						0, -- [3]
					},
					["KilledBy"] = "Joysct",
					["Health"] = {
						"3107 (45%)", -- [1]
						"3107 (45%)", -- [2]
						"0 (0%)", -- [3]
					},
					["EventNum"] = {
						54.16728130992772, -- [1]
						46.54078772680337, -- [2]
						0, -- [3]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"MISC", -- [3]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
					},
					["Messages"] = {
						"Minadzuki Атака ближнего боя Apocryptha Hit -454 (Physical)", -- [1]
						"Minadzuki Власть крови Minadzuki Tick +18", -- [2]
						"Minadzuki Удар закаленным в крови клинком Apocryptha Hit -212 (Physical)", -- [3]
						"Minadzuki Режущий лед Apocryptha Hit -4 (Frost)", -- [4]
						"Minadzuki Некроз Apocryptha Hit -90 (Shadow)", -- [5]
						"Apocryptha Лик смерти Minadzuki Hit -485 (Shadow)", -- [6]
						"Minadzuki Озноб (УЗВ) Apocryptha Tick -212 (Frost)", -- [7]
						"Zilkol Огненная стрела Minadzuki Hit -231 (Fire)", -- [8]
						"Zilkol Огненная стрела Minadzuki Crit -474 (Fire)", -- [9]
						"Minadzuki Озноб (УЗВ) Apocryptha Tick -212 (Frost)", -- [10]
						"Zilkol Огненная стрела Minadzuki Hit -222 (Fire)", -- [11]
						"Minadzuki Озноб (УЗВ) Apocryptha Tick -212 (Frost)", -- [12]
						"Apocryptha Неистовство Тьмы Minadzuki Miss (Shadow)", -- [13]
						"Zilkol Огненная стрела Minadzuki Hit -223 (Fire)", -- [14]
						"Minadzuki Озноб (УЗВ) Apocryptha Tick -211 (Frost)", -- [15]
						"Zilkol Огненная стрела Minadzuki Hit -198 (21 сопрот.) (Fire)", -- [16]
						"Apocryptha Стрела Хаоса Minadzuki Crit -2714 (Fire)", -- [17]
						"Minadzuki умирает.", -- [18]
						"Minadzuki Озноб (УЗВ) Apocryptha Tick -211 (Frost)", -- [19]
					},
					["DeathAt"] = 1696716165,
					["HealthNum"] = {
						52.40973190763986, -- [1]
						52.68867193553386, -- [2]
						52.68867193553386, -- [3]
						52.68867193553386, -- [4]
						52.68867193553386, -- [5]
						45.17278785061212, -- [6]
						45.17278785061212, -- [7]
						41.59305749263908, -- [8]
						34.24763675809701, -- [9]
						34.24763675809701, -- [10]
						30.80737641407098, -- [11]
						30.80737641407098, -- [12]
						30.80737641407098, -- [13]
						27.35161940182861, -- [14]
						27.35161940182861, -- [15]
						24.28327909499458, -- [16]
						0.01549666821633349, -- [17]
						0, -- [18]
						0, -- [19]
					},
					["MessageTimes"] = {
						-13.7850000000326, -- [1]
						-13.57300000003306, -- [2]
						-13.57300000003306, -- [3]
						-13.57300000003306, -- [4]
						-13.4100000000326, -- [5]
						-13.40799999999581, -- [6]
						-10.83799999998882, -- [7]
						-10.82400000002235, -- [8]
						-8.010999999998603, -- [9]
						-7.808000000019092, -- [10]
						-5.969000000040978, -- [11]
						-4.796000000031199, -- [12]
						-4.73399999999674, -- [13]
						-3.981000000028871, -- [14]
						-1.809999999997672, -- [15]
						-1.521999999997206, -- [16]
						-0.04100000002654269, -- [17]
						0, -- [18]
						1.184999999997672, -- [19]
					},
					["KilledBy"] = "Apocryptha",
					["Health"] = {
						"3382 (52%)", -- [1]
						"3400 (52%)", -- [2]
						"3400 (52%)", -- [3]
						"3400 (52%)", -- [4]
						"3400 (52%)", -- [5]
						"2915 (45%)", -- [6]
						"2915 (45%)", -- [7]
						"2684 (41%)", -- [8]
						"2210 (34%)", -- [9]
						"2210 (34%)", -- [10]
						"1988 (30%)", -- [11]
						"1988 (30%)", -- [12]
						"1988 (30%)", -- [13]
						"1765 (27%)", -- [14]
						"1765 (27%)", -- [15]
						"1567 (24%)", -- [16]
						"1 (0%)", -- [17]
						"0 (0%)", -- [18]
						"0 (0%)", -- [19]
					},
					["EventNum"] = {
						0, -- [1]
						0.2789400278940028, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						7.515884084921741, -- [6]
						0, -- [7]
						3.579730357973036, -- [8]
						7.345420734542073, -- [9]
						0, -- [10]
						3.440260344026034, -- [11]
						0, -- [12]
						0, -- [13]
						3.455757012242368, -- [14]
						0, -- [15]
						3.068340306834031, -- [16]
						42.05795753912909, -- [17]
						0, -- [18]
						0, -- [19]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"HEAL", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"MISC", -- [18]
						"DAMAGE", -- [19]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						false, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						false, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						false, -- [30]
						false, -- [31]
						false, -- [32]
						true, -- [33]
						false, -- [34]
						false, -- [35]
						true, -- [36]
						false, -- [37]
						false, -- [38]
						true, -- [39]
						true, -- [40]
						false, -- [41]
						false, -- [42]
					},
					["Messages"] = {
						"Minadzuki Озноб (УЗВ) Tausala Tick -224 (Frost)", -- [1]
						"Minadzuki Удар смерти Tausala Miss (Physical)", -- [2]
						"Minadzuki Кровавая чума (УЗВ) Tausala Tick -182 (Shadow)", -- [3]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -5 (Shadow)", -- [4]
						"Minadzuki Режущий лед Tausala Hit -3 (Frost)", -- [5]
						"Minadzuki Атака ближнего боя Tausala Crit -934 (Physical)", -- [6]
						"Minadzuki Власть крови Minadzuki Tick +30", -- [7]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -5 (Shadow)", -- [8]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -5 (Shadow)", -- [9]
						"Minadzuki Власть крови Minadzuki Tick +18", -- [10]
						"Minadzuki Лик смерти Tausala Hit -582 (Shadow)", -- [11]
						"Minadzuki Озноб (УЗВ) Tausala Tick -228 (Frost)", -- [12]
						"Minadzuki Кровавая чума (УЗВ) Tausala Tick -183 (Shadow)", -- [13]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -5 (Shadow)", -- [14]
						"Tausala Огненный шар Minadzuki Hit -209 (23 сопрот.) (Fire)", -- [15]
						"Minadzuki Нечестивая порча Tausala Absorb (5 Поглощено) (Shadow)", -- [16]
						"Minadzuki Нечестивая порча Tausala Absorb (8 Поглощено) (Shadow)", -- [17]
						"Minadzuki Озноб (УЗВ) Tausala Tick -4 (224 Поглощено) (Frost)", -- [18]
						"Tausala Огненный шар (УЗВ) Minadzuki Tick -8 (Fire)", -- [19]
						"Minadzuki Кровавая чума (УЗВ) Tausala Tick -182 (Shadow)", -- [20]
						"Minadzuki Нечестивая порча Tausala Absorb (8 Поглощено) (Shadow)", -- [21]
						"Minadzuki Нечестивая порча Tausala Absorb (8 Поглощено) (Shadow)", -- [22]
						"Tausala Огненный шар (УЗВ) Minadzuki Tick -8 (Fire)", -- [23]
						"Minadzuki Нечестивая порча Tausala Absorb (8 Поглощено) (Shadow)", -- [24]
						"Minadzuki Озноб (УЗВ) Tausala Tick -14 (213 Поглощено) (Frost)", -- [25]
						"Minadzuki Кровавая чума (УЗВ) Tausala Tick -182 (Shadow)", -- [26]
						"Tausala Ледяная стрела Minadzuki Miss (Frost)", -- [27]
						"Minadzuki Нечестивая порча Tausala Absorb (8 Поглощено) (Shadow)", -- [28]
						"Tausala Огненный шар (УЗВ) Minadzuki Tick -8 (Fire)", -- [29]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -8 (Shadow)", -- [30]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -8 (Shadow)", -- [31]
						"Minadzuki Озноб (УЗВ) Tausala Tick -228 (Frost)", -- [32]
						"Tausala Огненный шар (УЗВ) Minadzuki Tick -6 (1 сопрот.) (Fire)", -- [33]
						"Minadzuki Кровавая чума (УЗВ) Tausala Tick -183 (Shadow)", -- [34]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -8 (Shadow)", -- [35]
						"Tausala Огненный шар Minadzuki Miss (Fire)", -- [36]
						"Minadzuki Нечестивая порча (УЗВ) Tausala Tick -8 (Shadow)", -- [37]
						"Minadzuki Нечестивая порча Tausala Absorb (8 Поглощено) (Shadow)", -- [38]
						"Tausala Огненный взрыв Minadzuki Hit -494 (54 сопрот.) (Fire)", -- [39]
						"Minadzuki умирает.", -- [40]
						"Minadzuki Озноб Tausala Absorb (228 Поглощено) (Frost)", -- [41]
						"Minadzuki Кровавая чума (УЗВ) Tausala Tick -172 (11 Поглощено) (Shadow)", -- [42]
					},
					["DeathAt"] = 1696716027,
					["HealthNum"] = {
						8.817604215093756, -- [1]
						8.817604215093756, -- [2]
						8.817604215093756, -- [3]
						8.817604215093756, -- [4]
						8.817604215093756, -- [5]
						8.817604215093756, -- [6]
						9.28250426158376, -- [7]
						9.28250426158376, -- [8]
						9.28250426158376, -- [9]
						9.561444289477763, -- [10]
						9.561444289477763, -- [11]
						9.561444289477763, -- [12]
						9.561444289477763, -- [13]
						9.561444289477763, -- [14]
						6.322640632264063, -- [15]
						6.322640632264063, -- [16]
						6.322640632264063, -- [17]
						6.322640632264063, -- [18]
						6.198667286533396, -- [19]
						6.198667286533396, -- [20]
						6.198667286533396, -- [21]
						6.198667286533396, -- [22]
						6.074693940802727, -- [23]
						6.074693940802727, -- [24]
						6.074693940802727, -- [25]
						6.074693940802727, -- [26]
						6.074693940802727, -- [27]
						6.074693940802727, -- [28]
						5.95072059507206, -- [29]
						5.95072059507206, -- [30]
						5.95072059507206, -- [31]
						5.95072059507206, -- [32]
						5.857740585774058, -- [33]
						5.857740585774058, -- [34]
						5.857740585774058, -- [35]
						5.857740585774058, -- [36]
						5.857740585774058, -- [37]
						5.857740585774058, -- [38]
						0.01549666821633349, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageTimes"] = {
						-14.76299999997718, -- [1]
						-14.64500000001863, -- [2]
						-14.57799999997951, -- [3]
						-14.51799999998184, -- [4]
						-14.44199999998091, -- [5]
						-13.80599999998231, -- [6]
						-13.65999999997439, -- [7]
						-13.53000000002794, -- [8]
						-12.51900000002934, -- [9]
						-12.04300000000512, -- [10]
						-12.04200000001583, -- [11]
						-11.72000000003027, -- [12]
						-11.51699999999255, -- [13]
						-11.51600000000326, -- [14]
						-10.67599999997765, -- [15]
						-10.53299999999581, -- [16]
						-9.058000000019092, -- [17]
						-8.742000000027474, -- [18]
						-8.668000000005122, -- [19]
						-8.543999999994412, -- [20]
						-8.074000000022352, -- [21]
						-7.086999999999534, -- [22]
						-6.618000000016764, -- [23]
						-6.091000000014901, -- [24]
						-5.75, -- [25]
						-5.505999999993946, -- [26]
						-5.239999999990687, -- [27]
						-5.098999999987427, -- [28]
						-4.686999999976251, -- [29]
						-4.103000000002794, -- [30]
						-3.042000000015833, -- [31]
						-2.732000000018161, -- [32]
						-2.668000000005122, -- [33]
						-2.519000000029337, -- [34]
						-2.093999999982771, -- [35]
						-1.195999999996275, -- [36]
						-1.046000000031199, -- [37]
						-0.121999999973923, -- [38]
						-0.04200000001583248, -- [39]
						0, -- [40]
						0.2339999999967404, -- [41]
						0.4330000000190921, -- [42]
					},
					["KilledBy"] = "Tausala",
					["Health"] = {
						"569 (8%)", -- [1]
						"569 (8%)", -- [2]
						"569 (8%)", -- [3]
						"569 (8%)", -- [4]
						"569 (8%)", -- [5]
						"569 (8%)", -- [6]
						"599 (9%)", -- [7]
						"599 (9%)", -- [8]
						"599 (9%)", -- [9]
						"617 (9%)", -- [10]
						"617 (9%)", -- [11]
						"617 (9%)", -- [12]
						"617 (9%)", -- [13]
						"617 (9%)", -- [14]
						"408 (6%)", -- [15]
						"408 (6%)", -- [16]
						"408 (6%)", -- [17]
						"408 (6%)", -- [18]
						"400 (6%)", -- [19]
						"400 (6%)", -- [20]
						"400 (6%)", -- [21]
						"400 (6%)", -- [22]
						"392 (6%)", -- [23]
						"392 (6%)", -- [24]
						"392 (6%)", -- [25]
						"392 (6%)", -- [26]
						"392 (6%)", -- [27]
						"392 (6%)", -- [28]
						"384 (5%)", -- [29]
						"384 (5%)", -- [30]
						"384 (5%)", -- [31]
						"384 (5%)", -- [32]
						"378 (5%)", -- [33]
						"378 (5%)", -- [34]
						"378 (5%)", -- [35]
						"378 (5%)", -- [36]
						"378 (5%)", -- [37]
						"378 (5%)", -- [38]
						"1 (0%)", -- [39]
						"0 (0%)", -- [40]
						"0 (0%)", -- [41]
						"0 (0%)", -- [42]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0.4649000464900047, -- [7]
						0, -- [8]
						0, -- [9]
						0.2789400278940028, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						3.238803657213699, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0.1239733457306679, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0.1239733457306679, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0.1239733457306679, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0.09298000929800093, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						7.655354098868743, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"HEAL", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"MISC", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
					},
				}, -- [3]
			},
			["TimeLast"] = {
				["TimeHeal"] = 1696717108,
				["Healing"] = 1696717108,
				["HealingTaken"] = 1696717108,
				["OVERALL"] = 1696717179,
				["DamageTaken"] = 1696717178,
				["HOT_Time"] = 1696717108,
				["TimeDamage"] = 1696717108,
				["DeathCount"] = 1696717179,
				["Overhealing"] = 1696717085,
				["Interrupts"] = 1696716828,
				["ActiveTime"] = 1696717108,
				["RunicPowerGain"] = 1696717006,
				["DOT_Time"] = 1696717108,
				["Damage"] = 1696717108,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"HEAL", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"HEAL", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"HEAL", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"HEAL", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"MISC", -- [37]
				"HEAL", -- [38]
				"HEAL", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"DAMAGE", -- [43]
				"HEAL", -- [44]
				"DAMAGE", -- [45]
				"HEAL", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					89.94, -- [1]
				},
				["Interrupts"] = {
					4, -- [1]
				},
				["Healing"] = {
					15354, -- [1]
				},
				["DamageTaken"] = {
					40283, -- [1]
				},
				["HOT_Time"] = {
					588, -- [1]
				},
				["TimeDamage"] = {
					266.6599999999996, -- [1]
				},
				["HealingTaken"] = {
					15354, -- [1]
				},
				["Overhealing"] = {
					4998, -- [1]
				},
				["ActiveTime"] = {
					356.5999999999999, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["RunicPowerGain"] = {
					20, -- [1]
				},
				["DOT_Time"] = {
					531, -- [1]
				},
				["Damage"] = {
					131375, -- [1]
				},
			},
			["enClass"] = "DEATHKNIGHT",
			["LastDamageTaken"] = 3155,
			["LastActive"] = 1696717326,
			["UnitLockout"] = 1696715915,
			["level"] = 65,
			["LastDamageAbility"] = "Атака ближнего боя",
			["LastFightIn"] = 25,
			["LastEventNum"] = {
				1.652161085705856, -- [1]
				[29] = 0.2065201357132321,
				[3] = 0.2655258887741555,
				[7] = 0.1917686974480012,
				[15] = 3.068299159168019,
				[16] = 0.4277917096916949,
				[33] = 0.3540345183655406,
				[35] = 54.16728130992772,
				[36] = 46.54078772680337,
				[38] = 6.534887151497271,
				[39] = 6.534887151497271,
				[20] = 0.1622658209175395,
				[41] = 6.534887151497271,
				[42] = 6.534887151497271,
				[44] = 0.2065201357132321,
				[46] = 0.1770172591827703,
				[24] = 0.2212715739784629,
				[12] = 0.2360230122436938,
				[27] = 1.224369376014161,
				[40] = 6.534887151497271,
			},
			["type"] = "Self",
			["FightsSaved"] = 5,
			["Fights"] = {
				["OverallData"] = {
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Неофит из клана Изувеченной Длани"] = {
									["count"] = 3,
								},
								["Безумный зловепрь"] = {
									["count"] = 12,
								},
								["Apocryptha"] = {
									["count"] = 6,
								},
								["Перозубый опустошитель"] = {
									["count"] = 9,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 12,
								},
								["Tausala"] = {
									["count"] = 21,
								},
								["Калири-пикировщик"] = {
									["count"] = 9,
								},
								["Коготарь Хаал'еши"] = {
									["count"] = 51,
								},
								["Молодой самец калири"] = {
									["count"] = 3,
								},
								["Перозубый быстролап"] = {
									["count"] = 48,
								},
							},
							["amount"] = 174,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Коготарь Хаал'еши"] = {
									["count"] = 54,
								},
								["Безумный зловепрь"] = {
									["count"] = 9,
								},
								["Apocryptha"] = {
									["count"] = 51,
								},
								["Перозубый опустошитель"] = {
									["count"] = 15,
								},
								["Silkcut"] = {
									["count"] = 6,
								},
								["Tausala"] = {
									["count"] = 18,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 21,
								},
								["Калири-пикировщик"] = {
									["count"] = 9,
								},
								["Неофит из клана Изувеченной Длани"] = {
									["count"] = 3,
								},
								["Молодой самец калири"] = {
									["count"] = 3,
								},
								["Перозубый быстролап"] = {
									["count"] = 63,
								},
							},
							["amount"] = 252,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Перозубый опустошитель"] = {
									["count"] = 6,
								},
								["Tausala"] = {
									["count"] = 24,
								},
								["Перозубый быстролап"] = {
									["count"] = 12,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 15,
								},
								["Калири-пикировщик"] = {
									["count"] = 6,
								},
								["Безумный зловепрь"] = {
									["count"] = 3,
								},
								["Молодой самец калири"] = {
									["count"] = 3,
								},
								["Коготарь Хаал'еши"] = {
									["count"] = 36,
								},
							},
							["amount"] = 105,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 12,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 8,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 73,
								},
								["Miss"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 7,
								},
							},
							["amount"] = 99,
						},
						["Holy"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 45,
								},
								["Tick"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 63,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 9,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 10303,
								},
								["Дар наару"] = {
									["count"] = 2266,
								},
								["Власть крови"] = {
									["count"] = 2785,
								},
							},
							["amount"] = 15354,
						},
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 172,
						["Shadow"] = 64,
						["Melee"] = 167,
						["Frost"] = 872,
					},
					["DeathCount"] = 3,
					["HOT_Time"] = 588,
					["ElementTaken"] = {
						["Shadow"] = 3885,
						["Melee"] = 11986,
						["Holy"] = 3672,
						["Frost"] = 2663,
						["Fire"] = 13017,
						["Physical"] = 3813,
						["Nature"] = 1247,
					},
					["DOT_Time"] = 531,
					["Damage"] = 131375,
					["TimeHeal"] = 89.94,
					["ElementDone"] = {
						["Physical"] = 36692,
						["Shadow"] = 33195,
						["Melee"] = 33694,
						["Frost"] = 27794,
					},
					["DamagedWho"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 3132,
								},
								["Лик смерти"] = {
									["count"] = 2972,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1636,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 3979,
								},
								["Режущий лед"] = {
									["count"] = 124,
								},
								["Атака ближнего боя"] = {
									["count"] = 6141,
								},
								["Кровавый удар"] = {
									["count"] = 2506,
								},
								["Удар смерти"] = {
									["count"] = 2274,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1037,
								},
								["Удар чумы"] = {
									["count"] = 1118,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 60,
								},
								["Уничтожение"] = {
									["count"] = 586,
								},
								["Некроз"] = {
									["count"] = 1224,
								},
							},
							["amount"] = 26789,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 738,
								},
								["Атака ближнего боя"] = {
									["count"] = 1599,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 663,
								},
								["Режущий лед"] = {
									["count"] = 40,
								},
								["Удар смерти"] = {
									["count"] = 642,
								},
								["Ледяное прикосновение"] = {
									["count"] = 834,
								},
								["Кровавый удар"] = {
									["count"] = 1155,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 199,
								},
								["Удар чумы"] = {
									["count"] = 1412,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 5,
								},
								["Лик смерти"] = {
									["count"] = 1188,
								},
								["Некроз"] = {
									["count"] = 318,
								},
							},
							["amount"] = 8793,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 1287,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 3662,
								},
								["Режущий лед"] = {
									["count"] = 70,
								},
								["Атака ближнего боя"] = {
									["count"] = 5255,
								},
								["Кровавый удар"] = {
									["count"] = 1348,
								},
								["Ледяное прикосновение"] = {
									["count"] = 399,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1438,
								},
								["Удар чумы"] = {
									["count"] = 1730,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 366,
								},
								["Лик смерти"] = {
									["count"] = 594,
								},
								["Некроз"] = {
									["count"] = 1045,
								},
							},
							["amount"] = 17194,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 43,
								},
								["Атака ближнего боя"] = {
									["count"] = 2326,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1131,
								},
								["Кровавый удар"] = {
									["count"] = 1125,
								},
								["Удар смерти"] = {
									["count"] = 337,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1238,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 558,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 366,
								},
								["Удар чумы"] = {
									["count"] = 955,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 10,
								},
								["Лик смерти"] = {
									["count"] = 1196,
								},
								["Некроз"] = {
									["count"] = 396,
								},
							},
							["amount"] = 9681,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 677,
								},
								["Режущий лед"] = {
									["count"] = 11,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 176,
								},
								["Удар чумы"] = {
									["count"] = 985,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 435,
								},
								["Лик смерти"] = {
									["count"] = 582,
								},
								["Некроз"] = {
									["count"] = 123,
								},
							},
							["amount"] = 2989,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2050,
								},
								["Режущий лед"] = {
									["count"] = 18,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 913,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1267,
								},
								["Удар чумы"] = {
									["count"] = 199,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 52,
								},
								["Лик смерти"] = {
									["count"] = 1164,
								},
								["Некроз"] = {
									["count"] = 223,
								},
							},
							["amount"] = 5886,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 741,
								},
								["Лик смерти"] = {
									["count"] = 594,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1576,
								},
								["Режущий лед"] = {
									["count"] = 78,
								},
								["Атака ближнего боя"] = {
									["count"] = 3465,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1673,
								},
								["Кровавый удар"] = {
									["count"] = 1050,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 298,
								},
								["Удар чумы"] = {
									["count"] = 1599,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 25,
								},
								["Уничтожение"] = {
									["count"] = 1227,
								},
								["Некроз"] = {
									["count"] = 690,
								},
							},
							["amount"] = 13016,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1010,
								},
								["Режущий лед"] = {
									["count"] = 12,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 634,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 548,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 15,
								},
								["Лик смерти"] = {
									["count"] = 1781,
								},
								["Некроз"] = {
									["count"] = 200,
								},
							},
							["amount"] = 4200,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 228,
								},
								["Режущий лед"] = {
									["count"] = 20,
								},
								["Удар смерти"] = {
									["count"] = 316,
								},
								["Кровавый удар"] = {
									["count"] = 381,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 183,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 303,
								},
								["Удар чумы"] = {
									["count"] = 288,
								},
								["Ледяное прикосновение"] = {
									["count"] = 420,
								},
								["Атака ближнего боя"] = {
									["count"] = 1375,
								},
								["Некроз"] = {
									["count"] = 209,
								},
							},
							["amount"] = 3723,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 657,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 216,
								},
								["Режущий лед"] = {
									["count"] = 27,
								},
								["Атака ближнего боя"] = {
									["count"] = 1004,
								},
								["Уничтожение"] = {
									["count"] = 644,
								},
								["Ледяное прикосновение"] = {
									["count"] = 405,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 183,
								},
								["Удар чумы"] = {
									["count"] = 680,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 6,
								},
								["Лик смерти"] = {
									["count"] = 663,
								},
								["Некроз"] = {
									["count"] = 199,
								},
							},
							["amount"] = 4684,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 2346,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2965,
								},
								["Лик смерти"] = {
									["count"] = 3057,
								},
								["Ледяное прикосновение"] = {
									["count"] = 2538,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 4649,
								},
								["Режущий лед"] = {
									["count"] = 122,
								},
								["Атака ближнего боя"] = {
									["count"] = 8792,
								},
								["Кровавый удар"] = {
									["count"] = 3076,
								},
								["Удар смерти"] = {
									["count"] = 1056,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1492,
								},
								["Удар чумы"] = {
									["count"] = 2138,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 35,
								},
								["Уничтожение"] = {
									["count"] = 612,
								},
								["Некроз"] = {
									["count"] = 1542,
								},
							},
							["amount"] = 34420,
						},
					},
					["WhoDamaged"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2861,
								},
							},
							["amount"] = 2861,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Горящие шипы"] = {
									["count"] = 310,
								},
								["Атака ближнего боя"] = {
									["count"] = 679,
								},
							},
							["amount"] = 989,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Поджигание"] = {
									["count"] = 708,
								},
								["Неистовство Тьмы"] = {
									["count"] = 2057,
								},
								["Жертвенный огонь"] = {
									["count"] = 1617,
								},
								["Жертвенный огонь (УЗВ)"] = {
									["count"] = 1063,
								},
								["Стрела Хаоса"] = {
									["count"] = 2714,
								},
								["Лик смерти"] = {
									["count"] = 1478,
								},
								["Огненный щит"] = {
									["count"] = 409,
								},
								["Поджигание (УЗВ)"] = {
									["count"] = 616,
								},
							},
							["amount"] = 10662,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 622,
								},
								["Призыв бесплотной сферы (УЗВ)"] = {
									["count"] = 213,
								},
							},
							["amount"] = 835,
						},
						["Tausala"] = {
							["Details"] = {
								["Конус холода"] = {
									["count"] = 302,
								},
								["Ледяная стрела"] = {
									["count"] = 2361,
								},
								["Огненный взрыв"] = {
									["count"] = 1493,
								},
								["Огненный шар"] = {
									["count"] = 209,
								},
								["Огненный шар (УЗВ)"] = {
									["count"] = 30,
								},
							},
							["amount"] = 4395,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 463,
								},
								["Налет"] = {
									["count"] = 143,
								},
							},
							["amount"] = 606,
						},
						["Капитан клана Изувеченной Длани"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 119,
								},
							},
							["amount"] = 119,
						},
						["Чернокнижник клана Изувеченной Длани"] = {
							["Details"] = {
								["Стрела Тьмы"] = {
									["count"] = 350,
								},
							},
							["amount"] = 350,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 465,
								},
							},
							["amount"] = 465,
						},
						["Zilkol"] = {
							["Details"] = {
								["Огненная стрела"] = {
									["count"] = 3848,
								},
							},
							["amount"] = 3848,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 420,
								},
							},
							["amount"] = 420,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 910,
								},
							},
							["amount"] = 910,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 3294,
								},
							},
							["amount"] = 3294,
						},
						["Silkcut"] = {
							["Details"] = {
								["Цепная молния"] = {
									["count"] = 651,
								},
								["Земной шок"] = {
									["count"] = 383,
								},
							},
							["amount"] = 1034,
						},
						["Калири-матриарх"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 123,
								},
							},
							["amount"] = 123,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2169,
								},
								["Накинуться"] = {
									["count"] = 376,
								},
							},
							["amount"] = 2545,
						},
						["Joysct"] = {
							["Details"] = {
								["Правосудие праведности"] = {
									["count"] = 3672,
								},
								["Атака ближнего боя"] = {
									["count"] = 3155,
								},
							},
							["amount"] = 6827,
						},
					},
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["ElementDoneBlock"] = {
						["Melee"] = 91,
						["Physical"] = 184,
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 4.06,
								},
								["Дар наару"] = {
									["count"] = 10.93,
								},
								["Власть крови"] = {
									["count"] = 74.95000000000003,
								},
							},
							["amount"] = 89.94,
						},
					},
					["OverHeals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 880,
									["min"] = 188,
									["count"] = 7,
									["amount"] = 3912,
								},
							},
							["count"] = 7,
							["amount"] = 3912,
						},
						["Дар наару"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 436,
									["min"] = 351,
									["count"] = 2,
									["amount"] = 787,
								},
							},
							["count"] = 2,
							["amount"] = 787,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 27,
									["min"] = 1,
									["count"] = 21,
									["amount"] = 299,
								},
							},
							["count"] = 21,
							["amount"] = 299,
						},
					},
					["PartialResist"] = {
						["Горящие шипы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Жертвенный огонь (УЗВ)"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 1,
									["amount"] = 50,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 50,
						},
						["Огненный шар (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 1,
									["min"] = 1,
									["count"] = 1,
									["amount"] = 1,
								},
							},
							["count"] = 4,
							["amount"] = 1,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 99,
									["amount"] = 0,
								},
							},
							["count"] = 99,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Налет"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Накинуться"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Огненный шар"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 23,
									["min"] = 23,
									["count"] = 1,
									["amount"] = 23,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 23,
						},
						["Поджигание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Конус холода"] = {
							["Details"] = {
								["50%Сопротив."] = {
									["max"] = 150,
									["min"] = 150,
									["count"] = 1,
									["amount"] = 150,
								},
							},
							["count"] = 1,
							["amount"] = 150,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 11,
									["min"] = 11,
									["count"] = 1,
									["amount"] = 11,
								},
							},
							["count"] = 2,
							["amount"] = 11,
						},
						["Огненная стрела"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 21,
									["min"] = 21,
									["count"] = 1,
									["amount"] = 21,
								},
							},
							["count"] = 16,
							["amount"] = 21,
						},
						["Поджигание (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Правосудие праведности"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Ледяная стрела"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 162,
									["min"] = 54,
									["count"] = 3,
									["amount"] = 272,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["50%Сопротив."] = {
									["max"] = 310,
									["min"] = 310,
									["count"] = 1,
									["amount"] = 310,
								},
							},
							["count"] = 5,
							["amount"] = 582,
						},
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Стрела Тьмы"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 38,
									["min"] = 38,
									["count"] = 1,
									["amount"] = 38,
								},
							},
							["count"] = 1,
							["amount"] = 38,
						},
						["Призыв бесплотной сферы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Огненный взрыв"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 112,
									["min"] = 54,
									["count"] = 3,
									["amount"] = 220,
								},
							},
							["count"] = 3,
							["amount"] = 220,
						},
						["Стрела Хаоса"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Земной шок"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Горящие шипы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Жертвенный огонь (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Огненный шар (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 99,
									["amount"] = 0,
								},
							},
							["count"] = 99,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Налет"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Накинуться"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Огненный шар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Поджигание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Конус холода"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Огненная стрела"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 0,
						},
						["Поджигание (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Правосудие праведности"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Ледяная стрела"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Стрела Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Огненный взрыв"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Стрела Хаоса"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Земной шок"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 356.5999999999999,
					["InterruptData"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Молния (Заморозка разума)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Silkcut"] = {
							["Details"] = {
								["Молния (Заморозка разума)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 10303,
								},
								["Дар наару"] = {
									["count"] = 2266,
								},
								["Власть крови"] = {
									["count"] = 2785,
								},
							},
							["amount"] = 15354,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1014,
									["min"] = 134,
									["count"] = 15,
									["amount"] = 10303,
								},
							},
							["count"] = 15,
							["amount"] = 10303,
						},
						["Дар наару"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 436,
									["min"] = 85,
									["count"] = 7,
									["amount"] = 2266,
								},
							},
							["count"] = 7,
							["amount"] = 2266,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 39,
									["min"] = 1,
									["count"] = 167,
									["amount"] = 2785,
								},
							},
							["count"] = 167,
							["amount"] = 2785,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 88,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 107,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 115,
								},
								["Absorb"] = {
									["count"] = 7,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 93,
								},
							},
							["amount"] = 216,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 61,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 17,
								},
								["Parry"] = {
									["count"] = 4,
								},
							},
							["amount"] = 88,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 164,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 84,
								},
							},
							["amount"] = 251,
						},
					},
					["Overhealing"] = 4998,
					["Interrupts"] = 4,
					["Healing"] = 15354,
					["TimeSpent"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 4.06,
								},
								["Дар наару"] = {
									["count"] = 10.93,
								},
								["Власть крови"] = {
									["count"] = 74.95000000000003,
								},
							},
							["amount"] = 89.94,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0.1,
								},
								["Режущий лед"] = {
									["count"] = 1.39,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.08,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.63,
								},
								["Некроз"] = {
									["count"] = 0.26,
								},
							},
							["amount"] = 7.46,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.23,
								},
								["Атака ближнего боя"] = {
									["count"] = 6.890000000000001,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 4.060000000000001,
								},
								["Режущий лед"] = {
									["count"] = 0.01,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.53,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 18.02,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 37.94000000000001,
								},
								["Режущий лед"] = {
									["count"] = 0.71,
								},
								["Атака ближнего боя"] = {
									["count"] = 20.21,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.21,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.32,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 62.36999999999999,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 2.2,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 3.859999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.92,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.36,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.8200000000000001,
								},
							},
							["amount"] = 12.66,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.33,
								},
								["Режущий лед"] = {
									["count"] = 0.02,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.4,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 5.13,
						},
						["Tausala"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 4.47,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 2.73,
								},
								["Режущий лед"] = {
									["count"] = 0.15,
								},
								["Удар смерти"] = {
									["count"] = 0.12,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб"] = {
									["count"] = 1.89,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.65,
								},
								["Удар чумы"] = {
									["count"] = 0.74,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 4.74,
								},
								["Нечестивая порча"] = {
									["count"] = 6.24,
								},
								["Некроз"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 23.12,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 7.310000000000001,
								},
								["Лик смерти"] = {
									["count"] = 0.76,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.15,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 6.73,
								},
								["Режущий лед"] = {
									["count"] = 0.59,
								},
								["Атака ближнего боя"] = {
									["count"] = 16.94,
								},
								["Кровавый удар"] = {
									["count"] = 0.1,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.05,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 5.6,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 2.19,
								},
							},
							["amount"] = 40.42,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.71,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.44,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.54,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 5.24,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 3.88,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 2.51,
								},
								["Режущий лед"] = {
									["count"] = 0.18,
								},
								["Атака ближнего боя"] = {
									["count"] = 12.12,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.82,
								},
								["Кровавый удар"] = {
									["count"] = 1.34,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0.32,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 2.01,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.61,
								},
							},
							["amount"] = 31.29000000000001,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 4.060000000000001,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.36,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.02,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.5700000000000001,
								},
							},
							["amount"] = 6.279999999999999,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 4.36,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6.94,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Ледяное прикосновение"] = {
									["count"] = 7,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5.62,
								},
								["Режущий лед"] = {
									["count"] = 0.13,
								},
								["Атака ближнего боя"] = {
									["count"] = 21.86999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Удар смерти"] = {
									["count"] = 0.01,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.73,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 3.240000000000001,
								},
							},
							["amount"] = 54.67000000000002,
						},
					},
					["ElementTakenResist"] = {
						["Shadow"] = 38,
						["Fire"] = 315,
						["Frost"] = 732,
						["Nature"] = 11,
					},
					["Attacks"] = {
						["Нечестивая порча"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Смерть и разложение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 224,
									["min"] = 224,
									["count"] = 1,
									["amount"] = 224,
								},
								["Hit"] = {
									["max"] = 113,
									["min"] = 110,
									["count"] = 19,
									["amount"] = 2122,
								},
							},
							["count"] = 20,
							["amount"] = 2346,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 666,
									["min"] = 582,
									["count"] = 23,
									["amount"] = 13791,
								},
							},
							["count"] = 23,
							["amount"] = 13791,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 823,
									["min"] = 823,
									["count"] = 1,
									["amount"] = 823,
								},
								["Hit"] = {
									["max"] = 450,
									["min"] = 396,
									["count"] = 20,
									["amount"] = 8320,
								},
							},
							["count"] = 21,
							["amount"] = 9143,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 188,
									["min"] = 172,
									["count"] = 58,
									["amount"] = 10681,
								},
							},
							["count"] = 58,
							["amount"] = 10681,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5,
									["min"] = 3,
									["count"] = 144,
									["amount"] = 565,
								},
							},
							["count"] = 144,
							["amount"] = 565,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 237,
									["min"] = 4,
									["count"] = 84,
									["amount"] = 18086,
								},
							},
							["count"] = 84,
							["amount"] = 18086,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 333,
									["min"] = 333,
									["count"] = 1,
									["amount"] = 333,
								},
								["Hit"] = {
									["max"] = 501,
									["min"] = 281,
									["count"] = 23,
									["amount"] = 8749,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 764,
									["min"] = 722,
									["count"] = 3,
									["amount"] = 2216,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 11298,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 464,
									["min"] = 305,
									["count"] = 13,
									["amount"] = 4590,
								},
								["Crit"] = {
									["max"] = 676,
									["min"] = 646,
									["count"] = 2,
									["amount"] = 1322,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 5912,
						},
						["Озноб"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 338,
									["min"] = 303,
									["count"] = 3,
									["amount"] = 963,
								},
								["Hit"] = {
									["max"] = 487,
									["min"] = 297,
									["count"] = 58,
									["amount"] = 20744,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 934,
									["min"] = 598,
									["count"] = 17,
									["amount"] = 11987,
								},
								["Parry"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 88,
							["amount"] = 33694,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 132,
									["min"] = 132,
									["count"] = 1,
									["amount"] = 132,
								},
								["Hit"] = {
									["max"] = 275,
									["min"] = 77,
									["count"] = 27,
									["amount"] = 5177,
								},
							},
							["count"] = 28,
							["amount"] = 5309,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 388,
									["min"] = 199,
									["count"] = 14,
									["amount"] = 4170,
								},
								["Crit"] = {
									["max"] = 982,
									["min"] = 657,
									["count"] = 8,
									["amount"] = 5818,
								},
								["Hit (Блокировано)"] = {
									["max"] = 282,
									["min"] = 272,
									["count"] = 4,
									["amount"] = 1116,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 11104,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 10,
									["min"] = 5,
									["count"] = 35,
									["amount"] = 208,
								},
							},
							["count"] = 35,
							["amount"] = 208,
						},
						["Уничтожение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 644,
									["min"] = 586,
									["count"] = 5,
									["amount"] = 3069,
								},
							},
							["count"] = 5,
							["amount"] = 3069,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 185,
									["min"] = 51,
									["count"] = 73,
									["amount"] = 6169,
								},
							},
							["count"] = 73,
							["amount"] = 6169,
						},
					},
					["HealingTaken"] = 15354,
					["DamageTaken"] = 40283,
					["TimeDamage"] = 266.6599999999996,
					["TimeDamaging"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 7.310000000000001,
								},
								["Лик смерти"] = {
									["count"] = 0.76,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.15,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 6.73,
								},
								["Режущий лед"] = {
									["count"] = 0.59,
								},
								["Атака ближнего боя"] = {
									["count"] = 16.94,
								},
								["Кровавый удар"] = {
									["count"] = 0.1,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.05,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 5.6,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 2.19,
								},
							},
							["amount"] = 40.42,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.23,
								},
								["Атака ближнего боя"] = {
									["count"] = 6.890000000000001,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 4.060000000000001,
								},
								["Режущий лед"] = {
									["count"] = 0.01,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.53,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 18.02,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 37.94000000000001,
								},
								["Режущий лед"] = {
									["count"] = 0.71,
								},
								["Атака ближнего боя"] = {
									["count"] = 20.21,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.21,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.32,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 62.36999999999999,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 2.2,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 3.859999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.92,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.36,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.8200000000000001,
								},
							},
							["amount"] = 12.66,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.33,
								},
								["Режущий лед"] = {
									["count"] = 0.02,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.4,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 5.13,
						},
						["Tausala"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 4.47,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 2.73,
								},
								["Режущий лед"] = {
									["count"] = 0.15,
								},
								["Удар смерти"] = {
									["count"] = 0.12,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб"] = {
									["count"] = 1.89,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.65,
								},
								["Удар чумы"] = {
									["count"] = 0.74,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 4.74,
								},
								["Нечестивая порча"] = {
									["count"] = 6.24,
								},
								["Некроз"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 23.12,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 3.88,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 2.51,
								},
								["Режущий лед"] = {
									["count"] = 0.18,
								},
								["Атака ближнего боя"] = {
									["count"] = 12.12,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.82,
								},
								["Кровавый удар"] = {
									["count"] = 1.34,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0.32,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 2.01,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.61,
								},
							},
							["amount"] = 31.29000000000001,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.71,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.44,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.54,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 5.24,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0.1,
								},
								["Режущий лед"] = {
									["count"] = 1.39,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.08,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.63,
								},
								["Некроз"] = {
									["count"] = 0.26,
								},
							},
							["amount"] = 7.46,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 4.060000000000001,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.36,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0.02,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.5700000000000001,
								},
							},
							["amount"] = 6.279999999999999,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 4.36,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6.94,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Ледяное прикосновение"] = {
									["count"] = 7,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5.62,
								},
								["Режущий лед"] = {
									["count"] = 0.13,
								},
								["Атака ближнего боя"] = {
									["count"] = 21.86999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Удар смерти"] = {
									["count"] = 0.01,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.73,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 3.240000000000001,
								},
							},
							["amount"] = 54.67000000000002,
						},
					},
					["RunicPowerGain"] = 20,
					["HOTs"] = {
						["Дар наару"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 564,
								},
							},
							["amount"] = 564,
						},
					},
					["RunicPowerGainedFrom"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
				},
				["Fight5"] = {
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Перозубый опустошитель"] = {
									["count"] = 3,
								},
								["Молодой самец калири"] = {
									["count"] = 0,
								},
								["Tausala"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Перозубый опустошитель"] = {
									["count"] = 6,
								},
								["Молодой самец калири"] = {
									["count"] = 0,
								},
								["Apocryptha"] = {
									["count"] = 0,
								},
							},
							["amount"] = 6,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Молодой самец калири"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 358,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 21,
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Shadow"] = 0,
						["Fire"] = 0,
						["Melee"] = 358,
						["Nature"] = 0,
					},
					["DOT_Time"] = 9,
					["Damage"] = 4278,
					["ElementDoneAbsorb"] = {
						["Frost"] = 0,
						["Shadow"] = 0,
					},
					["TimeHeal"] = 1.7,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненная стрела"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Налет"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Стрела Хаоса"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Physical"] = 1581,
						["Frost"] = 900,
						["Melee"] = 1397,
						["Shadow"] = 400,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Zilkol"] = {
							["Details"] = {
								["Огненная стрела"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 358,
								},
								["Призыв бесплотной сферы (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 358,
						},
						["Капитан клана Изувеченной Длани"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Стрела Хаоса"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
						["Physical"] = 31,
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.73,
								},
								["Власть крови"] = {
									["count"] = 0.9700000000000001,
								},
							},
							["amount"] = 1.7,
						},
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 9.789999999999999,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 1014,
								},
								["Власть крови"] = {
									["count"] = 107,
								},
							},
							["amount"] = 1121,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненная стрела"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Налет"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Стрела Хаоса"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 0,
						["Nature"] = 0,
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 2.79,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.4,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.03,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 0.37,
								},
							},
							["amount"] = 8.09,
						},
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.73,
								},
								["Власть крови"] = {
									["count"] = 0.9700000000000001,
								},
							},
							["amount"] = 1.7,
						},
						["Tausala"] = {
							["Details"] = {
								["Озноб"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1014,
									["min"] = 1014,
									["count"] = 1,
									["amount"] = 1014,
								},
							},
							["count"] = 1,
							["amount"] = 1014,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 107,
								},
							},
							["count"] = 7,
							["amount"] = 107,
						},
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 1014,
								},
								["Власть крови"] = {
									["count"] = 107,
								},
							},
							["amount"] = 1121,
						},
					},
					["Healing"] = 1121,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Озноб"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Уничтожение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 188,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 188,
								},
							},
							["count"] = 1,
							["amount"] = 188,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 710,
									["min"] = 710,
									["count"] = 1,
									["amount"] = 710,
								},
								["Hit"] = {
									["max"] = 353,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 687,
								},
							},
							["count"] = 3,
							["amount"] = 1397,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 237,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 462,
								},
							},
							["count"] = 2,
							["amount"] = 462,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 23,
								},
							},
							["count"] = 6,
							["amount"] = 23,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 337,
									["min"] = 337,
									["count"] = 1,
									["amount"] = 337,
								},
							},
							["count"] = 1,
							["amount"] = 337,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 383,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 749,
								},
							},
							["count"] = 2,
							["amount"] = 749,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 415,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 415,
								},
							},
							["count"] = 1,
							["amount"] = 415,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 213,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 213,
								},
							},
							["count"] = 1,
							["amount"] = 213,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 282,
									["min"] = 282,
									["count"] = 1,
									["amount"] = 282,
								},
							},
							["count"] = 1,
							["amount"] = 282,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 142,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 212,
								},
							},
							["count"] = 2,
							["amount"] = 212,
						},
					},
					["HealingTaken"] = 1121,
					["DamagedWho"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 462,
								},
								["Режущий лед"] = {
									["count"] = 23,
								},
								["Удар смерти"] = {
									["count"] = 337,
								},
								["Атака ближнего боя"] = {
									["count"] = 1397,
								},
								["Кровавый удар"] = {
									["count"] = 749,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 213,
								},
								["Удар чумы"] = {
									["count"] = 282,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 188,
								},
								["Ледяное прикосновение"] = {
									["count"] = 415,
								},
								["Некроз"] = {
									["count"] = 212,
								},
							},
							["amount"] = 4278,
						},
						["Tausala"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 8.09,
					["TimeDamaging"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 2.79,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.4,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.03,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 0.37,
								},
							},
							["amount"] = 8.09,
						},
						["Tausala"] = {
							["Details"] = {
								["Озноб"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Перозубый опустошитель"] = {
									["count"] = 0,
								},
								["Tausala"] = {
									["count"] = 0,
								},
								["Калири-пикировщик"] = {
									["count"] = 0,
								},
								["Неофит из клана Изувеченной Длани"] = {
									["count"] = 0,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Перозубый опустошитель"] = {
									["count"] = 0,
								},
								["Tausala"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 0,
								},
								["Калири-пикировщик"] = {
									["count"] = 0,
								},
								["Неофит из клана Изувеченной Длани"] = {
									["count"] = 0,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Apocryptha"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Калири-пикировщик"] = {
									["count"] = 0,
								},
								["Tausala"] = {
									["count"] = 0,
								},
								["Перозубый опустошитель"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Parry"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Holy"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["HOTs"] = {
						["Дар наару"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Shadow"] = 0,
						["Melee"] = 0,
						["Holy"] = 0,
						["Physical"] = 0,
						["Fire"] = 0,
						["Frost"] = 0,
						["Nature"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
						["Physical"] = 0,
						["Shadow"] = 0,
						["Melee"] = 0,
						["Frost"] = 0,
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Жертвенный огонь (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный шар (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Налет"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный шар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Конус холода"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненная стрела"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяная стрела"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный взрыв"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Правосудие праведности"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Physical"] = 0,
						["Shadow"] = 0,
						["Melee"] = 0,
						["Frost"] = 0,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Parry"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Absorb"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
								["Жертвенный огонь"] = {
									["count"] = 0,
								},
								["Жертвенный огонь (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Огненный щит"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Призыв бесплотной сферы (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Налет"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Конус холода"] = {
									["count"] = 0,
								},
								["Ледяная стрела"] = {
									["count"] = 0,
								},
								["Огненный взрыв"] = {
									["count"] = 0,
								},
								["Огненный шар"] = {
									["count"] = 0,
								},
								["Огненный шар (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Zilkol"] = {
							["Details"] = {
								["Огненная стрела"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Joysct"] = {
							["Details"] = {
								["Правосудие праведности"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
						["Melee"] = 0,
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 0,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Жертвенный огонь (УЗВ)"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный шар (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Налет"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный шар"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Конус холода"] = {
							["Details"] = {
								["50%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненная стрела"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяная стрела"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["50%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный взрыв"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Правосудие праведности"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 0,
						["Frost"] = 0,
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Нечестивая порча"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Дар наару"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Healing"] = 0,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Нечестивая порча"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["DOTs"] = {
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 3,
								},
								["Apocryptha"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeSpent"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0.9,
								},
							},
							["amount"] = 0.9,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.53,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.35,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.64,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.35,
								},
							},
							["amount"] = 7.37,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
					},
					["ElementTakenResist"] = {
						["Shadow"] = 0,
					},
					["HOT_Time"] = 15,
					["ElementTaken"] = {
						["Physical"] = 0,
						["Melee"] = 291,
						["Shadow"] = 0,
					},
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 3605,
					["TimeHeal"] = 0.9,
					["ElementDone"] = {
						["Shadow"] = 408,
						["Physical"] = 1429,
						["Melee"] = 1106,
						["Frost"] = 662,
					},
					["DamagedWho"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 391,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 224,
								},
								["Режущий лед"] = {
									["count"] = 16,
								},
								["Атака ближнего боя"] = {
									["count"] = 1106,
								},
								["Ледяное прикосновение"] = {
									["count"] = 422,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 132,
								},
								["Удар чумы"] = {
									["count"] = 294,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 188,
								},
								["Уничтожение"] = {
									["count"] = 612,
								},
								["Некроз"] = {
									["count"] = 220,
								},
							},
							["amount"] = 3605,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Чернокнижник клана Изувеченной Длани"] = {
							["Details"] = {
								["Стрела Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 291,
								},
								["Накинуться"] = {
									["count"] = 0,
								},
							},
							["amount"] = 291,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneBlock"] = {
						["Physical"] = 30,
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0.9,
								},
							},
							["amount"] = 0.9,
						},
					},
					["OverHeals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Стрела Тьмы"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Накинуться"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Стрела Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Накинуться"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 8.27,
					["InterruptData"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Молния (Заморозка разума)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 29,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 93,
								},
							},
							["count"] = 5,
							["amount"] = 93,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
					},
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 0,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Healing"] = 93,
					["DamageTaken"] = 291,
					["DOT_Time"] = 6,
					["Attacks"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 16,
								},
							},
							["count"] = 4,
							["amount"] = 16,
						},
						["Уничтожение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 612,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 612,
								},
							},
							["count"] = 1,
							["amount"] = 612,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 224,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 224,
								},
							},
							["count"] = 1,
							["amount"] = 224,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 391,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 391,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 391,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 422,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 422,
								},
							},
							["count"] = 1,
							["amount"] = 422,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 364,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 364,
								},
								["Parry"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 742,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 742,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 1106,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 132,
									["min"] = 132,
									["count"] = 1,
									["amount"] = 132,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 132,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 294,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 294,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 294,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 188,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 188,
								},
							},
							["count"] = 1,
							["amount"] = 188,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 148,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 220,
								},
							},
							["count"] = 2,
							["amount"] = 220,
						},
					},
					["HealingTaken"] = 93,
					["Overhealing"] = 0,
					["TimeDamage"] = 7.37,
					["TimeDamaging"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.53,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.35,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.64,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.35,
								},
							},
							["amount"] = 7.37,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["Interrupts"] = 0,
					["RunicPowerGainedFrom"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["Fight4"] = {
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 3,
								},
								["Apocryptha"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
								["Silkcut"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 6,
								},
								["Apocryptha"] = {
									["count"] = 0,
								},
							},
							["amount"] = 6,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 0,
					},
					["Ressed"] = 0,
					["DamageTaken"] = 242,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 24,
					["HOTs"] = {
						["Дар наару"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Shadow"] = 0,
						["Melee"] = 242,
						["Fire"] = 0,
						["Physical"] = 0,
						["Nature"] = 0,
					},
					["DOT_Time"] = 9,
					["Damage"] = 4528,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 2.23,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Огненная стрела"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Поджигание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Поджигание (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Земной шок"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Physical"] = 1214,
						["Shadow"] = 1054,
						["Melee"] = 1346,
						["Frost"] = 914,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Zilkol"] = {
							["Details"] = {
								["Огненная стрела"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Silkcut"] = {
							["Details"] = {
								["Цепная молния"] = {
									["count"] = 0,
								},
								["Земной шок"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 242,
								},
							},
							["amount"] = 242,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
								["Жертвенный огонь"] = {
									["count"] = 0,
								},
								["Поджигание"] = {
									["count"] = 0,
								},
								["Огненный щит"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Поджигание (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.18,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 2.05,
								},
							},
							["amount"] = 2.23,
						},
					},
					["OverHeals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Дар наару"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 9.969999999999997,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 1014,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 125,
								},
							},
							["amount"] = 1139,
						},
					},
					["PartialResist"] = {
						["Огненная стрела"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Поджигание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Поджигание (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Земной шок"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
					},
					["InterruptData"] = {
						["Silkcut"] = {
							["Details"] = {
								["Молния (Заморозка разума)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.18,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 2.05,
								},
							},
							["amount"] = 2.23,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.56,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.96,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.01,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.58,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.6300000000000001,
								},
							},
							["amount"] = 7.74,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1014,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 1014,
								},
							},
							["count"] = 1,
							["amount"] = 1014,
						},
						["Дар наару"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 25,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 125,
								},
							},
							["count"] = 8,
							["amount"] = 125,
						},
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 1014,
								},
								["Дар наару"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 125,
								},
							},
							["amount"] = 1139,
						},
					},
					["Healing"] = 1139,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 429,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 429,
								},
							},
							["count"] = 1,
							["amount"] = 429,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 387,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 387,
								},
							},
							["count"] = 1,
							["amount"] = 387,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 237,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 465,
								},
							},
							["count"] = 2,
							["amount"] = 465,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 20,
								},
							},
							["count"] = 5,
							["amount"] = 20,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 359,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 706,
								},
								["Parry"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 640,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 640,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 1346,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 188,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 188,
								},
							},
							["count"] = 1,
							["amount"] = 188,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 310,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 310,
								},
							},
							["count"] = 1,
							["amount"] = 310,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 208,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 208,
								},
							},
							["count"] = 1,
							["amount"] = 208,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 309,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 309,
								},
							},
							["count"] = 1,
							["amount"] = 309,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 598,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 598,
								},
							},
							["count"] = 1,
							["amount"] = 598,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 128,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 268,
								},
							},
							["count"] = 3,
							["amount"] = 268,
						},
					},
					["HealingTaken"] = 1139,
					["DamagedWho"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1346,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 465,
								},
								["Режущий лед"] = {
									["count"] = 20,
								},
								["Удар смерти"] = {
									["count"] = 310,
								},
								["Кровавый удар"] = {
									["count"] = 387,
								},
								["Ледяное прикосновение"] = {
									["count"] = 429,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 208,
								},
								["Удар чумы"] = {
									["count"] = 309,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 188,
								},
								["Лик смерти"] = {
									["count"] = 598,
								},
								["Некроз"] = {
									["count"] = 268,
								},
							},
							["amount"] = 4528,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 7.74,
					["TimeDamaging"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.56,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.96,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.01,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.58,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.6300000000000001,
								},
							},
							["amount"] = 7.74,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 3,
								},
								["Apocryptha"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeSpent"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0.9,
								},
							},
							["amount"] = 0.9,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.53,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.35,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.64,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.35,
								},
							},
							["amount"] = 7.37,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
					},
					["ElementTakenResist"] = {
						["Shadow"] = 0,
					},
					["HOT_Time"] = 15,
					["ElementTaken"] = {
						["Physical"] = 0,
						["Melee"] = 291,
						["Shadow"] = 0,
					},
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 3605,
					["TimeHeal"] = 0.9,
					["ElementDone"] = {
						["Shadow"] = 408,
						["Physical"] = 1429,
						["Melee"] = 1106,
						["Frost"] = 662,
					},
					["DamagedWho"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 391,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 224,
								},
								["Режущий лед"] = {
									["count"] = 16,
								},
								["Атака ближнего боя"] = {
									["count"] = 1106,
								},
								["Ледяное прикосновение"] = {
									["count"] = 422,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 132,
								},
								["Удар чумы"] = {
									["count"] = 294,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 188,
								},
								["Уничтожение"] = {
									["count"] = 612,
								},
								["Некроз"] = {
									["count"] = 220,
								},
							},
							["amount"] = 3605,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Чернокнижник клана Изувеченной Длани"] = {
							["Details"] = {
								["Стрела Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 291,
								},
								["Накинуться"] = {
									["count"] = 0,
								},
							},
							["amount"] = 291,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneBlock"] = {
						["Physical"] = 30,
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0.9,
								},
							},
							["amount"] = 0.9,
						},
					},
					["OverHeals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Стрела Тьмы"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Накинуться"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Стрела Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Накинуться"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 8.27,
					["InterruptData"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Молния (Заморозка разума)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 29,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 93,
								},
							},
							["count"] = 5,
							["amount"] = 93,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
					},
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 0,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Healing"] = 93,
					["DamageTaken"] = 291,
					["DOT_Time"] = 6,
					["Attacks"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 16,
								},
							},
							["count"] = 4,
							["amount"] = 16,
						},
						["Уничтожение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 612,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 612,
								},
							},
							["count"] = 1,
							["amount"] = 612,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 224,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 224,
								},
							},
							["count"] = 1,
							["amount"] = 224,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 391,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 391,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 391,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 422,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 422,
								},
							},
							["count"] = 1,
							["amount"] = 422,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 364,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 364,
								},
								["Parry"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 742,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 742,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 1106,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 132,
									["min"] = 132,
									["count"] = 1,
									["amount"] = 132,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 132,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 294,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 294,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 294,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 188,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 188,
								},
							},
							["count"] = 1,
							["amount"] = 188,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 148,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 220,
								},
							},
							["count"] = 2,
							["amount"] = 220,
						},
					},
					["HealingTaken"] = 93,
					["Overhealing"] = 0,
					["TimeDamage"] = 7.37,
					["TimeDamaging"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.53,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.35,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.64,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.35,
								},
							},
							["amount"] = 7.37,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["Interrupts"] = 0,
					["RunicPowerGainedFrom"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["Fight2"] = {
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
								["Безумный зловепрь"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 3,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Безумный зловепрь"] = {
									["count"] = 0,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Перозубый быстролап"] = {
									["count"] = 12,
								},
								["Безумный зловепрь"] = {
									["count"] = 0,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 324,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 21,
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Fire"] = 0,
						["Melee"] = 324,
						["Physical"] = 0,
					},
					["DOT_Time"] = 15,
					["Damage"] = 4290,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 2.14,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Горящие шипы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Physical"] = 594,
						["Shadow"] = 2217,
						["Melee"] = 1013,
						["Frost"] = 466,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 5,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 324,
								},
							},
							["amount"] = 324,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Горящие шипы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-матриарх"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
						["Physical"] = 0,
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 2.14,
								},
							},
							["amount"] = 2.14,
						},
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 10.07,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 115,
								},
							},
							["amount"] = 115,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Горящие шипы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
					},
					["InterruptData"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Молния (Заморозка разума)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 2.14,
								},
							},
							["amount"] = 2.14,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.98,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.73,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.33,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 7.930000000000001,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 23,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 115,
								},
							},
							["count"] = 7,
							["amount"] = 115,
						},
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 115,
								},
							},
							["amount"] = 115,
						},
					},
					["Healing"] = 115,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 598,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 1793,
								},
							},
							["count"] = 3,
							["amount"] = 1793,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 450,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 450,
								},
							},
							["count"] = 1,
							["amount"] = 450,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 16,
								},
							},
							["count"] = 4,
							["amount"] = 16,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 353,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 1013,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 1013,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 188,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 188,
								},
							},
							["count"] = 1,
							["amount"] = 188,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 198,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 286,
								},
							},
							["count"] = 2,
							["amount"] = 286,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 308,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 308,
								},
							},
							["count"] = 1,
							["amount"] = 308,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 10,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 35,
								},
							},
							["count"] = 4,
							["amount"] = 35,
						},
						["Уничтожение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 70,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 201,
								},
							},
							["count"] = 3,
							["amount"] = 201,
						},
					},
					["HealingTaken"] = 115,
					["DamagedWho"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 16,
								},
								["Атака ближнего боя"] = {
									["count"] = 1013,
								},
								["Ледяное прикосновение"] = {
									["count"] = 450,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 35,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 286,
								},
								["Удар чумы"] = {
									["count"] = 308,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 188,
								},
								["Лик смерти"] = {
									["count"] = 1793,
								},
								["Некроз"] = {
									["count"] = 201,
								},
							},
							["amount"] = 4290,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 7.930000000000001,
					["TimeDamaging"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.98,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.73,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0.33,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 7.930000000000001,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight3"] = {
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
								["Безумный зловепрь"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 3,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
								["Безумный зловепрь"] = {
									["count"] = 0,
								},
								["Перозубый быстролап"] = {
									["count"] = 6,
								},
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
							},
							["amount"] = 6,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Ветроступ Хаал'еши"] = {
									["count"] = 0,
								},
								["Коготарь Хаал'еши"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 116,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 24,
					["HOTs"] = {
						["Дар наару"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Melee"] = 116,
						["Fire"] = 0,
					},
					["DOT_Time"] = 9,
					["Damage"] = 4166,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 2,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Горящие шипы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Frost"] = 900,
						["Physical"] = 1780,
						["Melee"] = 1083,
						["Shadow"] = 403,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Горящие шипы"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneBlock"] = {
						["Physical"] = 30,
					},
					["TimeHealing"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.29,
								},
								["Власть крови"] = {
									["count"] = 1.71,
								},
							},
							["amount"] = 2,
						},
					},
					["OverHeals"] = {
						["Дар наару"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 751,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 751,
								},
							},
							["count"] = 1,
							["amount"] = 751,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 14,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 30,
								},
							},
							["count"] = 3,
							["amount"] = 30,
						},
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 10.06,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 263,
								},
								["Власть крови"] = {
									["count"] = 85,
								},
							},
							["amount"] = 348,
						},
					},
					["PartialResist"] = {
						["Горящие шипы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 781,
					["ElementTakenResist"] = {
					},
					["InterruptData"] = {
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Молния (Заморозка разума)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.29,
								},
								["Власть крови"] = {
									["count"] = 1.71,
								},
							},
							["amount"] = 2,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0.86,
								},
								["Режущий лед"] = {
									["count"] = 0.13,
								},
								["Атака ближнего боя"] = {
									["count"] = 4.95,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.23,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.62,
								},
							},
							["amount"] = 8.059999999999999,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 263,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 263,
								},
							},
							["count"] = 1,
							["amount"] = 263,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 30,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 85,
								},
							},
							["count"] = 5,
							["amount"] = 85,
						},
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
						["Minadzuki"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 263,
								},
								["Власть крови"] = {
									["count"] = 85,
								},
							},
							["amount"] = 348,
						},
					},
					["Healing"] = 348,
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Minadzuki"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 188,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 188,
								},
							},
							["count"] = 1,
							["amount"] = 188,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 418,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 418,
								},
							},
							["count"] = 1,
							["amount"] = 418,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 237,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 465,
								},
							},
							["count"] = 2,
							["amount"] = 465,
						},
						["Режущий лед"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 17,
								},
							},
							["count"] = 5,
							["amount"] = 17,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 351,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 351,
								},
							},
							["count"] = 1,
							["amount"] = 351,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 368,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 1083,
								},
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 1083,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 385,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 385,
								},
								["Crit"] = {
									["max"] = 764,
									["min"] = 764,
									["count"] = 1,
									["amount"] = 764,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 1149,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 280,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 280,
								},
							},
							["count"] = 1,
							["amount"] = 280,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Уничтожение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 73,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 215,
								},
							},
							["count"] = 3,
							["amount"] = 215,
						},
					},
					["HealingTaken"] = 348,
					["DamagedWho"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 465,
								},
								["Режущий лед"] = {
									["count"] = 17,
								},
								["Атака ближнего боя"] = {
									["count"] = 1083,
								},
								["Удар смерти"] = {
									["count"] = 351,
								},
								["Кровавый удар"] = {
									["count"] = 1149,
								},
								["Удар чумы"] = {
									["count"] = 280,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 188,
								},
								["Ледяное прикосновение"] = {
									["count"] = 418,
								},
								["Некроз"] = {
									["count"] = 215,
								},
							},
							["amount"] = 4166,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 8.059999999999999,
					["TimeDamaging"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0.86,
								},
								["Режущий лед"] = {
									["count"] = 0.13,
								},
								["Атака ближнего боя"] = {
									["count"] = 4.95,
								},
								["Удар смерти"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 1.23,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0.62,
								},
							},
							["amount"] = 8.059999999999999,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Режущий лед"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Уничтожение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
			},
			["LastEventHealth"] = {
				"6651 (98%)", -- [1]
				"6539 (96%)", -- [2]
				"6557 (96%)", -- [3]
				"6557 (96%)", -- [4]
				"6557 (96%)", -- [5]
				"6557 (96%)", -- [6]
				"6570 (96%)", -- [7]
				"6570 (96%)", -- [8]
				"6570 (96%)", -- [9]
				"6570 (96%)", -- [10]
				"6570 (96%)", -- [11]
				"6681 (98%)", -- [12]
				"6681 (98%)", -- [13]
				"6681 (98%)", -- [14]
				"6681 (98%)", -- [15]
				"6502 (95%)", -- [16]
				"6502 (95%)", -- [17]
				"6502 (95%)", -- [18]
				"6502 (95%)", -- [19]
				"6513 (96%)", -- [20]
				"6513 (96%)", -- [21]
				"6513 (96%)", -- [22]
				"6513 (96%)", -- [23]
				"6528 (96%)", -- [24]
				"6528 (96%)", -- [25]
				"6528 (96%)", -- [26]
				"6528 (96%)", -- [27]
				"6445 (95%)", -- [28]
				"6459 (95%)", -- [29]
				"6459 (95%)", -- [30]
				"6459 (95%)", -- [31]
				"6459 (95%)", -- [32]
				"6483 (95%)", -- [33]
				"6483 (95%)", -- [34]
				"3107 (45%)", -- [35]
				"3107 (45%)", -- [36]
				"0 (0%)", -- [37]
				"507 (7%)", -- [38]
				"982 (14%)", -- [39]
				"1488 (21%)", -- [40]
				"1963 (28%)", -- [41]
				"2470 (36%)", -- [42]
				"6625 (97%)", -- [43]
				"6639 (97%)", -- [44]
				"6639 (97%)", -- [45]
				"6651 (98%)", -- [46]
				"6651 (98%)", -- [47]
				"6651 (98%)", -- [48]
				"6651 (98%)", -- [49]
				"6651 (98%)", -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"Skullchewer <Minadzuki>", -- [1]
			},
			["NextEventNum"] = 43,
			["LastEventHealthNum"] = {
				98.11181590205045, -- [1]
				96.4596548163446, -- [2]
				96.72518070511875, -- [3]
				96.72518070511875, -- [4]
				96.72518070511875, -- [5]
				96.72518070511875, -- [6]
				96.91694940256674, -- [7]
				96.91694940256674, -- [8]
				96.91694940256674, -- [9]
				96.91694940256674, -- [10]
				96.91694940256674, -- [11]
				98.55435905000738, -- [12]
				98.55435905000738, -- [13]
				98.55435905000738, -- [14]
				98.55435905000738, -- [15]
				95.91385160053105, -- [16]
				95.91385160053105, -- [17]
				95.91385160053105, -- [18]
				95.91385160053105, -- [19]
				96.07611742144859, -- [20]
				96.07611742144859, -- [21]
				96.07611742144859, -- [22]
				96.07611742144859, -- [23]
				96.29738899542706, -- [24]
				96.29738899542706, -- [25]
				96.29738899542706, -- [26]
				96.29738899542706, -- [27]
				95.07301961941289, -- [28]
				95.27953975512612, -- [29]
				95.27953975512612, -- [30]
				95.27953975512612, -- [31]
				95.27953975512612, -- [32]
				95.63357427349166, -- [33]
				95.63357427349166, -- [34]
				45.83271869007228, -- [35]
				45.83271869007228, -- [36]
				0, -- [37]
				7.478979200472046, -- [38]
				14.48591237645671, -- [39]
				21.95014013866352, -- [40]
				28.95707331464818, -- [41]
				36.43605251512022, -- [42]
				97.72827850715444, -- [43]
				97.93479864286768, -- [44]
				97.93479864286768, -- [45]
				98.11181590205045, -- [46]
				98.11181590205045, -- [47]
				98.11181590205045, -- [48]
				98.11181590205045, -- [49]
				98.11181590205045, -- [50]
			},
			["LastEvents"] = {
				"Перозубый быстролап Атака ближнего боя Minadzuki Hit -112 (Physical)", -- [1]
				"Minadzuki Нечестивая порча (УЗВ) Перозубый быстролап Tick -10 (Shadow)", -- [2]
				"Minadzuki Власть крови Minadzuki Tick +18", -- [3]
				"Minadzuki Ледяное прикосновение Перозубый быстролап Hit -450 (Frost)", -- [4]
				"Minadzuki Нечестивая порча (УЗВ) Перозубый быстролап Tick -10 (Shadow)", -- [5]
				"Minadzuki Атака ближнего боя Перозубый быстролап Hit -336 (Physical)", -- [6]
				"Minadzuki Власть крови Minadzuki Tick +13", -- [7]
				"Minadzuki Удар закаленным в крови клинком Перозубый быстролап Hit -198 (Physical)", -- [8]
				"Minadzuki Режущий лед Перозубый быстролап Hit -5 (Frost)", -- [9]
				"Minadzuki Некроз Перозубый быстролап Hit -67 (Shadow)", -- [10]
				"Minadzuki Кровавая чума (УЗВ) Перозубый быстролап Tick -188 (Shadow)", -- [11]
				"Minadzuki Власть крови Minadzuki Tick +16", -- [12]
				"Minadzuki Ледяное прикосновение Перозубый быстролап Hit -422 (Frost)", -- [13]
				"Minadzuki Атака ближнего боя Перозубый быстролап Crit -742 (Physical)", -- [14]
				"Перозубый быстролап Атака ближнего боя Minadzuki Crit -208 (Physical)", -- [15]
				"Minadzuki Власть крови Minadzuki Tick +29", -- [16]
				"Minadzuki Удар закаленным в крови клинком Перозубый быстролап Hit -132 (Physical)", -- [17]
				"Minadzuki Режущий лед Перозубый быстролап Hit -4 (Frost)", -- [18]
				"Minadzuki Некроз Перозубый быстролап Hit -148 (Shadow)", -- [19]
				"Minadzuki Власть крови Minadzuki Tick +11", -- [20]
				"Minadzuki Режущий лед Перозубый быстролап Hit -3 (Frost)", -- [21]
				"Minadzuki Удар чумы Перозубый быстролап Hit -294 (Physical)", -- [22]
				"Minadzuki Озноб (УЗВ) Перозубый быстролап Tick -224 (Frost)", -- [23]
				"Minadzuki Власть крови Minadzuki Tick +15", -- [24]
				"Minadzuki Режущий лед Перозубый быстролап Hit -4 (Frost)", -- [25]
				"Minadzuki Кровавый удар Перозубый быстролап Hit -391 (Physical)", -- [26]
				"Перозубый быстролап Атака ближнего боя Minadzuki Hit -83 (Physical)", -- [27]
				"Minadzuki Атака ближнего боя Перозубый быстролап Hit -364 (Physical)", -- [28]
				"Minadzuki Власть крови Minadzuki Tick +14", -- [29]
				"Minadzuki Режущий лед Перозубый быстролап Hit -5 (Frost)", -- [30]
				"Minadzuki Некроз Перозубый быстролап Hit -72 (Shadow)", -- [31]
				"Minadzuki Кровавая чума (УЗВ) Перозубый быстролап Tick -188 (Shadow)", -- [32]
				"Minadzuki Власть крови Minadzuki Tick +24", -- [33]
				"Minadzuki Уничтожение Перозубый быстролап Hit -612 (Physical)", -- [34]
				"Joysct Правосудие праведности Minadzuki Crit -3672 (Holy)", -- [35]
				"Joysct Атака ближнего боя Minadzuki Crit -3155 (Physical)", -- [36]
				"Minadzuki умирает.", -- [37]
				"Minadzuki Дар наару Minadzuki Tick +443", -- [38]
				"Minadzuki Дар наару Minadzuki Tick +443", -- [39]
				"Minadzuki Дар наару Minadzuki Tick +443", -- [40]
				"Minadzuki Дар наару Minadzuki Tick +443", -- [41]
				"Minadzuki Дар наару Minadzuki Tick +443", -- [42]
				"Minadzuki Атака ближнего боя Перозубый быстролап Hit -353 (Physical)", -- [43]
				"Minadzuki Власть крови Minadzuki Tick +14", -- [44]
				"Minadzuki Режущий лед Перозубый быстролап Hit -4 (Frost)", -- [45]
				"Minadzuki Власть крови Minadzuki Tick +12", -- [46]
				"Minadzuki Режущий лед Перозубый быстролап Hit -4 (Frost)", -- [47]
				"Minadzuki Удар чумы Перозубый быстролап Hit -308 (Physical)", -- [48]
				"Minadzuki Нечестивая порча (УЗВ) Перозубый быстролап Tick -10 (Shadow)", -- [49]
				"Minadzuki Некроз Перозубый быстролап Hit -70 (Shadow)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["Name"] = "Minadzuki",
			["GUID"] = "0x0700000000914901",
			["unit"] = "Minadzuki",
			["LastEventTimes"] = {
				397914.361, -- [1]
				397914.439, -- [2]
				397915.003, -- [3]
				397915.003, -- [4]
				397915.465, -- [5]
				397915.779, -- [6]
				397915.841, -- [7]
				397915.843, -- [8]
				397915.844, -- [9]
				397916.035, -- [10]
				397916.37, -- [11]
				397922.084, -- [12]
				397922.084, -- [13]
				397922.986, -- [14]
				397922.994, -- [15]
				397923.044, -- [16]
				397923.046, -- [17]
				397923.047, -- [18]
				397923.231, -- [19]
				397923.605, -- [20]
				397923.606, -- [21]
				397923.607, -- [22]
				397925.138, -- [23]
				397925.237, -- [24]
				397925.238, -- [25]
				397925.239, -- [26]
				397925.416, -- [27]
				397925.689, -- [28]
				397925.828, -- [29]
				397925.829, -- [30]
				397925.999, -- [31]
				397926.639, -- [32]
				397926.869, -- [33]
				397926.871, -- [34]
				397996.024, -- [35]
				397996.152, -- [36]
				397996.254, -- [37]
				398131.432, -- [38]
				398134.433, -- [39]
				398137.399, -- [40]
				398140.415, -- [41]
				398143.468, -- [42]
				397913.097, -- [43]
				397913.278, -- [44]
				397913.28, -- [45]
				397913.281, -- [46]
				397913.282, -- [47]
				397913.282, -- [48]
				397913.397, -- [49]
				397913.48, -- [50]
			},
			["LastAbility"] = 398122.316,
		},
		["Skullchewer <Minadzuki>"] = {
			["GUID"] = "0xF14044718B01A6F3",
			["LastEventHealth"] = {
				"5344 (98%)", -- [1]
				"5344 (98%)", -- [2]
				"5344 (98%)", -- [3]
				"5344 (98%)", -- [4]
				"5344 (98%)", -- [5]
				"5344 (98%)", -- [6]
				"5344 (98%)", -- [7]
				"5333 (98%)", -- [8]
				"5333 (98%)", -- [9]
				"5394 (99%)", -- [10]
				"5383 (99%)", -- [11]
				"5434 (100%)", -- [12]
				"5434 (100%)", -- [13]
				"5434 (100%)", -- [14]
				"5434 (100%)", -- [15]
				"5434 (100%)", -- [16]
				"5434 (100%)", -- [17]
				"5434 (100%)", -- [18]
				"5434 (100%)", -- [19]
				"5434 (100%)", -- [20]
				"5434 (100%)", -- [21]
				"5434 (100%)", -- [22]
				"5434 (100%)", -- [23]
				"5434 (100%)", -- [24]
				"5434 (100%)", -- [25]
				"5434 (100%)", -- [26]
				"5434 (100%)", -- [27]
				"5434 (100%)", -- [28]
				"5434 (100%)", -- [29]
				"5434 (100%)", -- [30]
				"5434 (100%)", -- [31]
				"5434 (100%)", -- [32]
				"5434 (100%)", -- [33]
				"5434 (100%)", -- [34]
				"5434 (100%)", -- [35]
				"5434 (100%)", -- [36]
				"5434 (100%)", -- [37]
				"5434 (100%)", -- [38]
				"5434 (100%)", -- [39]
				"5434 (100%)", -- [40]
				"5434 (100%)", -- [41]
				"5434 (100%)", -- [42]
				"5434 (100%)", -- [43]
				"5257 (96%)", -- [44]
				"5257 (96%)", -- [45]
				"5434 (100%)", -- [46]
				"5434 (100%)", -- [47]
				"5434 (100%)", -- [48]
				"5434 (100%)", -- [49]
				"5434 (100%)", -- [50]
			},
			["LastAttackedBy"] = "Перозубый опустошитель",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					311.1000000000001, -- [1]
				},
				["TimeDamage"] = {
					311.1000000000001, -- [1]
				},
				["DamageTaken"] = {
					7458, -- [1]
				},
				["Damage"] = {
					44076, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Skullchewer",
			["level"] = 1,
			["LastDamageAbility"] = "Призыв бесплотной сферы (УЗВ)",
			["LastFightIn"] = 25,
			["LastEventNum"] = {
				[10] = 0.1840264998159735,
				[50] = 1.656238498343762,
				[11] = 0.2024291497975709,
				[8] = 0.2024291497975709,
			},
			["type"] = "Pet",
			["FightsSaved"] = 5,
			["LastActive"] = 1696717178,
			["UnitLockout"] = 1696715981,
			["Owner"] = "Minadzuki",
			["Fights"] = {
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 62,
						["Physical"] = 61,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 8,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 17,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 18,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
					["DamageTaken"] = 7458,
					["ElementDoneAbsorb"] = {
						["Melee"] = 759,
						["Physical"] = 368,
					},
					["PartialResist"] = {
						["Конус холода"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 18,
									["min"] = 18,
									["count"] = 1,
									["amount"] = 18,
								},
							},
							["count"] = 1,
							["amount"] = 18,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 1,
									["min"] = 1,
									["count"] = 1,
									["amount"] = 1,
								},
							},
							["count"] = 3,
							["amount"] = 1,
						},
						["Горящие шипы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Всплеск боли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 17,
									["min"] = 17,
									["count"] = 1,
									["amount"] = 17,
								},
							},
							["count"] = 6,
							["amount"] = 17,
						},
					},
					["PartialAbsorb"] = {
						["Конус холода"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Горящие шипы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Всплеск боли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 311.1000000000001,
					["ElementTaken"] = {
						["Frost"] = 169,
						["Melee"] = 2490,
						["Fire"] = 508,
						["Shadow"] = 3672,
						["Nature"] = 619,
					},
					["Damage"] = 44076,
					["TimeDamaging"] = {
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0.15,
								},
								["Атака ближнего боя"] = {
									["count"] = 6.16,
								},
								["Цапнуть"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 6.959999999999999,
						},
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Цапнуть"] = {
									["count"] = 1.21,
								},
							},
							["amount"] = 4.71,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0.26,
								},
								["Атака ближнего боя"] = {
									["count"] = 14.72,
								},
								["Цапнуть"] = {
									["count"] = 2.16,
								},
							},
							["amount"] = 17.14,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.300000000000001,
								},
								["Цапнуть"] = {
									["count"] = 1.87,
								},
							},
							["amount"] = 9.169999999999998,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 4.57,
								},
								["Атака ближнего боя"] = {
									["count"] = 42.41,
								},
								["Цапнуть"] = {
									["count"] = 15.13,
								},
							},
							["amount"] = 62.11,
						},
						["Joysct"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 39.87000000000001,
								},
								["Цапнуть"] = {
									["count"] = 8.039999999999999,
								},
							},
							["amount"] = 47.91,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.25,
								},
								["Цапнуть"] = {
									["count"] = 5.010000000000001,
								},
							},
							["amount"] = 24.26,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 32.37000000000001,
								},
								["Цапнуть"] = {
									["count"] = 6.34,
								},
							},
							["amount"] = 38.70999999999999,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.04,
								},
								["Цапнуть"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 7.48,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10.9,
								},
								["Цапнуть"] = {
									["count"] = 3.03,
								},
							},
							["amount"] = 13.93,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 55.82999999999999,
								},
								["Цапнуть"] = {
									["count"] = 9.180000000000002,
								},
							},
							["amount"] = 65.00999999999998,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.100000000000001,
								},
								["Цапнуть"] = {
									["count"] = 1.11,
								},
							},
							["amount"] = 10.21,
						},
					},
					["Attacks"] = {
						["Отгрызть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
								["Hit"] = {
									["max"] = 23,
									["min"] = 16,
									["count"] = 5,
									["amount"] = 95,
								},
							},
							["count"] = 6,
							["amount"] = 137,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 108,
									["min"] = 101,
									["count"] = 2,
									["amount"] = 209,
								},
								["Hit"] = {
									["max"] = 199,
									["min"] = 65,
									["count"] = 113,
									["amount"] = 16345,
								},
								["Miss"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 398,
									["min"] = 232,
									["count"] = 25,
									["amount"] = 7270,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 148,
							["amount"] = 23824,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 169,
									["min"] = 145,
									["count"] = 2,
									["amount"] = 314,
								},
								["Hit"] = {
									["max"] = 299,
									["min"] = 179,
									["count"] = 62,
									["amount"] = 13629,
								},
								["Crit"] = {
									["max"] = 600,
									["min"] = 358,
									["count"] = 14,
									["amount"] = 6172,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 20115,
						},
					},
					["ElementDone"] = {
						["Melee"] = 23824,
						["Physical"] = 20252,
					},
					["DamagedWho"] = {
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 16,
								},
								["Атака ближнего боя"] = {
									["count"] = 373,
								},
								["Цапнуть"] = {
									["count"] = 378,
								},
							},
							["amount"] = 767,
						},
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 132,
								},
								["Цапнуть"] = {
									["count"] = 422,
								},
							},
							["amount"] = 554,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 16,
								},
								["Атака ближнего боя"] = {
									["count"] = 1351,
								},
								["Цапнуть"] = {
									["count"] = 793,
								},
							},
							["amount"] = 2160,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 572,
								},
								["Цапнуть"] = {
									["count"] = 824,
								},
							},
							["amount"] = 1396,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 105,
								},
								["Атака ближнего боя"] = {
									["count"] = 5730,
								},
								["Цапнуть"] = {
									["count"] = 4940,
								},
							},
							["amount"] = 10775,
						},
						["Joysct"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 65,
								},
							},
							["amount"] = 65,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3833,
								},
								["Цапнуть"] = {
									["count"] = 2988,
								},
							},
							["amount"] = 6821,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1200,
								},
								["Цапнуть"] = {
									["count"] = 1449,
								},
							},
							["amount"] = 2649,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2556,
								},
								["Цапнуть"] = {
									["count"] = 2466,
								},
							},
							["amount"] = 5022,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 823,
								},
								["Цапнуть"] = {
									["count"] = 202,
								},
							},
							["amount"] = 1025,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1132,
								},
								["Цапнуть"] = {
									["count"] = 1072,
								},
							},
							["amount"] = 2204,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5267,
								},
								["Цапнуть"] = {
									["count"] = 4152,
								},
							},
							["amount"] = 9419,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 790,
								},
								["Цапнуть"] = {
									["count"] = 429,
								},
							},
							["amount"] = 1219,
						},
					},
					["TimeDamage"] = 311.1000000000001,
					["WhoDamaged"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 362,
								},
							},
							["amount"] = 362,
						},
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1646,
								},
								["Всплеск боли"] = {
									["count"] = 336,
								},
							},
							["amount"] = 1982,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Горящие шипы"] = {
									["count"] = 178,
								},
							},
							["amount"] = 178,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Порча (УЗВ)"] = {
									["count"] = 1045,
								},
								["Неистовство Тьмы"] = {
									["count"] = 2291,
								},
								["Огненный щит"] = {
									["count"] = 330,
								},
							},
							["amount"] = 3666,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Призыв бесплотной сферы (УЗВ)"] = {
									["count"] = 32,
								},
							},
							["amount"] = 32,
						},
						["Tausala"] = {
							["Details"] = {
								["Конус холода"] = {
									["count"] = 169,
								},
							},
							["amount"] = 169,
						},
						["Silkcut"] = {
							["Details"] = {
								["Цепная молния"] = {
									["count"] = 587,
								},
							},
							["amount"] = 587,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 215,
								},
							},
							["amount"] = 215,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 267,
								},
							},
							["amount"] = 267,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 115,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 25,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 148,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 69,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 15,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 86,
						},
					},
					["TimeSpent"] = {
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0.15,
								},
								["Атака ближнего боя"] = {
									["count"] = 6.16,
								},
								["Цапнуть"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 6.959999999999999,
						},
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Цапнуть"] = {
									["count"] = 1.21,
								},
							},
							["amount"] = 4.71,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0.26,
								},
								["Атака ближнего боя"] = {
									["count"] = 14.72,
								},
								["Цапнуть"] = {
									["count"] = 2.16,
								},
							},
							["amount"] = 17.14,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.300000000000001,
								},
								["Цапнуть"] = {
									["count"] = 1.87,
								},
							},
							["amount"] = 9.169999999999998,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 4.57,
								},
								["Атака ближнего боя"] = {
									["count"] = 42.41,
								},
								["Цапнуть"] = {
									["count"] = 15.13,
								},
							},
							["amount"] = 62.11,
						},
						["Joysct"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 39.87000000000001,
								},
								["Цапнуть"] = {
									["count"] = 8.039999999999999,
								},
							},
							["amount"] = 47.91,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.25,
								},
								["Цапнуть"] = {
									["count"] = 5.010000000000001,
								},
							},
							["amount"] = 24.26,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 32.37000000000001,
								},
								["Цапнуть"] = {
									["count"] = 6.34,
								},
							},
							["amount"] = 38.70999999999999,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.04,
								},
								["Цапнуть"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 7.48,
						},
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10.9,
								},
								["Цапнуть"] = {
									["count"] = 3.03,
								},
							},
							["amount"] = 13.93,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 55.82999999999999,
								},
								["Цапнуть"] = {
									["count"] = 9.180000000000002,
								},
							},
							["amount"] = 65.00999999999998,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.100000000000001,
								},
								["Цапнуть"] = {
									["count"] = 1.11,
								},
							},
							["amount"] = 10.21,
						},
					},
					["ElementTakenResist"] = {
						["Frost"] = 18,
						["Shadow"] = 17,
						["Nature"] = 1,
					},
				},
				["Fight2"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["HOTs"] = {
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 1105,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Melee"] = 509,
						["Physical"] = 596,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
						["Melee"] = 31,
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 8.619999999999999,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
					},
					["PartialResist"] = {
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.279999999999999,
								},
								["Цапнуть"] = {
									["count"] = 1.34,
								},
							},
							["amount"] = 8.619999999999999,
						},
					},
					["Heals"] = {
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
					},
					["Healing"] = 0,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 108,
									["min"] = 108,
									["count"] = 1,
									["amount"] = 108,
								},
								["Hit"] = {
									["max"] = 141,
									["min"] = 127,
									["count"] = 3,
									["amount"] = 401,
								},
							},
							["count"] = 4,
							["amount"] = 509,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 210,
									["min"] = 192,
									["count"] = 3,
									["amount"] = 596,
								},
							},
							["count"] = 3,
							["amount"] = 596,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 509,
								},
								["Цапнуть"] = {
									["count"] = 596,
								},
							},
							["amount"] = 1105,
						},
					},
					["TimeDamage"] = 8.619999999999999,
					["TimeDamaging"] = {
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.279999999999999,
								},
								["Цапнуть"] = {
									["count"] = 1.34,
								},
							},
							["amount"] = 8.619999999999999,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Frost"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["ElementDoneAbsorb"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["PartialResist"] = {
						["Конус холода"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Конус холода"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Окоченение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
					["ElementTaken"] = {
						["Shadow"] = 0,
						["Melee"] = 0,
						["Fire"] = 0,
						["Frost"] = 0,
						["Nature"] = 0,
					},
					["Damage"] = 0,
					["TimeDamaging"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Joysct"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Отгрызть"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Absorb"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["DamagedWho"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Joysct"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["WhoDamaged"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Призыв бесплотной сферы (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Конус холода"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Огненный щит"] = {
									["count"] = 0,
								},
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Joysct"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Tausala"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Неофит из клана Изувеченной Длани"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Калири-пикировщик"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTakenResist"] = {
						["Frost"] = 0,
						["Nature"] = 0,
					},
				},
				["Fight3"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["HOTs"] = {
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Fire"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1308,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Горящие шипы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Melee"] = 695,
						["Physical"] = 613,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Безумный зловепрь"] = {
							["Details"] = {
								["Горящие шипы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 8.649999999999999,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
					},
					["PartialResist"] = {
						["Горящие шипы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.33,
								},
								["Цапнуть"] = {
									["count"] = 1.32,
								},
							},
							["amount"] = 8.649999999999999,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
					},
					["Healing"] = 0,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Отгрызть"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 284,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 284,
								},
								["Hit"] = {
									["max"] = 146,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 411,
								},
							},
							["count"] = 4,
							["amount"] = 695,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 207,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 613,
								},
							},
							["count"] = 3,
							["amount"] = 613,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 695,
								},
								["Цапнуть"] = {
									["count"] = 613,
								},
							},
							["amount"] = 1308,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 8.649999999999999,
					["TimeDamaging"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Безумный зловепрь"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.33,
								},
								["Цапнуть"] = {
									["count"] = 1.32,
								},
							},
							["amount"] = 8.649999999999999,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight4"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["HOTs"] = {
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Fire"] = 0,
						["Shadow"] = 0,
						["Melee"] = 0,
						["Nature"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 952,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Melee"] = 554,
						["Physical"] = 398,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Silkcut"] = {
							["Details"] = {
								["Цепная молния"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Огненный щит"] = {
									["count"] = 0,
								},
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
						["Physical"] = 0,
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 8.549999999999999,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Огненный щит"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цепная молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.88,
								},
								["Цапнуть"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 8.549999999999999,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
					},
					["Healing"] = 0,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Отгрызть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 149,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 554,
								},
							},
							["count"] = 4,
							["amount"] = 554,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 398,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 398,
								},
								["Hit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 398,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 554,
								},
								["Цапнуть"] = {
									["count"] = 398,
								},
							},
							["amount"] = 952,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 8.549999999999999,
					["TimeDamaging"] = {
						["Коготарь Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Silkcut"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.88,
								},
								["Цапнуть"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 8.549999999999999,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["HOTs"] = {
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Melee"] = 0,
						["Shadow"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1385,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Всплеск боли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Melee"] = 701,
						["Physical"] = 684,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Всплеск боли"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 6.8,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Всплеск боли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
						["Shadow"] = 0,
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5.62,
								},
								["Цапнуть"] = {
									["count"] = 1.18,
								},
							},
							["amount"] = 6.8,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
					},
					["Healing"] = 0,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 143,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 143,
								},
								["Crit"] = {
									["max"] = 292,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 558,
								},
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 701,
						},
						["Отгрызть"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 458,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 458,
								},
								["Hit"] = {
									["max"] = 226,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 226,
								},
							},
							["count"] = 2,
							["amount"] = 684,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 701,
								},
								["Цапнуть"] = {
									["count"] = 684,
								},
							},
							["amount"] = 1385,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 6.8,
					["TimeDamaging"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5.62,
								},
								["Цапнуть"] = {
									["count"] = 1.18,
								},
							},
							["amount"] = 6.8,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight5"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["HOTs"] = {
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Melee"] = 0,
						["Nature"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1089,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Melee"] = 660,
						["Physical"] = 429,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Призыв бесплотной сферы (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 8.550000000000001,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Призыв бесплотной сферы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.44,
								},
								["Цапнуть"] = {
									["count"] = 1.11,
								},
							},
							["amount"] = 8.550000000000001,
						},
					},
					["Heals"] = {
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
					},
					["Healing"] = 0,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 260,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 260,
								},
								["Hit"] = {
									["max"] = 141,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 400,
								},
							},
							["count"] = 4,
							["amount"] = 660,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 216,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 429,
								},
							},
							["count"] = 2,
							["amount"] = 429,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 660,
								},
								["Цапнуть"] = {
									["count"] = 429,
								},
							},
							["amount"] = 1089,
						},
					},
					["TimeDamage"] = 8.550000000000001,
					["TimeDamaging"] = {
						["Молодой самец калири"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый опустошитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.44,
								},
								["Цапнуть"] = {
									["count"] = 1.11,
								},
							},
							["amount"] = 8.550000000000001,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["HOTs"] = {
					},
					["ManaGain"] = 0,
					["ElementTaken"] = {
						["Melee"] = 0,
						["Shadow"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1385,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Всплеск боли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["FAttacks"] = {
					},
					["PartialBlock"] = {
					},
					["ElementDone"] = {
						["Melee"] = 701,
						["Physical"] = 684,
					},
					["CCBroken"] = {
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Dispelled"] = 0,
					["WhoDamaged"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Всплеск боли"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Неистовство Тьмы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["FDamagedWho"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["RageGained"] = {
					},
					["ActiveTime"] = 6.8,
					["CCBreak"] = 0,
					["EnergyGain"] = 0,
					["WhoHealed"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Всплеск боли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Неистовство Тьмы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["ElementTakenResist"] = {
						["Shadow"] = 0,
					},
					["InterruptData"] = {
					},
					["WhoDispelled"] = {
					},
					["TimeSpent"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5.62,
								},
								["Цапнуть"] = {
									["count"] = 1.18,
								},
							},
							["amount"] = 6.8,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Heals"] = {
					},
					["FDamage"] = 0,
					["EnergyGained"] = {
					},
					["HealedWho"] = {
					},
					["Healing"] = 0,
					["RunicPowerGained"] = {
					},
					["ManaGainedFrom"] = {
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 143,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 143,
								},
								["Crit"] = {
									["max"] = 292,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 558,
								},
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 701,
						},
						["Отгрызть"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 458,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 458,
								},
								["Hit"] = {
									["max"] = 226,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 226,
								},
							},
							["count"] = 2,
							["amount"] = 684,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 701,
								},
								["Цапнуть"] = {
									["count"] = 684,
								},
							},
							["amount"] = 1385,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 6.8,
					["TimeDamaging"] = {
						["Dirora"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Ветроступ Хаал'еши"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Перозубый быстролап"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5.62,
								},
								["Цапнуть"] = {
									["count"] = 1.18,
								},
							},
							["amount"] = 6.8,
						},
						["Apocryptha"] = {
							["Details"] = {
								["Отгрызть"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 0,
					["ElementTakenBlock"] = {
					},
					["DispelledWho"] = {
					},
				},
			},
			["NextEventNum"] = 44,
			["LastEventHealthNum"] = {
				98.34376150165623, -- [1]
				98.34376150165623, -- [2]
				98.34376150165623, -- [3]
				98.34376150165623, -- [4]
				98.34376150165623, -- [5]
				98.34376150165623, -- [6]
				98.34376150165623, -- [7]
				98.14133235185867, -- [8]
				98.14133235185867, -- [9]
				99.2638940007361, -- [10]
				99.06146485093854, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				96.74273095325727, -- [44]
				96.74273095325727, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -144 (Physical)", -- [1]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Crit -278 (Physical)", -- [2]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -169 (Physical)", -- [3]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -130 (Physical)", -- [4]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -131 (Physical)", -- [5]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -209 (Physical)", -- [6]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -152 (Physical)", -- [7]
				"Перозубый опустошитель Призыв бесплотной сферы (УЗВ) Skullchewer <Minadzuki> Tick -11 (Nature)", -- [8]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый опустошитель Hit -130 (Physical)", -- [9]
				"Перозубый опустошитель Призыв бесплотной сферы (УЗВ) Skullchewer <Minadzuki> Tick -10 (1 сопрот.) (Nature)", -- [10]
				"Перозубый опустошитель Призыв бесплотной сферы (УЗВ) Skullchewer <Minadzuki> Tick -11 (Nature)", -- [11]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый опустошитель Hit -128 (Physical)", -- [12]
				"Skullchewer <Minadzuki> Цапнуть Перозубый опустошитель Hit -213 (Physical)", -- [13]
				"Skullchewer <Minadzuki> Цапнуть Перозубый опустошитель Hit -216 (Physical)", -- [14]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый опустошитель Crit -260 (Physical)", -- [15]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый опустошитель Hit -141 (Physical)", -- [16]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый опустошитель Hit -131 (Physical)", -- [17]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -140 (Physical)", -- [18]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Crit -398 (Physical)", -- [19]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -149 (Physical)", -- [20]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -130 (Physical)", -- [21]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Dodge (Physical)", -- [22]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -135 (Physical)", -- [23]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -146 (Physical)", -- [24]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -207 (Physical)", -- [25]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -203 (Physical)", -- [26]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Crit -284 (Physical)", -- [27]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -129 (Physical)", -- [28]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -136 (Physical)", -- [29]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -203 (Physical)", -- [30]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -127 (Physical)", -- [31]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -194 (Physical)", -- [32]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -210 (Physical)", -- [33]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -108 (Physical)", -- [34]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -141 (Physical)", -- [35]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -133 (Physical)", -- [36]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -192 (Physical)", -- [37]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Crit -266 (Physical)", -- [38]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Crit -458 (Physical)", -- [39]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -226 (Physical)", -- [40]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -143 (Physical)", -- [41]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Crit -292 (Physical)", -- [42]
				"Skullchewer <Minadzuki> Атака ближнего боя Joysct Hit -65 (Physical)", -- [43]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -141 (Physical)", -- [44]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -159 (Physical)", -- [45]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -151 (Physical)", -- [46]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -195 (Physical)", -- [47]
				"Skullchewer <Minadzuki> Атака ближнего боя Перозубый быстролап Hit -146 (Physical)", -- [48]
				"Skullchewer <Minadzuki> Цапнуть Перозубый быстролап Hit -218 (Physical)", -- [49]
				"Перозубый быстролап Атака ближнего боя Skullchewer <Minadzuki> Hit -90 (Physical)", -- [50]
			},
			["Name"] = "Skullchewer",
			["LastDamageTaken"] = 11,
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["TimeLast"] = {
				["ActiveTime"] = 1696717178,
				["TimeDamage"] = 1696717178,
				["OVERALL"] = 1696717178,
				["DamageTaken"] = 1696717045,
				["Damage"] = 1696717178,
			},
			["LastEventTimes"] = {
				397851.232, -- [1]
				397852.945, -- [2]
				397853.001, -- [3]
				397854.627, -- [4]
				397856.343, -- [5]
				397856.989, -- [6]
				397858.004, -- [7]
				397859.499, -- [8]
				397859.664, -- [9]
				397861.508, -- [10]
				397863.473, -- [11]
				397875.067, -- [12]
				397875.265, -- [13]
				397876.175, -- [14]
				397876.731, -- [15]
				397878.44, -- [16]
				397880.106, -- [17]
				397884.184, -- [18]
				397884.342, -- [19]
				397885.882, -- [20]
				397887.557, -- [21]
				397888.064, -- [22]
				397889.229, -- [23]
				397897.292, -- [24]
				397897.449, -- [25]
				397898.486, -- [26]
				397898.965, -- [27]
				397900.652, -- [28]
				397902.312, -- [29]
				397902.431, -- [30]
				397910.457, -- [31]
				397910.587, -- [32]
				397911.737, -- [33]
				397912.154, -- [34]
				397913.84, -- [35]
				397915.507, -- [36]
				397915.569, -- [37]
				397922.883, -- [38]
				397923.12, -- [39]
				397924.063, -- [40]
				397924.515, -- [41]
				397926.186, -- [42]
				397996.054, -- [43]
				397830.92, -- [44]
				397832.593, -- [45]
				397847.823, -- [46]
				397847.959, -- [47]
				397849.546, -- [48]
				397849.662, -- [49]
				397850.981, -- [50]
			},
			["LastAbility"] = 398122.316,
		},
		["Мал'Ганис"] = {
			["GUID"] = "0xF1300067A50001FC",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
			},
			["TimeWindows"] = {
				["Damage"] = {
					663, -- [1]
				},
				["TimeDamage"] = {
					6.46, -- [1]
				},
				["DOT_Time"] = {
					6, -- [1]
				},
				["ActiveTime"] = {
					6.46, -- [1]
				},
			},
			["enClass"] = "MOB",
			["level"] = -1,
			["LastFightIn"] = 25,
			["type"] = "Boss",
			["TimeLast"] = {
				["ActiveTime"] = 1696717369,
				["TimeDamage"] = 1696717369,
				["OVERALL"] = 1696717369,
				["DOT_Time"] = 1696717369,
				["Damage"] = 1696717369,
			},
			["Owner"] = false,
			["LastAbility"] = 398186.844,
			["NextEventNum"] = 3,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
			},
			["LastEvents"] = {
				"Мал'Ганис Темная стая (УЗВ) Mauagouro Tick -373 (41 сопрот.) (Shadow)", -- [1]
				"Мал'Ганис Темная стая (УЗВ) Mauagouro Tick -290 (124 сопрот.) (Shadow)", -- [2]
			},
			["Name"] = "Мал'Ганис",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
			},
			["LastEventTimes"] = {
				398183.881, -- [1]
				398186.844, -- [2]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
						["Темная стая (УЗВ)"] = {
							["Details"] = {
								["Mauagouro"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 165,
					},
					["TimeSpent"] = {
						["Mauagouro"] = {
							["Details"] = {
								["Темная стая (УЗВ)"] = {
									["count"] = 6.46,
								},
							},
							["amount"] = 6.46,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Attacks"] = {
						["Темная стая (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 373,
									["min"] = 290,
									["count"] = 2,
									["amount"] = 663,
								},
							},
							["count"] = 2,
							["amount"] = 663,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 663,
					},
					["DamagedWho"] = {
						["Mauagouro"] = {
							["Details"] = {
								["Темная стая (УЗВ)"] = {
									["count"] = 663,
								},
							},
							["amount"] = 663,
						},
					},
					["ActiveTime"] = 6.46,
					["TimeDamaging"] = {
						["Mauagouro"] = {
							["Details"] = {
								["Темная стая (УЗВ)"] = {
									["count"] = 6.46,
								},
							},
							["amount"] = 6.46,
						},
					},
					["TimeDamage"] = 6.46,
					["DOT_Time"] = 6,
					["Damage"] = 663,
				},
				["OverallData"] = {
					["DOTs"] = {
						["Темная стая (УЗВ)"] = {
							["Details"] = {
								["Mauagouro"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 165,
					},
					["TimeSpent"] = {
						["Mauagouro"] = {
							["Details"] = {
								["Темная стая (УЗВ)"] = {
									["count"] = 6.46,
								},
							},
							["amount"] = 6.46,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Attacks"] = {
						["Темная стая (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 373,
									["min"] = 290,
									["count"] = 2,
									["amount"] = 663,
								},
							},
							["count"] = 2,
							["amount"] = 663,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 663,
					},
					["DamagedWho"] = {
						["Mauagouro"] = {
							["Details"] = {
								["Темная стая (УЗВ)"] = {
									["count"] = 663,
								},
							},
							["amount"] = 663,
						},
					},
					["ActiveTime"] = 6.46,
					["TimeDamaging"] = {
						["Mauagouro"] = {
							["Details"] = {
								["Темная стая (УЗВ)"] = {
									["count"] = 6.46,
								},
							},
							["amount"] = 6.46,
						},
					},
					["TimeDamage"] = 6.46,
					["DOT_Time"] = 6,
					["Damage"] = 663,
				},
			},
			["UnitLockout"] = 1696717369,
			["LastActive"] = 1696717369,
		},
	},
	["FightNum"] = 25,
	["CombatTimes"] = {
		{
			1696715929, -- [1]
			1696715937, -- [2]
			"03:58:49", -- [3]
			"03:58:57", -- [4]
			"Чернокнижник клана Изувеченной Длани", -- [5]
		}, -- [1]
		{
			1696715981, -- [1]
			1696716026, -- [2]
			"03:59:41", -- [3]
			"04:00:26", -- [4]
			"Apocryptha", -- [5]
		}, -- [2]
		{
			1696716149, -- [1]
			1696716164, -- [2]
			"04:02:30", -- [3]
			"04:02:44", -- [4]
			"Apocryptha", -- [5]
		}, -- [3]
		{
			1696716279, -- [1]
			1696716323, -- [2]
			"04:04:39", -- [3]
			"04:05:23", -- [4]
			"Apocryptha", -- [5]
		}, -- [4]
		{
			1696716350, -- [1]
			1696716359, -- [2]
			"04:05:51", -- [3]
			"04:05:59", -- [4]
			"Безумный зловепрь", -- [5]
		}, -- [5]
		{
			1696716364, -- [1]
			1696716374, -- [2]
			"04:06:05", -- [3]
			"04:06:14", -- [4]
			"Безумный зловепрь", -- [5]
		}, -- [6]
		{
			1696716411, -- [1]
			1696716436, -- [2]
			"04:06:51", -- [3]
			"04:07:16", -- [4]
			"Dirora", -- [5]
		}, -- [7]
		{
			1696716479, -- [1]
			1696716489, -- [2]
			"04:07:59", -- [3]
			"04:08:09", -- [4]
			"Неофит из клана Изувеченной Длани", -- [5]
		}, -- [8]
		{
			1696716496, -- [1]
			1696716511, -- [2]
			"04:08:17", -- [3]
			"04:08:31", -- [4]
			"Капитан клана Изувеченной Длани", -- [5]
		}, -- [9]
		{
			1696716769, -- [1]
			1696716788, -- [2]
			"04:12:49", -- [3]
			"04:13:08", -- [4]
			"Коготарь Хаал'еши", -- [5]
		}, -- [10]
		{
			1696716795, -- [1]
			1696716803, -- [2]
			"04:13:16", -- [3]
			"04:13:23", -- [4]
			"Ветроступ Хаал'еши", -- [5]
		}, -- [11]
		{
			1696716807, -- [1]
			1696716825, -- [2]
			"04:13:27", -- [3]
			"04:13:45", -- [4]
			"Ветроступ Хаал'еши", -- [5]
		}, -- [12]
		{
			1696716825, -- [1]
			1696716837, -- [2]
			"04:13:46", -- [3]
			"04:13:57", -- [4]
			"Ветроступ Хаал'еши", -- [5]
		}, -- [13]
		{
			1696716840, -- [1]
			1696716855, -- [2]
			"04:14:00", -- [3]
			"04:14:15", -- [4]
			"Ветроступ Хаал'еши", -- [5]
		}, -- [14]
		{
			1696716867, -- [1]
			1696716878, -- [2]
			"04:14:27", -- [3]
			"04:14:38", -- [4]
			"Молодой самец калири", -- [5]
		}, -- [15]
		{
			1696716907, -- [1]
			1696716918, -- [2]
			"04:15:07", -- [3]
			"04:15:18", -- [4]
			"Коготарь Хаал'еши", -- [5]
		}, -- [16]
		{
			1696716926, -- [1]
			1696716944, -- [2]
			"04:15:26", -- [3]
			"04:15:44", -- [4]
			"Коготарь Хаал'еши", -- [5]
		}, -- [17]
		{
			1696716958, -- [1]
			1696716979, -- [2]
			"04:15:58", -- [3]
			"04:16:19", -- [4]
			"Калири-пикировщик", -- [5]
		}, -- [18]
		{
			1696716992, -- [1]
			1696717017, -- [2]
			"04:16:33", -- [3]
			"04:16:57", -- [4]
			"Перозубый быстролап", -- [5]
		}, -- [19]
		{
			1696717029, -- [1]
			1696717044, -- [2]
			"04:17:09", -- [3]
			"04:17:24", -- [4]
			"Перозубый быстролап", -- [5]
		}, -- [20]
		{
			1696717056, -- [1]
			1696717064, -- [2]
			"04:17:36", -- [3]
			"04:17:44", -- [4]
			"Перозубый опустошитель", -- [5]
		}, -- [21]
		{
			1696717066, -- [1]
			1696717074, -- [2]
			"04:17:46", -- [3]
			"04:17:54", -- [4]
			"Перозубый быстролап", -- [5]
		}, -- [22]
		{
			1696717079, -- [1]
			1696717087, -- [2]
			"04:18:00", -- [3]
			"04:18:07", -- [4]
			"Перозубый быстролап", -- [5]
		}, -- [23]
		{
			1696717091, -- [1]
			1696717100, -- [2]
			"04:18:12", -- [3]
			"04:18:20", -- [4]
			"Перозубый быстролап", -- [5]
		}, -- [24]
		{
			1696717104, -- [1]
			1696717110, -- [2]
			"04:18:25", -- [3]
			"04:18:30", -- [4]
			"Перозубый быстролап", -- [5]
		}, -- [25]
	},
	["FoughtWho"] = {
		"Перозубый быстролап 04:18:25-04:18:30", -- [1]
		"Перозубый быстролап 04:18:12-04:18:20", -- [2]
		"Перозубый быстролап 04:18:00-04:18:07", -- [3]
		"Перозубый быстролап 04:17:46-04:17:54", -- [4]
		"Перозубый опустошитель 04:17:36-04:17:44", -- [5]
	},
}
