
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["Трофейный разрушитель <Shamamama>"] = {
			["GUID"] = "0xF150008155000014",
			["LastEventHealth"] = {
				"145187 (27%)", -- [1]
				"145187 (27%)", -- [2]
				"145187 (27%)", -- [3]
				"141244 (26%)", -- [4]
				"141244 (26%)", -- [5]
				"141244 (26%)", -- [6]
				"632911 (50%)", -- [7]
				"630349 (50%)", -- [8]
				"630349 (50%)", -- [9]
				"137974 (26%)", -- [10]
				"137974 (26%)", -- [11]
				"135209 (25%)", -- [12]
				"293151 (55%)", -- [13]
				"225673 (42%)", -- [14]
				"225673 (42%)", -- [15]
				"225673 (42%)", -- [16]
				"222927 (42%)", -- [17]
				"222927 (42%)", -- [18]
				"222927 (42%)", -- [19]
				"222927 (42%)", -- [20]
				"218795 (41%)", -- [21]
				"218795 (41%)", -- [22]
				"218795 (41%)", -- [23]
				"218795 (41%)", -- [24]
				"214722 (40%)", -- [25]
				"214722 (40%)", -- [26]
				"214722 (40%)", -- [27]
				"214722 (40%)", -- [28]
				"214722 (40%)", -- [29]
				"210222 (39%)", -- [30]
				"206279 (38%)", -- [31]
				"206279 (38%)", -- [32]
				"201779 (38%)", -- [33]
				"201779 (38%)", -- [34]
				"201779 (38%)", -- [35]
				"197279 (37%)", -- [36]
				"197279 (37%)", -- [37]
				"197279 (37%)", -- [38]
				"188641 (35%)", -- [39]
				"175572 (33%)", -- [40]
				"171072 (32%)", -- [41]
				"171072 (32%)", -- [42]
				"171072 (32%)", -- [43]
				"162766 (30%)", -- [44]
				"162766 (30%)", -- [45]
				"158266 (29%)", -- [46]
				"158266 (29%)", -- [47]
				"158266 (29%)", -- [48]
				"149687 (28%)", -- [49]
				"149687 (28%)", -- [50]
			},
			["LastAttackedBy"] = "Огненный Левиафан",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					369.4599999999997, -- [1]
				},
				["DOT_Time"] = {
					255, -- [1]
				},
				["TimeDamage"] = {
					369.4599999999997, -- [1]
				},
				["DamageTaken"] = {
					575207, -- [1]
				},
				["Damage"] = {
					38257126, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Трофейный разрушитель",
			["level"] = 1,
			["LastDamageAbility"] = "Заградительные стрелы",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				nil, -- [1]
				0.4877182307600733, -- [2]
				nil, -- [3]
				nil, -- [4]
				nil, -- [5]
				0.4841278989567251, -- [6]
				nil, -- [7]
				0.2033333333333333, -- [8]
				nil, -- [9]
				nil, -- [10]
				nil, -- [11]
				0.4676879585940261, -- [12]
				nil, -- [13]
				nil, -- [14]
				nil, -- [15]
				0.4837499692932148, -- [16]
				nil, -- [17]
				nil, -- [18]
				nil, -- [19]
				0.4667431344352502, -- [20]
				nil, -- [21]
				nil, -- [22]
				nil, -- [23]
				0.4695776069115777, -- [24]
				nil, -- [25]
				nil, -- [26]
				nil, -- [27]
				nil, -- [28]
				0.5668944952654862, -- [29]
				0.5081264325896308, -- [30]
				nil, -- [31]
				0.5668944952654862, -- [32]
				nil, -- [33]
				nil, -- [34]
				0.5668944952654862, -- [35]
				nil, -- [36]
				0.5147402017010614, -- [37]
				0.5668944952654862, -- [38]
				nil, -- [39]
				0.5668944952654862, -- [40]
				nil, -- [41]
				0.4676879585940261, -- [42]
				0.5668944952654862, -- [43]
				nil, -- [44]
				0.5668944952654862, -- [45]
				nil, -- [46]
				0.4941430350397488, -- [47]
				0.5668944952654862, -- [48]
				nil, -- [49]
				0.5668944952654862, -- [50]
			},
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastDamageTaken"] = 2475,
			["TimeLast"] = {
				["DOT_Time"] = 1682204515,
				["ActiveTime"] = 1682204515,
				["TimeDamage"] = 1682204515,
				["OVERALL"] = 1682204516,
				["DamageTaken"] = 1682204516,
				["Damage"] = 1682204515,
			},
			["Owner"] = "Shamamama",
			["LastAbility"] = 198900.973,
			["NextEventNum"] = 13,
			["LastEventHealthNum"] = {
				27.43523702803671, -- [1]
				27.43523702803671, -- [2]
				27.43523702803671, -- [3]
				26.69014869642611, -- [4]
				26.69014869642611, -- [5]
				26.69014869642611, -- [6]
				50.23103174603175, -- [7]
				50.02769841269841, -- [8]
				50.02769841269841, -- [9]
				26.07223369658673, -- [10]
				26.07223369658673, -- [11]
				25.54974593678371, -- [12]
				55.39522939385751, -- [13]
				42.64426047668268, -- [14]
				42.64426047668268, -- [15]
				42.64426047668268, -- [16]
				42.12536304868301, -- [17]
				42.12536304868301, -- [18]
				42.12536304868301, -- [19]
				42.12536304868301, -- [20]
				41.34456036387068, -- [21]
				41.34456036387068, -- [22]
				41.34456036387068, -- [23]
				41.34456036387068, -- [24]
				40.5749066041319, -- [25]
				40.5749066041319, -- [26]
				40.5749066041319, -- [27]
				40.5749066041319, -- [28]
				40.5749066041319, -- [29]
				39.72456486123367, -- [30]
				38.97947652962307, -- [31]
				38.97947652962307, -- [32]
				38.12913478672484, -- [33]
				38.12913478672484, -- [34]
				38.12913478672484, -- [35]
				37.27879304382661, -- [36]
				37.27879304382661, -- [37]
				37.27879304382661, -- [38]
				35.64651482712552, -- [39]
				33.17693344091731, -- [40]
				32.32659169801908, -- [41]
				32.32659169801908, -- [42]
				32.32659169801908, -- [43]
				30.75704980546071, -- [44]
				30.75704980546071, -- [45]
				29.90670806256248, -- [46]
				29.90670806256248, -- [47]
				29.90670806256248, -- [48]
				28.28557877093494, -- [49]
				28.28557877093494, -- [50]
			},
			["LastEvents"] = {
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -116944", -- [1]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2581 (Physical)", -- [2]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [3]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [4]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -110630 (12292 сопрот.)", -- [5]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2562 (Physical)", -- [6]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [7]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2562 (Physical)", -- [8]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [9]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -114204", -- [10]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [11]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2475 (Physical)", -- [12]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [13]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [14]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -124692", -- [15]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2560 (Physical)", -- [16]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [17]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [18]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -98021 (10891 сопрот.)", -- [19]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2470 (Physical)", -- [20]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [21]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -101108 (11234 сопрот.)", -- [22]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [23]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2485 (Physical)", -- [24]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -119004", -- [25]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [26]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [27]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -94864 (23716 сопрот.)", -- [28]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [29]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2689 (Physical)", -- [30]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [31]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [32]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [33]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -86962 (21740 сопрот.)", -- [34]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [35]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [36]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2724 (Physical)", -- [37]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [38]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [39]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [40]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [41]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2475 (Physical)", -- [42]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [43]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [44]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [45]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [46]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2615 (Physical)", -- [47]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [48]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [49]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [50]
			},
			["Name"] = "Трофейный разрушитель",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				198896.492, -- [1]
				198896.555, -- [2]
				198896.892, -- [3]
				198897.897, -- [4]
				198897.978, -- [5]
				198897.979, -- [6]
				198898.936, -- [7]
				198899.68, -- [8]
				198899.973, -- [9]
				198900.618, -- [10]
				198900.973, -- [11]
				198901.626, -- [12]
				198878.585, -- [13]
				198879.566, -- [14]
				198879.725, -- [15]
				198879.896, -- [16]
				198880.609, -- [17]
				198881.647, -- [18]
				198881.705, -- [19]
				198882.027, -- [20]
				198882.657, -- [21]
				198883.252, -- [22]
				198883.739, -- [23]
				198884.026, -- [24]
				198884.414, -- [25]
				198884.781, -- [26]
				198885.787, -- [27]
				198886.236, -- [28]
				198886.442, -- [29]
				198886.474, -- [30]
				198886.805, -- [31]
				198887.41, -- [32]
				198887.817, -- [33]
				198888.133, -- [34]
				198888.449, -- [35]
				198888.898, -- [36]
				198889.07, -- [37]
				198889.423, -- [38]
				198889.854, -- [39]
				198892.407, -- [40]
				198892.834, -- [41]
				198893.276, -- [42]
				198893.426, -- [43]
				198893.835, -- [44]
				198894.429, -- [45]
				198894.864, -- [46]
				198894.987, -- [47]
				198895.396, -- [48]
				198895.874, -- [49]
				198896.4, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 762,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 16,
									["amount"] = 640,
								},
							},
							["count"] = 16,
							["amount"] = 640,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 127237,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 64.03999999999999,
								},
								["Таран"] = {
									["count"] = 9.810000000000001,
								},
							},
							["amount"] = 73.84999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.33,
								},
								["Валун"] = {
									["count"] = 160.7,
								},
								["Таран"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 177.3,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 18.9,
								},
								["Валун"] = {
									["count"] = 12.17,
								},
								["Синий колчедан"] = {
									["count"] = 9.090000000000002,
								},
							},
							["amount"] = 40.16,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 56.74,
								},
								["Валун"] = {
									["count"] = 6.859999999999999,
								},
								["Синий колчедан"] = {
									["count"] = 14.55,
								},
							},
							["amount"] = 78.15000000000002,
						},
					},
					["DamageTaken"] = 575207,
					["PartialResist"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 30,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 463,
									["amount"] = 0,
								},
							},
							["count"] = 463,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 130,
									["amount"] = 0,
								},
							},
							["count"] = 130,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 65,
									["amount"] = 0,
								},
							},
							["count"] = 65,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 30,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 463,
									["amount"] = 0,
								},
							},
							["count"] = 463,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 130,
									["amount"] = 0,
								},
							},
							["count"] = 130,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 65,
									["amount"] = 0,
								},
							},
							["count"] = 65,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 369.4599999999997,
					["ElementTaken"] = {
						["Physical"] = 81781,
						["Fire"] = 251561,
						["Melee"] = 177292,
						["Nature"] = 64573,
					},
					["DOT_Time"] = 255,
					["Damage"] = 38257126,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Ульдуарский великан"] = {
									["count"] = 78,
								},
								["Огненный Левиафан"] = {
									["count"] = 177,
								},
							},
							["amount"] = 255,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 640,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Physical"] = 1047476,
						["Fire"] = 20304343,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 91,
								},
							},
							["amount"] = 105,
						},
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 38,
								},
								["Tick"] = {
									["count"] = 19,
								},
							},
							["amount"] = 58,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 17,
								},
								["Miss"] = {
									["count"] = 32,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 401,
								},
							},
							["amount"] = 463,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 126,
								},
							},
							["amount"] = 130,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 2394192,
								},
								["Таран"] = {
									["count"] = 139282,
								},
							},
							["amount"] = 2533474,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 361000,
								},
								["Валун"] = {
									["count"] = 17138856,
								},
								["Таран"] = {
									["count"] = 908194,
								},
							},
							["amount"] = 18408050,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 1656000,
								},
								["Валун"] = {
									["count"] = 598210,
								},
								["Синий колчедан"] = {
									["count"] = 933368,
								},
							},
							["amount"] = 3187578,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11028000,
								},
								["Валун"] = {
									["count"] = 173085,
								},
								["Синий колчедан"] = {
									["count"] = 2926939,
								},
							},
							["amount"] = 14128024,
						},
					},
					["TimeDamage"] = 369.4599999999997,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 64.03999999999999,
								},
								["Таран"] = {
									["count"] = 9.810000000000001,
								},
							},
							["amount"] = 73.84999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.33,
								},
								["Валун"] = {
									["count"] = 160.7,
								},
								["Таран"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 177.3,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 18.9,
								},
								["Валун"] = {
									["count"] = 12.17,
								},
								["Синий колчедан"] = {
									["count"] = 9.090000000000002,
								},
							},
							["amount"] = 40.16,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 56.74,
								},
								["Валун"] = {
									["count"] = 6.859999999999999,
								},
								["Синий колчедан"] = {
									["count"] = 14.55,
								},
							},
							["amount"] = 78.15000000000002,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 130048,
									["min"] = 86962,
									["count"] = 37,
									["amount"] = 4221307,
								},
							},
							["count"] = 37,
							["amount"] = 4221307,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 21600,
									["count"] = 85,
									["amount"] = 12684000,
								},
							},
							["count"] = 85,
							["amount"] = 12684000,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 65744,
									["min"] = 54817,
									["count"] = 19,
									["amount"] = 1140238,
								},
								["Hit"] = {
									["max"] = 65964,
									["min"] = 47136,
									["count"] = 322,
									["amount"] = 19164105,
								},
							},
							["count"] = 341,
							["amount"] = 20304343,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25729,
									["min"] = 22734,
									["count"] = 43,
									["amount"] = 1047476,
								},
							},
							["count"] = 43,
							["amount"] = 1047476,
						},
					},
					["WhoDamaged"] = {
						["No One"] = {
							["Details"] = {
								["Воспламеняющая руна (УЗВ)"] = {
									["count"] = 35230,
								},
							},
							["amount"] = 35230,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 64573,
								},
								["Подрезать сухожилия"] = {
									["count"] = 3869,
								},
								["Атака ближнего боя"] = {
									["count"] = 125246,
								},
							},
							["amount"] = 193688,
						},
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 52046,
								},
								["Рунический огненный поток (УЗВ)"] = {
									["count"] = 35396,
								},
								["Выброс лавы"] = {
									["count"] = 96935,
								},
							},
							["amount"] = 184377,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 77912,
								},
								["Огненное дыхание"] = {
									["count"] = 84000,
								},
							},
							["amount"] = 161912,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 43,
								},
							},
							["amount"] = 43,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 341,
								},
							},
							["amount"] = 341,
						},
					},
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 762,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 16,
									["amount"] = 640,
								},
							},
							["count"] = 16,
							["amount"] = 640,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 127237,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 64.03999999999999,
								},
								["Таран"] = {
									["count"] = 9.810000000000001,
								},
							},
							["amount"] = 73.84999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.33,
								},
								["Валун"] = {
									["count"] = 160.7,
								},
								["Таран"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 177.3,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 18.9,
								},
								["Валун"] = {
									["count"] = 12.17,
								},
								["Синий колчедан"] = {
									["count"] = 9.090000000000002,
								},
							},
							["amount"] = 40.16,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 56.74,
								},
								["Валун"] = {
									["count"] = 6.859999999999999,
								},
								["Синий колчедан"] = {
									["count"] = 14.55,
								},
							},
							["amount"] = 78.15000000000002,
						},
					},
					["DamageTaken"] = 575207,
					["PartialResist"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 30,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 463,
									["amount"] = 0,
								},
							},
							["count"] = 463,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 130,
									["amount"] = 0,
								},
							},
							["count"] = 130,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 65,
									["amount"] = 0,
								},
							},
							["count"] = 65,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 30,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 463,
									["amount"] = 0,
								},
							},
							["count"] = 463,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 130,
									["amount"] = 0,
								},
							},
							["count"] = 130,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 65,
									["amount"] = 0,
								},
							},
							["count"] = 65,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 369.4599999999997,
					["ElementTaken"] = {
						["Physical"] = 81781,
						["Fire"] = 251561,
						["Melee"] = 177292,
						["Nature"] = 64573,
					},
					["DOT_Time"] = 255,
					["Damage"] = 38257126,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Ульдуарский великан"] = {
									["count"] = 78,
								},
								["Огненный Левиафан"] = {
									["count"] = 177,
								},
							},
							["amount"] = 255,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 640,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Physical"] = 1047476,
						["Fire"] = 20304343,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 91,
								},
							},
							["amount"] = 105,
						},
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 38,
								},
								["Tick"] = {
									["count"] = 19,
								},
							},
							["amount"] = 58,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 17,
								},
								["Miss"] = {
									["count"] = 32,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 401,
								},
							},
							["amount"] = 463,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 126,
								},
							},
							["amount"] = 130,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 2394192,
								},
								["Таран"] = {
									["count"] = 139282,
								},
							},
							["amount"] = 2533474,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 361000,
								},
								["Валун"] = {
									["count"] = 17138856,
								},
								["Таран"] = {
									["count"] = 908194,
								},
							},
							["amount"] = 18408050,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 1656000,
								},
								["Валун"] = {
									["count"] = 598210,
								},
								["Синий колчедан"] = {
									["count"] = 933368,
								},
							},
							["amount"] = 3187578,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11028000,
								},
								["Валун"] = {
									["count"] = 173085,
								},
								["Синий колчедан"] = {
									["count"] = 2926939,
								},
							},
							["amount"] = 14128024,
						},
					},
					["TimeDamage"] = 369.4599999999997,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 64.03999999999999,
								},
								["Таран"] = {
									["count"] = 9.810000000000001,
								},
							},
							["amount"] = 73.84999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.33,
								},
								["Валун"] = {
									["count"] = 160.7,
								},
								["Таран"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 177.3,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 18.9,
								},
								["Валун"] = {
									["count"] = 12.17,
								},
								["Синий колчедан"] = {
									["count"] = 9.090000000000002,
								},
							},
							["amount"] = 40.16,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 56.74,
								},
								["Валун"] = {
									["count"] = 6.859999999999999,
								},
								["Синий колчедан"] = {
									["count"] = 14.55,
								},
							},
							["amount"] = 78.15000000000002,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 130048,
									["min"] = 86962,
									["count"] = 37,
									["amount"] = 4221307,
								},
							},
							["count"] = 37,
							["amount"] = 4221307,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 21600,
									["count"] = 85,
									["amount"] = 12684000,
								},
							},
							["count"] = 85,
							["amount"] = 12684000,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 65744,
									["min"] = 54817,
									["count"] = 19,
									["amount"] = 1140238,
								},
								["Hit"] = {
									["max"] = 65964,
									["min"] = 47136,
									["count"] = 322,
									["amount"] = 19164105,
								},
							},
							["count"] = 341,
							["amount"] = 20304343,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25729,
									["min"] = 22734,
									["count"] = 43,
									["amount"] = 1047476,
								},
							},
							["count"] = 43,
							["amount"] = 1047476,
						},
					},
					["WhoDamaged"] = {
						["No One"] = {
							["Details"] = {
								["Воспламеняющая руна (УЗВ)"] = {
									["count"] = 35230,
								},
							},
							["amount"] = 35230,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 64573,
								},
								["Подрезать сухожилия"] = {
									["count"] = 3869,
								},
								["Атака ближнего боя"] = {
									["count"] = 125246,
								},
							},
							["amount"] = 193688,
						},
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 52046,
								},
								["Рунический огненный поток (УЗВ)"] = {
									["count"] = 35396,
								},
								["Выброс лавы"] = {
									["count"] = 96935,
								},
							},
							["amount"] = 184377,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 77912,
								},
								["Огненное дыхание"] = {
									["count"] = 84000,
								},
							},
							["amount"] = 161912,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 43,
								},
							},
							["amount"] = 43,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 341,
								},
							},
							["amount"] = 341,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 762,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 16,
									["amount"] = 640,
								},
							},
							["count"] = 16,
							["amount"] = 640,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 127237,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 64.03999999999999,
								},
								["Таран"] = {
									["count"] = 9.810000000000001,
								},
							},
							["amount"] = 73.84999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.33,
								},
								["Валун"] = {
									["count"] = 160.7,
								},
								["Таран"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 177.3,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 18.9,
								},
								["Валун"] = {
									["count"] = 12.17,
								},
								["Синий колчедан"] = {
									["count"] = 9.090000000000002,
								},
							},
							["amount"] = 40.16,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 56.74,
								},
								["Валун"] = {
									["count"] = 6.859999999999999,
								},
								["Синий колчедан"] = {
									["count"] = 14.55,
								},
							},
							["amount"] = 78.15000000000002,
						},
					},
					["DamageTaken"] = 575207,
					["PartialResist"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 30,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 463,
									["amount"] = 0,
								},
							},
							["count"] = 463,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 130,
									["amount"] = 0,
								},
							},
							["count"] = 130,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 65,
									["amount"] = 0,
								},
							},
							["count"] = 65,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 30,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 463,
									["amount"] = 0,
								},
							},
							["count"] = 463,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 130,
									["amount"] = 0,
								},
							},
							["count"] = 130,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 65,
									["amount"] = 0,
								},
							},
							["count"] = 65,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 369.4599999999997,
					["ElementTaken"] = {
						["Physical"] = 81781,
						["Fire"] = 251561,
						["Melee"] = 177292,
						["Nature"] = 64573,
					},
					["DOT_Time"] = 255,
					["Damage"] = 38257126,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Ульдуарский великан"] = {
									["count"] = 78,
								},
								["Огненный Левиафан"] = {
									["count"] = 177,
								},
							},
							["amount"] = 255,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 640,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Physical"] = 1047476,
						["Fire"] = 20304343,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 91,
								},
							},
							["amount"] = 105,
						},
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 38,
								},
								["Tick"] = {
									["count"] = 19,
								},
							},
							["amount"] = 58,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 17,
								},
								["Miss"] = {
									["count"] = 32,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 401,
								},
							},
							["amount"] = 463,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 126,
								},
							},
							["amount"] = 130,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 2394192,
								},
								["Таран"] = {
									["count"] = 139282,
								},
							},
							["amount"] = 2533474,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 361000,
								},
								["Валун"] = {
									["count"] = 17138856,
								},
								["Таран"] = {
									["count"] = 908194,
								},
							},
							["amount"] = 18408050,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 1656000,
								},
								["Валун"] = {
									["count"] = 598210,
								},
								["Синий колчедан"] = {
									["count"] = 933368,
								},
							},
							["amount"] = 3187578,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11028000,
								},
								["Валун"] = {
									["count"] = 173085,
								},
								["Синий колчедан"] = {
									["count"] = 2926939,
								},
							},
							["amount"] = 14128024,
						},
					},
					["TimeDamage"] = 369.4599999999997,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 64.03999999999999,
								},
								["Таран"] = {
									["count"] = 9.810000000000001,
								},
							},
							["amount"] = 73.84999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.33,
								},
								["Валун"] = {
									["count"] = 160.7,
								},
								["Таран"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 177.3,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 18.9,
								},
								["Валун"] = {
									["count"] = 12.17,
								},
								["Синий колчедан"] = {
									["count"] = 9.090000000000002,
								},
							},
							["amount"] = 40.16,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 56.74,
								},
								["Валун"] = {
									["count"] = 6.859999999999999,
								},
								["Синий колчедан"] = {
									["count"] = 14.55,
								},
							},
							["amount"] = 78.15000000000002,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 130048,
									["min"] = 86962,
									["count"] = 37,
									["amount"] = 4221307,
								},
							},
							["count"] = 37,
							["amount"] = 4221307,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 21600,
									["count"] = 85,
									["amount"] = 12684000,
								},
							},
							["count"] = 85,
							["amount"] = 12684000,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 65744,
									["min"] = 54817,
									["count"] = 19,
									["amount"] = 1140238,
								},
								["Hit"] = {
									["max"] = 65964,
									["min"] = 47136,
									["count"] = 322,
									["amount"] = 19164105,
								},
							},
							["count"] = 341,
							["amount"] = 20304343,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25729,
									["min"] = 22734,
									["count"] = 43,
									["amount"] = 1047476,
								},
							},
							["count"] = 43,
							["amount"] = 1047476,
						},
					},
					["WhoDamaged"] = {
						["No One"] = {
							["Details"] = {
								["Воспламеняющая руна (УЗВ)"] = {
									["count"] = 35230,
								},
							},
							["amount"] = 35230,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 64573,
								},
								["Подрезать сухожилия"] = {
									["count"] = 3869,
								},
								["Атака ближнего боя"] = {
									["count"] = 125246,
								},
							},
							["amount"] = 193688,
						},
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 52046,
								},
								["Рунический огненный поток (УЗВ)"] = {
									["count"] = 35396,
								},
								["Выброс лавы"] = {
									["count"] = 96935,
								},
							},
							["amount"] = 184377,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 77912,
								},
								["Огненное дыхание"] = {
									["count"] = 84000,
								},
							},
							["amount"] = 161912,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 43,
								},
							},
							["amount"] = 43,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 341,
								},
							},
							["amount"] = 341,
						},
					},
				},
			},
			["UnitLockout"] = 1682203972,
			["LastActive"] = 1682204516,
		},
		["Shamamama"] = {
			["GUID"] = "0x070000000087195C",
			["type"] = "Ungrouped",
			["FightsSaved"] = 1,
			["Owner"] = false,
			["enClass"] = "SHAMAN",
			["unit"] = "Shamamama",
			["Name"] = "Shamamama",
			["Pet"] = {
				"Трофейный разрушитель <Shamamama>", -- [1]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
			},
			["level"] = 80,
			["UnitLockout"] = 1682203972,
			["LastFightIn"] = 0,
		},
		["Трофейный разрушитель <Jacket>"] = {
			["GUID"] = "0xF15000815500000E",
			["LastEventHealth"] = {
				"149687 (28%)", -- [1]
				"149687 (28%)", -- [2]
				"145187 (27%)", -- [3]
				"141244 (26%)", -- [4]
				"141244 (26%)", -- [5]
				"141244 (26%)", -- [6]
				"141244 (26%)", -- [7]
				"137974 (26%)", -- [8]
				"135209 (25%)", -- [9]
				"293151 (55%)", -- [10]
				"225673 (42%)", -- [11]
				"225673 (42%)", -- [12]
				"222927 (42%)", -- [13]
				"222927 (42%)", -- [14]
				"222927 (42%)", -- [15]
				"222927 (42%)", -- [16]
				"218795 (41%)", -- [17]
				"218795 (41%)", -- [18]
				"218795 (41%)", -- [19]
				"214722 (40%)", -- [20]
				"214722 (40%)", -- [21]
				"214722 (40%)", -- [22]
				"210222 (39%)", -- [23]
				"206279 (38%)", -- [24]
				"206279 (38%)", -- [25]
				"201779 (38%)", -- [26]
				"201779 (38%)", -- [27]
				"197279 (37%)", -- [28]
				"197279 (37%)", -- [29]
				"197279 (37%)", -- [30]
				"192779 (36%)", -- [31]
				"188641 (35%)", -- [32]
				"188641 (35%)", -- [33]
				"184141 (34%)", -- [34]
				"184141 (34%)", -- [35]
				"184141 (34%)", -- [36]
				"180072 (34%)", -- [37]
				"175572 (33%)", -- [38]
				"175572 (33%)", -- [39]
				"171072 (32%)", -- [40]
				"171072 (32%)", -- [41]
				"171072 (32%)", -- [42]
				"166572 (31%)", -- [43]
				"162766 (30%)", -- [44]
				"162766 (30%)", -- [45]
				"162766 (30%)", -- [46]
				"158266 (29%)", -- [47]
				"158266 (29%)", -- [48]
				"153766 (29%)", -- [49]
				"149687 (28%)", -- [50]
			},
			["LastAttackedBy"] = "Огненный Левиафан",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					256.6399999999999, -- [1]
				},
				["DOT_Time"] = {
					189, -- [1]
				},
				["TimeDamage"] = {
					256.6399999999999, -- [1]
				},
				["DamageTaken"] = {
					354294, -- [1]
				},
				["Damage"] = {
					12404802, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Трофейный разрушитель",
			["level"] = 1,
			["LastDamageAbility"] = "Заградительные стрелы",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				nil, -- [1]
				nil, -- [2]
				0.8503417428982292, -- [3]
				0.745088331610604, -- [4]
				nil, -- [5]
				nil, -- [6]
				nil, -- [7]
				nil, -- [8]
				0.5224877598030231, -- [9]
				nil, -- [10]
				12.75096891717483, -- [11]
				nil, -- [12]
				0.518897427999675, -- [13]
				nil, -- [14]
				nil, -- [15]
				nil, -- [16]
				0.7808026848123296, -- [17]
				nil, -- [18]
				nil, -- [19]
				0.769653759738775, -- [20]
				nil, -- [21]
				nil, -- [22]
				0.8503417428982292, -- [23]
				0.745088331610604, -- [24]
				nil, -- [25]
				0.8503417428982292, -- [26]
				nil, -- [27]
				0.8503417428982292, -- [28]
				nil, -- [29]
				nil, -- [30]
				0.8503417428982292, -- [31]
				0.7819364738028606, -- [32]
				nil, -- [33]
				0.8503417428982292, -- [34]
				nil, -- [35]
				nil, -- [36]
				0.7688979004117543, -- [37]
				0.8503417428982292, -- [38]
				nil, -- [39]
				0.8503417428982292, -- [40]
				nil, -- [41]
				nil, -- [42]
				0.8503417428982292, -- [43]
				0.7192001496601468, -- [44]
				[47] = 0.8503417428982292,
				[49] = 0.8503417428982292,
				[50] = 0.770787548729306,
			},
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastDamageTaken"] = 2765,
			["TimeLast"] = {
				["DOT_Time"] = 1682204515,
				["ActiveTime"] = 1682204515,
				["TimeDamage"] = 1682204515,
				["OVERALL"] = 1682204515,
				["DamageTaken"] = 1682204515,
				["Damage"] = 1682204515,
			},
			["Owner"] = "Jacket",
			["LastAbility"] = 198901.106,
			["NextEventNum"] = 10,
			["LastEventHealthNum"] = {
				28.28557877093494, -- [1]
				28.28557877093494, -- [2]
				27.43523702803671, -- [3]
				26.69014869642611, -- [4]
				26.69014869642611, -- [5]
				26.69014869642611, -- [6]
				26.69014869642611, -- [7]
				26.07223369658673, -- [8]
				25.54974593678371, -- [9]
				55.39522939385751, -- [10]
				42.64426047668268, -- [11]
				42.64426047668268, -- [12]
				42.12536304868301, -- [13]
				42.12536304868301, -- [14]
				42.12536304868301, -- [15]
				42.12536304868301, -- [16]
				41.34456036387068, -- [17]
				41.34456036387068, -- [18]
				41.34456036387068, -- [19]
				40.5749066041319, -- [20]
				40.5749066041319, -- [21]
				40.5749066041319, -- [22]
				39.72456486123367, -- [23]
				38.97947652962307, -- [24]
				38.97947652962307, -- [25]
				38.12913478672484, -- [26]
				38.12913478672484, -- [27]
				37.27879304382661, -- [28]
				37.27879304382661, -- [29]
				37.27879304382661, -- [30]
				36.42845130092839, -- [31]
				35.64651482712552, -- [32]
				35.64651482712552, -- [33]
				34.79617308422729, -- [34]
				34.79617308422729, -- [35]
				34.79617308422729, -- [36]
				34.02727518381554, -- [37]
				33.17693344091731, -- [38]
				33.17693344091731, -- [39]
				32.32659169801908, -- [40]
				32.32659169801908, -- [41]
				32.32659169801908, -- [42]
				31.47624995512085, -- [43]
				30.75704980546071, -- [44]
				30.75704980546071, -- [45]
				30.75704980546071, -- [46]
				29.90670806256248, -- [47]
				29.90670806256248, -- [48]
				29.05636631966425, -- [49]
				28.28557877093494, -- [50]
			},
			["LastEvents"] = {
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -45709", -- [1]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -80640 (20160 сопрот.)", -- [2]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [3]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -3943 (Physical)", -- [4]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [5]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -41348 (10337 сопрот.)", -- [6]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [7]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [8]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -2765 (Physical)", -- [9]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -80640 (20160 сопрот.)", -- [10]
				"Огненный Левиафан Стенобитный таран Трофейный разрушитель <Jacket> Hit -67478 (Physical)", -- [11]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [12]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -2746 (Physical)", -- [13]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [14]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -46491", -- [15]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [16]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -4132 (Physical)", -- [17]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [18]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [19]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -4073 (Physical)", -- [20]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [21]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [22]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [23]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -3943 (Physical)", -- [24]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [25]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [26]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [27]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [28]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [29]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -54598", -- [30]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [31]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -4138 (Physical)", -- [32]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [33]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [34]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -45246 (5027 сопрот.)", -- [35]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [36]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -4069 (Physical)", -- [37]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [38]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [39]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [40]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -40190 (10047 сопрот.)", -- [41]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [42]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [43]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -3806 (Physical)", -- [44]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [45]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -53114", -- [46]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [47]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -80640 (20160 сопрот.)", -- [48]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [49]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -4079 (Physical)", -- [50]
			},
			["Name"] = "Трофейный разрушитель",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				198895.874, -- [1]
				198896.037, -- [2]
				198896.401, -- [3]
				198896.956, -- [4]
				198897.046, -- [5]
				198897.677, -- [6]
				198898.136, -- [7]
				198901.106, -- [8]
				198901.239, -- [9]
				198878.737, -- [10]
				198878.913, -- [11]
				198879.725, -- [12]
				198880.028, -- [13]
				198880.767, -- [14]
				198881.008, -- [15]
				198881.768, -- [16]
				198882.657, -- [17]
				198882.764, -- [18]
				198883.768, -- [19]
				198884.24, -- [20]
				198884.782, -- [21]
				198885.788, -- [22]
				198886.443, -- [23]
				198886.567, -- [24]
				198886.773, -- [25]
				198887.411, -- [26]
				198887.776, -- [27]
				198888.45, -- [28]
				198888.789, -- [29]
				198888.97, -- [30]
				198889.423, -- [31]
				198889.46, -- [32]
				198889.854, -- [33]
				198890.424, -- [34]
				198890.836, -- [35]
				198890.921, -- [36]
				198891.358, -- [37]
				198891.427, -- [38]
				198891.869, -- [39]
				198892.407, -- [40]
				198892.496, -- [41]
				198892.954, -- [42]
				198893.426, -- [43]
				198893.571, -- [44]
				198893.994, -- [45]
				198894.102, -- [46]
				198894.43, -- [47]
				198894.988, -- [48]
				198895.397, -- [49]
				198895.459, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 321,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 5,
									["amount"] = 200,
								},
							},
							["count"] = 5,
							["amount"] = 200,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 22525,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.5,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 6.6,
								},
								["Валун"] = {
									["count"] = 17.42,
								},
								["Таран"] = {
									["count"] = 7.04,
								},
							},
							["amount"] = 34.56,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 5.27,
								},
								["Валун"] = {
									["count"] = 124.5,
								},
								["Таран"] = {
									["count"] = 6.94,
								},
							},
							["amount"] = 136.71,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8.210000000000001,
								},
							},
							["amount"] = 8.210000000000001,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 55.45,
								},
								["Валун"] = {
									["count"] = 9.32,
								},
								["Синий колчедан"] = {
									["count"] = 12.39,
								},
							},
							["amount"] = 77.15999999999998,
						},
					},
					["DamageTaken"] = 354294,
					["PartialResist"] = {
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 0,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 86,
									["amount"] = 0,
								},
							},
							["count"] = 86,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 0,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 86,
									["amount"] = 0,
								},
							},
							["count"] = 86,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 256.6399999999999,
					["ElementTaken"] = {
						["Physical"] = 154891,
						["Fire"] = 141641,
						["Melee"] = 27827,
						["Nature"] = 29935,
					},
					["DOT_Time"] = 189,
					["Damage"] = 12404802,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Испещренный рунами часовой"] = {
									["count"] = 27,
								},
								["Огненный Левиафан"] = {
									["count"] = 162,
								},
							},
							["amount"] = 189,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 200,
					},
					["ElementDone"] = {
						["Physical"] = 111979,
						["Fire"] = 5882688,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 33,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 34,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 26,
								},
							},
							["amount"] = 35,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 74,
								},
							},
							["amount"] = 86,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 57,
								},
							},
							["amount"] = 59,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 103943,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 87696,
								},
								["Валун"] = {
									["count"] = 258716,
								},
								["Таран"] = {
									["count"] = 29476,
								},
							},
							["amount"] = 479831,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 671484,
								},
								["Валун"] = {
									["count"] = 5428344,
								},
								["Таран"] = {
									["count"] = 82503,
								},
							},
							["amount"] = 6182331,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 97108,
								},
							},
							["amount"] = 97108,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 4506384,
								},
								["Валун"] = {
									["count"] = 98520,
								},
								["Синий колчедан"] = {
									["count"] = 1040628,
								},
							},
							["amount"] = 5645532,
						},
					},
					["TimeDamage"] = 256.6399999999999,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.5,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 6.6,
								},
								["Валун"] = {
									["count"] = 17.42,
								},
								["Таран"] = {
									["count"] = 7.04,
								},
							},
							["amount"] = 34.56,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 5.27,
								},
								["Валун"] = {
									["count"] = 124.5,
								},
								["Таран"] = {
									["count"] = 6.94,
								},
							},
							["amount"] = 136.71,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8.210000000000001,
								},
							},
							["amount"] = 8.210000000000001,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 55.45,
								},
								["Валун"] = {
									["count"] = 9.32,
								},
								["Синий колчедан"] = {
									["count"] = 12.39,
								},
							},
							["amount"] = 77.15999999999998,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 55415,
									["min"] = 39668,
									["count"] = 37,
									["amount"] = 1816055,
								},
							},
							["count"] = 37,
							["amount"] = 1816055,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 120000,
									["min"] = 8064,
									["count"] = 63,
									["amount"] = 4594080,
								},
							},
							["count"] = 63,
							["amount"] = 4594080,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 26755,
									["min"] = 19277,
									["count"] = 8,
									["amount"] = 197887,
								},
								["Hit"] = {
									["max"] = 27715,
									["min"] = 18579,
									["count"] = 226,
									["amount"] = 5684801,
								},
							},
							["count"] = 234,
							["amount"] = 5882688,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 10776,
									["min"] = 9657,
									["count"] = 11,
									["amount"] = 111979,
								},
							},
							["count"] = 11,
							["amount"] = 111979,
						},
					},
					["WhoDamaged"] = {
						["No One"] = {
							["Details"] = {
								["Воспламеняющая руна (УЗВ)"] = {
									["count"] = 12351,
								},
							},
							["amount"] = 12351,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 29935,
								},
								["Подрезать сухожилия"] = {
									["count"] = 187,
								},
								["Атака ближнего боя"] = {
									["count"] = 23275,
								},
							},
							["amount"] = 53397,
						},
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 9866,
								},
								["Рунический огненный поток (УЗВ)"] = {
									["count"] = 27924,
								},
								["Атака ближнего боя"] = {
									["count"] = 4552,
								},
							},
							["amount"] = 42342,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 87226,
								},
								["Огненное дыхание"] = {
									["count"] = 91500,
								},
								["Стенобитный таран"] = {
									["count"] = 67478,
								},
							},
							["amount"] = 246204,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 234,
								},
							},
							["amount"] = 234,
						},
					},
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 321,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 5,
									["amount"] = 200,
								},
							},
							["count"] = 5,
							["amount"] = 200,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 22525,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.5,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 6.6,
								},
								["Валун"] = {
									["count"] = 17.42,
								},
								["Таран"] = {
									["count"] = 7.04,
								},
							},
							["amount"] = 34.56,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 5.27,
								},
								["Валун"] = {
									["count"] = 124.5,
								},
								["Таран"] = {
									["count"] = 6.94,
								},
							},
							["amount"] = 136.71,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8.210000000000001,
								},
							},
							["amount"] = 8.210000000000001,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 55.45,
								},
								["Валун"] = {
									["count"] = 9.32,
								},
								["Синий колчедан"] = {
									["count"] = 12.39,
								},
							},
							["amount"] = 77.15999999999998,
						},
					},
					["DamageTaken"] = 354294,
					["PartialResist"] = {
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 0,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 86,
									["amount"] = 0,
								},
							},
							["count"] = 86,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 0,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 86,
									["amount"] = 0,
								},
							},
							["count"] = 86,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 256.6399999999999,
					["ElementTaken"] = {
						["Physical"] = 154891,
						["Fire"] = 141641,
						["Melee"] = 27827,
						["Nature"] = 29935,
					},
					["DOT_Time"] = 189,
					["Damage"] = 12404802,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Испещренный рунами часовой"] = {
									["count"] = 27,
								},
								["Огненный Левиафан"] = {
									["count"] = 162,
								},
							},
							["amount"] = 189,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 200,
					},
					["ElementDone"] = {
						["Physical"] = 111979,
						["Fire"] = 5882688,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 33,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 34,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 26,
								},
							},
							["amount"] = 35,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 74,
								},
							},
							["amount"] = 86,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 57,
								},
							},
							["amount"] = 59,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 103943,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 87696,
								},
								["Валун"] = {
									["count"] = 258716,
								},
								["Таран"] = {
									["count"] = 29476,
								},
							},
							["amount"] = 479831,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 671484,
								},
								["Валун"] = {
									["count"] = 5428344,
								},
								["Таран"] = {
									["count"] = 82503,
								},
							},
							["amount"] = 6182331,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 97108,
								},
							},
							["amount"] = 97108,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 4506384,
								},
								["Валун"] = {
									["count"] = 98520,
								},
								["Синий колчедан"] = {
									["count"] = 1040628,
								},
							},
							["amount"] = 5645532,
						},
					},
					["TimeDamage"] = 256.6399999999999,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.5,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 6.6,
								},
								["Валун"] = {
									["count"] = 17.42,
								},
								["Таран"] = {
									["count"] = 7.04,
								},
							},
							["amount"] = 34.56,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 5.27,
								},
								["Валун"] = {
									["count"] = 124.5,
								},
								["Таран"] = {
									["count"] = 6.94,
								},
							},
							["amount"] = 136.71,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8.210000000000001,
								},
							},
							["amount"] = 8.210000000000001,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 55.45,
								},
								["Валун"] = {
									["count"] = 9.32,
								},
								["Синий колчедан"] = {
									["count"] = 12.39,
								},
							},
							["amount"] = 77.15999999999998,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 55415,
									["min"] = 39668,
									["count"] = 37,
									["amount"] = 1816055,
								},
							},
							["count"] = 37,
							["amount"] = 1816055,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 120000,
									["min"] = 8064,
									["count"] = 63,
									["amount"] = 4594080,
								},
							},
							["count"] = 63,
							["amount"] = 4594080,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 26755,
									["min"] = 19277,
									["count"] = 8,
									["amount"] = 197887,
								},
								["Hit"] = {
									["max"] = 27715,
									["min"] = 18579,
									["count"] = 226,
									["amount"] = 5684801,
								},
							},
							["count"] = 234,
							["amount"] = 5882688,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 10776,
									["min"] = 9657,
									["count"] = 11,
									["amount"] = 111979,
								},
							},
							["count"] = 11,
							["amount"] = 111979,
						},
					},
					["WhoDamaged"] = {
						["No One"] = {
							["Details"] = {
								["Воспламеняющая руна (УЗВ)"] = {
									["count"] = 12351,
								},
							},
							["amount"] = 12351,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 29935,
								},
								["Подрезать сухожилия"] = {
									["count"] = 187,
								},
								["Атака ближнего боя"] = {
									["count"] = 23275,
								},
							},
							["amount"] = 53397,
						},
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 9866,
								},
								["Рунический огненный поток (УЗВ)"] = {
									["count"] = 27924,
								},
								["Атака ближнего боя"] = {
									["count"] = 4552,
								},
							},
							["amount"] = 42342,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 87226,
								},
								["Огненное дыхание"] = {
									["count"] = 91500,
								},
								["Стенобитный таран"] = {
									["count"] = 67478,
								},
							},
							["amount"] = 246204,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 234,
								},
							},
							["amount"] = 234,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 321,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 5,
									["amount"] = 200,
								},
							},
							["count"] = 5,
							["amount"] = 200,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 22525,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.5,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 6.6,
								},
								["Валун"] = {
									["count"] = 17.42,
								},
								["Таран"] = {
									["count"] = 7.04,
								},
							},
							["amount"] = 34.56,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 5.27,
								},
								["Валун"] = {
									["count"] = 124.5,
								},
								["Таран"] = {
									["count"] = 6.94,
								},
							},
							["amount"] = 136.71,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8.210000000000001,
								},
							},
							["amount"] = 8.210000000000001,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 55.45,
								},
								["Валун"] = {
									["count"] = 9.32,
								},
								["Синий колчедан"] = {
									["count"] = 12.39,
								},
							},
							["amount"] = 77.15999999999998,
						},
					},
					["DamageTaken"] = 354294,
					["PartialResist"] = {
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 0,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 86,
									["amount"] = 0,
								},
							},
							["count"] = 86,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рунический огненный поток (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 0,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 86,
									["amount"] = 0,
								},
							},
							["count"] = 86,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Воспламеняющая руна (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 256.6399999999999,
					["ElementTaken"] = {
						["Physical"] = 154891,
						["Fire"] = 141641,
						["Melee"] = 27827,
						["Nature"] = 29935,
					},
					["DOT_Time"] = 189,
					["Damage"] = 12404802,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Испещренный рунами часовой"] = {
									["count"] = 27,
								},
								["Огненный Левиафан"] = {
									["count"] = 162,
								},
							},
							["amount"] = 189,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 200,
					},
					["ElementDone"] = {
						["Physical"] = 111979,
						["Fire"] = 5882688,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 33,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 34,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 26,
								},
							},
							["amount"] = 35,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 74,
								},
							},
							["amount"] = 86,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 57,
								},
							},
							["amount"] = 59,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 103943,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 87696,
								},
								["Валун"] = {
									["count"] = 258716,
								},
								["Таран"] = {
									["count"] = 29476,
								},
							},
							["amount"] = 479831,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 671484,
								},
								["Валун"] = {
									["count"] = 5428344,
								},
								["Таран"] = {
									["count"] = 82503,
								},
							},
							["amount"] = 6182331,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 97108,
								},
							},
							["amount"] = 97108,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 4506384,
								},
								["Валун"] = {
									["count"] = 98520,
								},
								["Синий колчедан"] = {
									["count"] = 1040628,
								},
							},
							["amount"] = 5645532,
						},
					},
					["TimeDamage"] = 256.6399999999999,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 3.5,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 6.6,
								},
								["Валун"] = {
									["count"] = 17.42,
								},
								["Таран"] = {
									["count"] = 7.04,
								},
							},
							["amount"] = 34.56,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 5.27,
								},
								["Валун"] = {
									["count"] = 124.5,
								},
								["Таран"] = {
									["count"] = 6.94,
								},
							},
							["amount"] = 136.71,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8.210000000000001,
								},
							},
							["amount"] = 8.210000000000001,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 55.45,
								},
								["Валун"] = {
									["count"] = 9.32,
								},
								["Синий колчедан"] = {
									["count"] = 12.39,
								},
							},
							["amount"] = 77.15999999999998,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 55415,
									["min"] = 39668,
									["count"] = 37,
									["amount"] = 1816055,
								},
							},
							["count"] = 37,
							["amount"] = 1816055,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 120000,
									["min"] = 8064,
									["count"] = 63,
									["amount"] = 4594080,
								},
							},
							["count"] = 63,
							["amount"] = 4594080,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 26755,
									["min"] = 19277,
									["count"] = 8,
									["amount"] = 197887,
								},
								["Hit"] = {
									["max"] = 27715,
									["min"] = 18579,
									["count"] = 226,
									["amount"] = 5684801,
								},
							},
							["count"] = 234,
							["amount"] = 5882688,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 10776,
									["min"] = 9657,
									["count"] = 11,
									["amount"] = 111979,
								},
							},
							["count"] = 11,
							["amount"] = 111979,
						},
					},
					["WhoDamaged"] = {
						["No One"] = {
							["Details"] = {
								["Воспламеняющая руна (УЗВ)"] = {
									["count"] = 12351,
								},
							},
							["amount"] = 12351,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 29935,
								},
								["Подрезать сухожилия"] = {
									["count"] = 187,
								},
								["Атака ближнего боя"] = {
									["count"] = 23275,
								},
							},
							["amount"] = 53397,
						},
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 9866,
								},
								["Рунический огненный поток (УЗВ)"] = {
									["count"] = 27924,
								},
								["Атака ближнего боя"] = {
									["count"] = 4552,
								},
							},
							["amount"] = 42342,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 87226,
								},
								["Огненное дыхание"] = {
									["count"] = 91500,
								},
								["Стенобитный таран"] = {
									["count"] = 67478,
								},
							},
							["amount"] = 246204,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 234,
								},
							},
							["amount"] = 234,
						},
					},
				},
			},
			["UnitLockout"] = 1682203974,
			["LastActive"] = 1682204515,
		},
		["Огненный Левиафан"] = {
			["GUID"] = "0xF1500081590002C3",
			["LastEventHealth"] = {
				"2480026 (10%)", -- [1]
				"2480026 (10%)", -- [2]
				"2399386 (10%)", -- [3]
				"2399386 (10%)", -- [4]
				"2399386 (10%)", -- [5]
				"2399386 (10%)", -- [6]
				"2353677 (10%)", -- [7]
				"2137677 (9%)", -- [8]
				"2057037 (8%)", -- [9]
				"2057037 (8%)", -- [10]
				"2057037 (8%)", -- [11]
				"1940093 (8%)", -- [12]
				"1940093 (8%)", -- [13]
				"1748093 (7%)", -- [14]
				"1748093 (7%)", -- [15]
				"1657373 (7%)", -- [16]
				"1616025 (7%)", -- [17]
				"1400025 (6%)", -- [18]
				"1289395 (5%)", -- [19]
				"1289395 (5%)", -- [20]
				"1198675 (5%)", -- [21]
				"982675 (4%)", -- [22]
				"891955 (3%)", -- [23]
				"891955 (3%)", -- [24]
				"891955 (3%)", -- [25]
				"651955 (2%)", -- [26]
				"561235 (2%)", -- [27]
				"447031 (1%)", -- [28]
				"231031 (1%)", -- [29]
				"130231 (0%)", -- [30]
				"130231 (0%)", -- [31]
				"130231 (0%)", -- [32]
				"1 (0%)", -- [33]
				"0 (0%)", -- [34]
				"3513650 (15%)", -- [35]
				"3412850 (14%)", -- [36]
				"3412850 (14%)", -- [37]
				"3412850 (14%)", -- [38]
				"3372660 (14%)", -- [39]
				"3156660 (13%)", -- [40]
				"3055860 (13%)", -- [41]
				"3055860 (13%)", -- [42]
				"3055860 (13%)", -- [43]
				"3055860 (13%)", -- [44]
				"3055860 (13%)", -- [45]
				"2839860 (12%)", -- [46]
				"2749140 (11%)", -- [47]
				"2696026 (11%)", -- [48]
				"2696026 (11%)", -- [49]
				"2696026 (11%)", -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"MISC", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					69.81000000000003, -- [1]
				},
				["TimeDamage"] = {
					69.81000000000003, -- [1]
				},
				["DamageTaken"] = {
					23119019, -- [1]
				},
				["Damage"] = {
					480373, -- [1]
				},
			},
			["enClass"] = "MOB",
			["LastDamageTaken"] = 240000,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						false, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						false, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						false, -- [26]
						false, -- [27]
						true, -- [28]
						false, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						false, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						false, -- [40]
						false, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						false, -- [47]
						false, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [1]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [2]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [3]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [4]
						"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -40190 (10047 сопрот.)", -- [5]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [6]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [7]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2475 (Physical)", -- [8]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [9]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [10]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -3806 (Physical)", -- [11]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [12]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [13]
						"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -53114", -- [14]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [15]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [16]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [17]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2615 (Physical)", -- [18]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -80640 (20160 сопрот.)", -- [19]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [20]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [21]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -4079 (Physical)", -- [22]
						"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -45709", -- [23]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [24]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -80640 (20160 сопрот.)", -- [25]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [26]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [27]
						"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -116944", -- [28]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2581 (Physical)", -- [29]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [30]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -3943 (Physical)", -- [31]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [32]
						"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -41348 (10337 сопрот.)", -- [33]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [34]
						"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -110630 (12292 сопрот.)", -- [35]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2562 (Physical)", -- [36]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [37]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [38]
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [39]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель Hit -3892 (Physical)", -- [40]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2562 (Physical)", -- [41]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [42]
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [43]
						"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -114204", -- [44]
						"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [45]
						"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [46]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -2765 (Physical)", -- [47]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2475 (Physical)", -- [48]
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [49]
						"Огненный Левиафан умирает.", -- [50]
					},
					["DeathAt"] = 1682204518,
					["HealthNum"] = {
						15.27059769440551, -- [1]
						14.83251301107164, -- [2]
						14.83251301107164, -- [3]
						14.83251301107164, -- [4]
						14.65784412790508, -- [5]
						13.71909123504678, -- [6]
						13.2810065517129, -- [7]
						13.2810065517129, -- [8]
						13.2810065517129, -- [9]
						13.2810065517129, -- [10]
						13.2810065517129, -- [11]
						12.34225365885459, -- [12]
						11.9479774438541, -- [13]
						11.71713984593153, -- [14]
						11.71713984593153, -- [15]
						11.71713984593153, -- [16]
						10.77838695307322, -- [17]
						10.77838695307322, -- [18]
						10.42791920640612, -- [19]
						10.42791920640612, -- [20]
						10.42791920640612, -- [21]
						10.42791920640612, -- [22]
						10.2292643176114, -- [23]
						9.290511424753088, -- [24]
						8.940043678085987, -- [25]
						8.940043678085987, -- [26]
						8.940043678085987, -- [27]
						8.431795908167368, -- [28]
						8.431795908167368, -- [29]
						7.597348892293317, -- [30]
						7.597348892293317, -- [31]
						7.203072677292828, -- [32]
						7.023371035561785, -- [33]
						6.084618142703478, -- [34]
						5.603811510588133, -- [35]
						5.603811510588133, -- [36]
						5.209535295587644, -- [37]
						4.270782402729338, -- [38]
						3.876506187728848, -- [39]
						3.876506187728848, -- [40]
						3.876506187728848, -- [41]
						2.833447417886285, -- [42]
						2.439171202885796, -- [43]
						1.942831687256212, -- [44]
						1.004078794397905, -- [45]
						0.5659941110640286, -- [46]
						0.5659941110640286, -- [47]
						0.5659941110640286, -- [48]
						4.346078207677347e-006, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-10.2839999999851, -- [1]
						-10.23999999999069, -- [2]
						-9.702999999979511, -- [3]
						-9.701999999990221, -- [4]
						-9.612999999983003, -- [5]
						-9.274000000004889, -- [6]
						-9.154999999998836, -- [7]
						-8.832999999984168, -- [8]
						-8.682999999989988, -- [9]
						-8.682999999989988, -- [10]
						-8.538999999989756, -- [11]
						-8.274000000004889, -- [12]
						-8.114999999990687, -- [13]
						-8.006999999983236, -- [14]
						-7.679999999993015, -- [15]
						-7.679000000003725, -- [16]
						-7.244999999995343, -- [17]
						-7.122000000003027, -- [18]
						-7.120999999984633, -- [19]
						-6.712999999988824, -- [20]
						-6.711999999999534, -- [21]
						-6.649999999994179, -- [22]
						-6.23499999998603, -- [23]
						-6.23499999998603, -- [24]
						-6.071999999985565, -- [25]
						-5.709000000002561, -- [26]
						-5.707999999984168, -- [27]
						-5.61699999999837, -- [28]
						-5.554000000003725, -- [29]
						-5.217000000004191, -- [30]
						-5.152999999991152, -- [31]
						-5.062999999994645, -- [32]
						-4.432000000000699, -- [33]
						-4.210999999981141, -- [34]
						-4.130999999993946, -- [35]
						-4.130000000004657, -- [36]
						-3.972999999998137, -- [37]
						-3.172999999980675, -- [38]
						-3.00099999998929, -- [39]
						-2.970000000001164, -- [40]
						-2.429000000003725, -- [41]
						-2.134999999980209, -- [42]
						-2.005999999993946, -- [43]
						-1.490999999979977, -- [44]
						-1.135999999998603, -- [45]
						-1.002999999996973, -- [46]
						-0.8709999999846332, -- [47]
						-0.4829999999783468, -- [48]
						-0.05400000000372529, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "Трофейный разрушитель",
					["Health"] = {
						"3513650 (15%)", -- [1]
						"3412850 (14%)", -- [2]
						"3412850 (14%)", -- [3]
						"3412850 (14%)", -- [4]
						"3372660 (14%)", -- [5]
						"3156660 (13%)", -- [6]
						"3055860 (13%)", -- [7]
						"3055860 (13%)", -- [8]
						"3055860 (13%)", -- [9]
						"3055860 (13%)", -- [10]
						"3055860 (13%)", -- [11]
						"2839860 (12%)", -- [12]
						"2749140 (11%)", -- [13]
						"2696026 (11%)", -- [14]
						"2696026 (11%)", -- [15]
						"2696026 (11%)", -- [16]
						"2480026 (10%)", -- [17]
						"2480026 (10%)", -- [18]
						"2399386 (10%)", -- [19]
						"2399386 (10%)", -- [20]
						"2399386 (10%)", -- [21]
						"2399386 (10%)", -- [22]
						"2353677 (10%)", -- [23]
						"2137677 (9%)", -- [24]
						"2057037 (8%)", -- [25]
						"2057037 (8%)", -- [26]
						"2057037 (8%)", -- [27]
						"1940093 (8%)", -- [28]
						"1940093 (8%)", -- [29]
						"1748093 (7%)", -- [30]
						"1748093 (7%)", -- [31]
						"1657373 (7%)", -- [32]
						"1616025 (7%)", -- [33]
						"1400025 (6%)", -- [34]
						"1289395 (5%)", -- [35]
						"1289395 (5%)", -- [36]
						"1198675 (5%)", -- [37]
						"982675 (4%)", -- [38]
						"891955 (3%)", -- [39]
						"891955 (3%)", -- [40]
						"891955 (3%)", -- [41]
						"651955 (2%)", -- [42]
						"561235 (2%)", -- [43]
						"447031 (1%)", -- [44]
						"231031 (1%)", -- [45]
						"130231 (0%)", -- [46]
						"130231 (0%)", -- [47]
						"130231 (0%)", -- [48]
						"1 (0%)", -- [49]
						"0 (0%)", -- [50]
					},
					["EventNum"] = {
						1.043058769842563, -- [1]
						0.4380846833338766, -- [2]
						0, -- [3]
						0, -- [4]
						0.1746688831665526, -- [5]
						0.938752892858307, -- [6]
						0.4380846833338766, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0.938752892858307, -- [12]
						0.3942762150004889, -- [13]
						0.2308375979225746, -- [14]
						0, -- [15]
						0, -- [16]
						0.938752892858307, -- [17]
						0, -- [18]
						0.3504677466671013, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0.1986548887947239, -- [23]
						0.938752892858307, -- [24]
						0.3504677466671013, -- [25]
						0, -- [26]
						0, -- [27]
						0.5082477699186196, -- [28]
						0, -- [29]
						0.8344470158740507, -- [30]
						0, -- [31]
						0.3942762150004889, -- [32]
						0.1797016417310429, -- [33]
						0.938752892858307, -- [34]
						0.4808066321153449, -- [35]
						0, -- [36]
						0.3942762150004889, -- [37]
						0.938752892858307, -- [38]
						0.3942762150004889, -- [39]
						0, -- [40]
						0, -- [41]
						1.043058769842563, -- [42]
						0.3942762150004889, -- [43]
						0.4963395156295837, -- [44]
						0.938752892858307, -- [45]
						0.4380846833338766, -- [46]
						0, -- [47]
						0, -- [48]
						1.043058769842563, -- [49]
						0, -- [50]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [1]
			},
			["level"] = -1,
			["LastDamageAbility"] = "Синий колчедан (УЗВ)",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				0.938752892858307, -- [1]
				nil, -- [2]
				0.3504677466671013, -- [3]
				nil, -- [4]
				nil, -- [5]
				nil, -- [6]
				0.1986548887947239, -- [7]
				0.938752892858307, -- [8]
				0.3504677466671013, -- [9]
				nil, -- [10]
				nil, -- [11]
				0.5082477699186196, -- [12]
				nil, -- [13]
				0.8344470158740507, -- [14]
				nil, -- [15]
				0.3942762150004889, -- [16]
				0.1797016417310429, -- [17]
				0.938752892858307, -- [18]
				0.4808066321153449, -- [19]
				[21] = 0.3942762150004889,
				[22] = 0.938752892858307,
				[23] = 0.3942762150004889,
				[26] = 1.043058769842563,
				[27] = 0.3942762150004889,
				[28] = 0.4963395156295837,
				[29] = 0.938752892858307,
				[30] = 0.4380846833338766,
				[47] = 0.3942762150004889,
				[36] = 0.4380846833338766,
				[40] = 0.938752892858307,
				[46] = 0.938752892858307,
				[48] = 0.2308375979225746,
				[35] = 1.043058769842563,
				[39] = 0.1746688831665526,
				[41] = 0.4380846833338766,
				[33] = 1.043058769842563,
			},
			["type"] = "Boss",
			["FightsSaved"] = 1,
			["LastAbility"] = 198901.626,
			["unit"] = "raid1target",
			["Owner"] = false,
			["TimeLast"] = {
				["DeathCount"] = 1682204516,
				["ActiveTime"] = 1682204516,
				["TimeDamage"] = 1682204516,
				["OVERALL"] = 1682204516,
				["DamageTaken"] = 1682204516,
				["Damage"] = 1682204516,
			},
			["NextEventNum"] = 35,
			["LastEventHealthNum"] = {
				10.77838695307322, -- [1]
				10.77838695307322, -- [2]
				10.42791920640612, -- [3]
				10.42791920640612, -- [4]
				10.42791920640612, -- [5]
				10.42791920640612, -- [6]
				10.2292643176114, -- [7]
				9.290511424753088, -- [8]
				8.940043678085987, -- [9]
				8.940043678085987, -- [10]
				8.940043678085987, -- [11]
				8.431795908167368, -- [12]
				8.431795908167368, -- [13]
				7.597348892293317, -- [14]
				7.597348892293317, -- [15]
				7.203072677292828, -- [16]
				7.023371035561785, -- [17]
				6.084618142703478, -- [18]
				5.603811510588133, -- [19]
				5.603811510588133, -- [20]
				5.209535295587644, -- [21]
				4.270782402729338, -- [22]
				3.876506187728848, -- [23]
				3.876506187728848, -- [24]
				3.876506187728848, -- [25]
				2.833447417886285, -- [26]
				2.439171202885796, -- [27]
				1.942831687256212, -- [28]
				1.004078794397905, -- [29]
				0.5659941110640286, -- [30]
				0.5659941110640286, -- [31]
				0.5659941110640286, -- [32]
				4.346078207677347e-006, -- [33]
				0, -- [34]
				15.27059769440551, -- [35]
				14.83251301107164, -- [36]
				14.83251301107164, -- [37]
				14.83251301107164, -- [38]
				14.65784412790508, -- [39]
				13.71909123504678, -- [40]
				13.2810065517129, -- [41]
				13.2810065517129, -- [42]
				13.2810065517129, -- [43]
				13.2810065517129, -- [44]
				13.2810065517129, -- [45]
				12.34225365885459, -- [46]
				11.9479774438541, -- [47]
				11.71713984593153, -- [48]
				11.71713984593153, -- [49]
				11.71713984593153, -- [50]
			},
			["LastEvents"] = {
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [1]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2615 (Physical)", -- [2]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -80640 (20160 сопрот.)", -- [3]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [4]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [5]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -4079 (Physical)", -- [6]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -45709", -- [7]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [8]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -80640 (20160 сопрот.)", -- [9]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [10]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [11]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -116944", -- [12]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2581 (Physical)", -- [13]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [14]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -3943 (Physical)", -- [15]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [16]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -41348 (10337 сопрот.)", -- [17]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [18]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -110630 (12292 сопрот.)", -- [19]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2562 (Physical)", -- [20]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [21]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [22]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [23]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель Hit -3892 (Physical)", -- [24]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2562 (Physical)", -- [25]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [26]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [27]
				"Трофейный разрушитель <Shamamama> Синий колчедан Огненный Левиафан Hit -114204", -- [28]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [29]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [30]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -2765 (Physical)", -- [31]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2475 (Physical)", -- [32]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [33]
				"Огненный Левиафан умирает.", -- [34]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [35]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [36]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [37]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [38]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -40190 (10047 сопрот.)", -- [39]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [40]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -100800", -- [41]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shamamama> Hit -2475 (Physical)", -- [42]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [43]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [44]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Jacket> Hit -3806 (Physical)", -- [45]
				"Трофейный разрушитель <Shamamama> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [46]
				"Трофейный разрушитель <Jacket> Синий колчедан (УЗВ) Огненный Левиафан Tick -90720 (10080 сопрот.)", -- [47]
				"Трофейный разрушитель <Jacket> Синий колчедан Огненный Левиафан Hit -53114", -- [48]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shamamama> Hit -3000 (Fire)", -- [49]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Jacket> Hit -4500 (Fire)", -- [50]
			},
			["Name"] = "Огненный Левиафан",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				198894.864, -- [1]
				198894.987, -- [2]
				198894.988, -- [3]
				198895.396, -- [4]
				198895.397, -- [5]
				198895.459, -- [6]
				198895.874, -- [7]
				198895.874, -- [8]
				198896.037, -- [9]
				198896.4, -- [10]
				198896.401, -- [11]
				198896.492, -- [12]
				198896.555, -- [13]
				198896.892, -- [14]
				198896.956, -- [15]
				198897.046, -- [16]
				198897.677, -- [17]
				198897.898, -- [18]
				198897.978, -- [19]
				198897.979, -- [20]
				198898.136, -- [21]
				198898.936, -- [22]
				198899.108, -- [23]
				198899.139, -- [24]
				198899.68, -- [25]
				198899.974, -- [26]
				198900.103, -- [27]
				198900.618, -- [28]
				198900.973, -- [29]
				198901.106, -- [30]
				198901.238, -- [31]
				198901.626, -- [32]
				198902.055, -- [33]
				198902.109, -- [34]
				198891.825, -- [35]
				198891.869, -- [36]
				198892.406, -- [37]
				198892.407, -- [38]
				198892.496, -- [39]
				198892.835, -- [40]
				198892.954, -- [41]
				198893.276, -- [42]
				198893.426, -- [43]
				198893.426, -- [44]
				198893.57, -- [45]
				198893.835, -- [46]
				198893.994, -- [47]
				198894.102, -- [48]
				198894.429, -- [49]
				198894.43, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 8,
						},
					},
					["DamageTaken"] = 23119019,
					["ElementTakenResist"] = {
						["Fire"] = 5671,
					},
					["PartialResist"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 48000,
									["min"] = 2016,
									["count"] = 65,
									["amount"] = 1165728,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 1165728,
						},
						["Валун"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 5671,
									["min"] = 5671,
									["count"] = 1,
									["amount"] = 5671,
								},
							},
							["count"] = 8,
							["amount"] = 5671,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 23716,
									["min"] = 4554,
									["count"] = 23,
									["amount"] = 264680,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 52,
							["amount"] = 264680,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 135,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 0,
						},
						["Валун"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 52,
									["amount"] = 0,
								},
							},
							["count"] = 52,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 69.81000000000003,
					["ElementTaken"] = {
						["Fire"] = 301898,
					},
					["Damage"] = 480373,
					["Attacks"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4138,
									["min"] = 2470,
									["count"] = 71,
									["amount"] = 198395,
								},
							},
							["count"] = 71,
							["amount"] = 198395,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4500,
									["min"] = 3000,
									["count"] = 66,
									["amount"] = 214500,
								},
							},
							["count"] = 66,
							["amount"] = 214500,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 67478,
									["min"] = 67478,
									["count"] = 1,
									["amount"] = 67478,
								},
							},
							["count"] = 1,
							["amount"] = 67478,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 66,
								},
							},
							["amount"] = 66,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 72,
								},
							},
							["amount"] = 72,
						},
					},
					["DamagedWho"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 77912,
								},
								["Огненное дыхание"] = {
									["count"] = 84000,
								},
							},
							["amount"] = 161912,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 87226,
								},
								["Огненное дыхание"] = {
									["count"] = 91500,
								},
								["Стенобитный таран"] = {
									["count"] = 67478,
								},
							},
							["amount"] = 246204,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 33257,
								},
								["Огненное дыхание"] = {
									["count"] = 39000,
								},
							},
							["amount"] = 72257,
						},
					},
					["TimeDamage"] = 69.81000000000003,
					["WhoDamaged"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11028000,
								},
								["Валун"] = {
									["count"] = 173085,
								},
								["Синий колчедан"] = {
									["count"] = 2926939,
								},
							},
							["amount"] = 14128024,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 4506384,
								},
								["Валун"] = {
									["count"] = 98520,
								},
								["Синий колчедан"] = {
									["count"] = 1040628,
								},
							},
							["amount"] = 5645532,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 3101328,
								},
								["Валун"] = {
									["count"] = 30293,
								},
								["Синий колчедан"] = {
									["count"] = 213842,
								},
							},
							["amount"] = 3345463,
						},
					},
					["ElementDone"] = {
						["Fire"] = 214500,
						["Physical"] = 265873,
					},
					["TimeSpent"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 22.24,
								},
								["Огненное дыхание"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 29.91,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 19.09,
								},
								["Огненное дыхание"] = {
									["count"] = 9.169999999999998,
								},
								["Стенобитный таран"] = {
									["count"] = 0.36,
								},
							},
							["amount"] = 28.62,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 6.119999999999999,
								},
								["Огненное дыхание"] = {
									["count"] = 5.16,
								},
							},
							["amount"] = 11.28,
						},
					},
					["TimeDamaging"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 22.24,
								},
								["Огненное дыхание"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 29.91,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 19.09,
								},
								["Огненное дыхание"] = {
									["count"] = 9.169999999999998,
								},
								["Стенобитный таран"] = {
									["count"] = 0.36,
								},
							},
							["amount"] = 28.62,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 6.119999999999999,
								},
								["Огненное дыхание"] = {
									["count"] = 5.16,
								},
							},
							["amount"] = 11.28,
						},
					},
				},
				["LastFightData"] = {
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 8,
						},
					},
					["DamageTaken"] = 23119019,
					["ElementTakenResist"] = {
						["Fire"] = 5671,
					},
					["PartialResist"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 48000,
									["min"] = 2016,
									["count"] = 65,
									["amount"] = 1165728,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 1165728,
						},
						["Валун"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 5671,
									["min"] = 5671,
									["count"] = 1,
									["amount"] = 5671,
								},
							},
							["count"] = 8,
							["amount"] = 5671,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 23716,
									["min"] = 4554,
									["count"] = 23,
									["amount"] = 264680,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 52,
							["amount"] = 264680,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 135,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 0,
						},
						["Валун"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 52,
									["amount"] = 0,
								},
							},
							["count"] = 52,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 69.81000000000003,
					["ElementTaken"] = {
						["Fire"] = 301898,
					},
					["Damage"] = 480373,
					["Attacks"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4138,
									["min"] = 2470,
									["count"] = 71,
									["amount"] = 198395,
								},
							},
							["count"] = 71,
							["amount"] = 198395,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4500,
									["min"] = 3000,
									["count"] = 66,
									["amount"] = 214500,
								},
							},
							["count"] = 66,
							["amount"] = 214500,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 67478,
									["min"] = 67478,
									["count"] = 1,
									["amount"] = 67478,
								},
							},
							["count"] = 1,
							["amount"] = 67478,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 66,
								},
							},
							["amount"] = 66,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 72,
								},
							},
							["amount"] = 72,
						},
					},
					["DamagedWho"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 77912,
								},
								["Огненное дыхание"] = {
									["count"] = 84000,
								},
							},
							["amount"] = 161912,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 87226,
								},
								["Огненное дыхание"] = {
									["count"] = 91500,
								},
								["Стенобитный таран"] = {
									["count"] = 67478,
								},
							},
							["amount"] = 246204,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 33257,
								},
								["Огненное дыхание"] = {
									["count"] = 39000,
								},
							},
							["amount"] = 72257,
						},
					},
					["TimeDamage"] = 69.81000000000003,
					["WhoDamaged"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11028000,
								},
								["Валун"] = {
									["count"] = 173085,
								},
								["Синий колчедан"] = {
									["count"] = 2926939,
								},
							},
							["amount"] = 14128024,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 4506384,
								},
								["Валун"] = {
									["count"] = 98520,
								},
								["Синий колчедан"] = {
									["count"] = 1040628,
								},
							},
							["amount"] = 5645532,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 3101328,
								},
								["Валун"] = {
									["count"] = 30293,
								},
								["Синий колчедан"] = {
									["count"] = 213842,
								},
							},
							["amount"] = 3345463,
						},
					},
					["ElementDone"] = {
						["Fire"] = 214500,
						["Physical"] = 265873,
					},
					["TimeSpent"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 22.24,
								},
								["Огненное дыхание"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 29.91,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 19.09,
								},
								["Огненное дыхание"] = {
									["count"] = 9.169999999999998,
								},
								["Стенобитный таран"] = {
									["count"] = 0.36,
								},
							},
							["amount"] = 28.62,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 6.119999999999999,
								},
								["Огненное дыхание"] = {
									["count"] = 5.16,
								},
							},
							["amount"] = 11.28,
						},
					},
					["TimeDamaging"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 22.24,
								},
								["Огненное дыхание"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 29.91,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 19.09,
								},
								["Огненное дыхание"] = {
									["count"] = 9.169999999999998,
								},
								["Стенобитный таран"] = {
									["count"] = 0.36,
								},
							},
							["amount"] = 28.62,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 6.119999999999999,
								},
								["Огненное дыхание"] = {
									["count"] = 5.16,
								},
							},
							["amount"] = 11.28,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 8,
						},
					},
					["DamageTaken"] = 23119019,
					["ElementTakenResist"] = {
						["Fire"] = 5671,
					},
					["PartialResist"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 48000,
									["min"] = 2016,
									["count"] = 65,
									["amount"] = 1165728,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 1165728,
						},
						["Валун"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 5671,
									["min"] = 5671,
									["count"] = 1,
									["amount"] = 5671,
								},
							},
							["count"] = 8,
							["amount"] = 5671,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 23716,
									["min"] = 4554,
									["count"] = 23,
									["amount"] = 264680,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 52,
							["amount"] = 264680,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 135,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 0,
						},
						["Валун"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 52,
									["amount"] = 0,
								},
							},
							["count"] = 52,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 69.81000000000003,
					["ElementTaken"] = {
						["Fire"] = 301898,
					},
					["Damage"] = 480373,
					["Attacks"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4138,
									["min"] = 2470,
									["count"] = 71,
									["amount"] = 198395,
								},
							},
							["count"] = 71,
							["amount"] = 198395,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4500,
									["min"] = 3000,
									["count"] = 66,
									["amount"] = 214500,
								},
							},
							["count"] = 66,
							["amount"] = 214500,
						},
						["Стенобитный таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 67478,
									["min"] = 67478,
									["count"] = 1,
									["amount"] = 67478,
								},
							},
							["count"] = 1,
							["amount"] = 67478,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 66,
								},
							},
							["amount"] = 66,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 72,
								},
							},
							["amount"] = 72,
						},
					},
					["DamagedWho"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 77912,
								},
								["Огненное дыхание"] = {
									["count"] = 84000,
								},
							},
							["amount"] = 161912,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 87226,
								},
								["Огненное дыхание"] = {
									["count"] = 91500,
								},
								["Стенобитный таран"] = {
									["count"] = 67478,
								},
							},
							["amount"] = 246204,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 33257,
								},
								["Огненное дыхание"] = {
									["count"] = 39000,
								},
							},
							["amount"] = 72257,
						},
					},
					["TimeDamage"] = 69.81000000000003,
					["WhoDamaged"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11028000,
								},
								["Валун"] = {
									["count"] = 173085,
								},
								["Синий колчедан"] = {
									["count"] = 2926939,
								},
							},
							["amount"] = 14128024,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 4506384,
								},
								["Валун"] = {
									["count"] = 98520,
								},
								["Синий колчедан"] = {
									["count"] = 1040628,
								},
							},
							["amount"] = 5645532,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 3101328,
								},
								["Валун"] = {
									["count"] = 30293,
								},
								["Синий колчедан"] = {
									["count"] = 213842,
								},
							},
							["amount"] = 3345463,
						},
					},
					["ElementDone"] = {
						["Fire"] = 214500,
						["Physical"] = 265873,
					},
					["TimeSpent"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 22.24,
								},
								["Огненное дыхание"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 29.91,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 19.09,
								},
								["Огненное дыхание"] = {
									["count"] = 9.169999999999998,
								},
								["Стенобитный таран"] = {
									["count"] = 0.36,
								},
							},
							["amount"] = 28.62,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 6.119999999999999,
								},
								["Огненное дыхание"] = {
									["count"] = 5.16,
								},
							},
							["amount"] = 11.28,
						},
					},
					["TimeDamaging"] = {
						["Трофейный разрушитель <Shamamama>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 22.24,
								},
								["Огненное дыхание"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 29.91,
						},
						["Трофейный разрушитель <Jacket>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 19.09,
								},
								["Огненное дыхание"] = {
									["count"] = 9.169999999999998,
								},
								["Стенобитный таран"] = {
									["count"] = 0.36,
								},
							},
							["amount"] = 28.62,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 6.119999999999999,
								},
								["Огненное дыхание"] = {
									["count"] = 5.16,
								},
							},
							["amount"] = 11.28,
						},
					},
				},
			},
			["UnitLockout"] = 1682204512,
			["LastActive"] = 1682204516,
		},
		["Jacket"] = {
			["GUID"] = "0x0700000000848E0F",
			["type"] = "Self",
			["FightsSaved"] = 1,
			["Owner"] = false,
			["enClass"] = "WARRIOR",
			["Name"] = "Jacket",
			["Pet"] = {
				"Трофейный разрушитель <Jacket>", -- [1]
				"Механическое сиденье в трофейном разрушителе <Jacket>", -- [2]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
			},
			["level"] = 80,
			["UnitLockout"] = 1682203974,
			["LastFightIn"] = 0,
		},
		["Механическое сиденье в трофейном разрушителе <Jacket>"] = {
			["GUID"] = "0xF15000818F000010",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"???", -- [4]
				"???", -- [5]
				"???", -- [6]
				"???", -- [7]
				"???", -- [8]
				"???", -- [9]
				"???", -- [10]
				"???", -- [11]
				"???", -- [12]
				"???", -- [13]
				"???", -- [14]
				"???", -- [15]
				"???", -- [16]
				"???", -- [17]
				"???", -- [18]
				"???", -- [19]
				"???", -- [20]
				"???", -- [21]
				"???", -- [22]
				"???", -- [23]
				"???", -- [24]
				"???", -- [25]
				"???", -- [26]
				"???", -- [27]
				"???", -- [28]
				"???", -- [29]
				"???", -- [30]
				"???", -- [31]
				"???", -- [32]
				"???", -- [33]
				"???", -- [34]
				"???", -- [35]
				"???", -- [36]
				"???", -- [37]
				"???", -- [38]
				"???", -- [39]
				"???", -- [40]
				"???", -- [41]
				"???", -- [42]
				"???", -- [43]
				"???", -- [44]
				"???", -- [45]
				"???", -- [46]
				"???", -- [47]
				"???", -- [48]
				"???", -- [49]
				"???", -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["Damage"] = {
					331777, -- [1]
				},
				["TimeDamage"] = {
					83.76000000000002, -- [1]
				},
				["ActiveTime"] = {
					83.76000000000002, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["TimeLast"] = {
				["Damage"] = 1682204410,
				["OVERALL"] = 1682204410,
				["TimeDamage"] = 1682204410,
				["ActiveTime"] = 1682204410,
			},
			["Owner"] = "Jacket",
			["LastAbility"] = 198796.688,
			["NextEventNum"] = 11,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				0, -- [4]
				0, -- [5]
				0, -- [6]
				0, -- [7]
				0, -- [8]
				0, -- [9]
				0, -- [10]
				0, -- [11]
				0, -- [12]
				0, -- [13]
				0, -- [14]
				0, -- [15]
				0, -- [16]
				0, -- [17]
				0, -- [18]
				0, -- [19]
				0, -- [20]
				0, -- [21]
				0, -- [22]
				0, -- [23]
				0, -- [24]
				0, -- [25]
				0, -- [26]
				0, -- [27]
				0, -- [28]
				0, -- [29]
				0, -- [30]
				0, -- [31]
				0, -- [32]
				0, -- [33]
				0, -- [34]
				0, -- [35]
				0, -- [36]
				0, -- [37]
				0, -- [38]
				0, -- [39]
				0, -- [40]
				0, -- [41]
				0, -- [42]
				0, -- [43]
				0, -- [44]
				0, -- [45]
				0, -- [46]
				0, -- [47]
				0, -- [48]
				0, -- [49]
				0, -- [50]
			},
			["LastEvents"] = {
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5601", -- [1]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5875", -- [2]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5622", -- [3]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5354", -- [4]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5386", -- [5]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5240", -- [6]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5748", -- [7]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5770", -- [8]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5376", -- [9]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5872", -- [10]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Кованый защитник Hit -5638", -- [11]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Кованый защитник Hit -5540", -- [12]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Кованый защитник Hit -5586", -- [13]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5334", -- [14]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5320", -- [15]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5595", -- [16]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5633", -- [17]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5674", -- [18]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5427", -- [19]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5332", -- [20]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5382", -- [21]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5744", -- [22]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5793", -- [23]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5778", -- [24]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5224", -- [25]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5621", -- [26]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5523", -- [27]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5651", -- [28]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5844", -- [29]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5480", -- [30]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5827", -- [31]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5465", -- [32]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5625", -- [33]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5642", -- [34]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5754", -- [35]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5531", -- [36]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5387", -- [37]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5429", -- [38]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5475", -- [39]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5619", -- [40]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5363", -- [41]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5297", -- [42]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5511", -- [43]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5376", -- [44]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5541", -- [45]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5336", -- [46]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5402", -- [47]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5522", -- [48]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5229", -- [49]
				"Механическое сиденье в трофейном разрушителе <Jacket> Противовоздушная ракета Механолифт 304-А Hit -5836", -- [50]
			},
			["Name"] = "Механическое сиденье в трофейном разрушителе",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				198781.357, -- [1]
				198781.994, -- [2]
				198781.996, -- [3]
				198786.274, -- [4]
				198787.798, -- [5]
				198788.493, -- [6]
				198796.273, -- [7]
				198796.274, -- [8]
				198796.687, -- [9]
				198796.688, -- [10]
				198645.417, -- [11]
				198648.879, -- [12]
				198648.881, -- [13]
				198719.436, -- [14]
				198721.601, -- [15]
				198723.444, -- [16]
				198725.497, -- [17]
				198726.064, -- [18]
				198726.46, -- [19]
				198727.018, -- [20]
				198729.263, -- [21]
				198729.263, -- [22]
				198729.87, -- [23]
				198729.871, -- [24]
				198735.221, -- [25]
				198735.693, -- [26]
				198740.074, -- [27]
				198743.203, -- [28]
				198747.651, -- [29]
				198748.401, -- [30]
				198750.812, -- [31]
				198752.588, -- [32]
				198753.771, -- [33]
				198755.212, -- [34]
				198755.213, -- [35]
				198755.599, -- [36]
				198755.6, -- [37]
				198760.466, -- [38]
				198764.067, -- [39]
				198764.402, -- [40]
				198766.103, -- [41]
				198766.257, -- [42]
				198766.829, -- [43]
				198772.904, -- [44]
				198772.943, -- [45]
				198775.985, -- [46]
				198776.532, -- [47]
				198778.792, -- [48]
				198779.439, -- [49]
				198781.356, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["Attacks"] = {
						["Противовоздушная ракета"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 5827,
									["min"] = 5601,
									["count"] = 3,
									["amount"] = 17066,
								},
								["Hit"] = {
									["max"] = 5875,
									["min"] = 5211,
									["count"] = 57,
									["amount"] = 314711,
								},
							},
							["count"] = 60,
							["amount"] = 331777,
						},
					},
					["DamagedWho"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 260366,
								},
							},
							["amount"] = 260366,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 71411,
								},
							},
							["amount"] = 71411,
						},
					},
					["ActiveTime"] = 83.76000000000002,
					["TimeDamaging"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 67.95999999999999,
								},
							},
							["amount"] = 67.95999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 15.8,
								},
							},
							["amount"] = 15.8,
						},
					},
					["TimeSpent"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 67.95999999999999,
								},
							},
							["amount"] = 67.95999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 15.8,
								},
							},
							["amount"] = 15.8,
						},
					},
					["TimeDamage"] = 83.76000000000002,
					["Damage"] = 331777,
				},
				["LastFightData"] = {
					["Attacks"] = {
						["Противовоздушная ракета"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 5827,
									["min"] = 5601,
									["count"] = 3,
									["amount"] = 17066,
								},
								["Hit"] = {
									["max"] = 5875,
									["min"] = 5211,
									["count"] = 57,
									["amount"] = 314711,
								},
							},
							["count"] = 60,
							["amount"] = 331777,
						},
					},
					["DamagedWho"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 260366,
								},
							},
							["amount"] = 260366,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 71411,
								},
							},
							["amount"] = 71411,
						},
					},
					["ActiveTime"] = 83.76000000000002,
					["TimeDamaging"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 67.95999999999999,
								},
							},
							["amount"] = 67.95999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 15.8,
								},
							},
							["amount"] = 15.8,
						},
					},
					["TimeSpent"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 67.95999999999999,
								},
							},
							["amount"] = 67.95999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 15.8,
								},
							},
							["amount"] = 15.8,
						},
					},
					["TimeDamage"] = 83.76000000000002,
					["Damage"] = 331777,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Attacks"] = {
						["Противовоздушная ракета"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 5827,
									["min"] = 5601,
									["count"] = 3,
									["amount"] = 17066,
								},
								["Hit"] = {
									["max"] = 5875,
									["min"] = 5211,
									["count"] = 57,
									["amount"] = 314711,
								},
							},
							["count"] = 60,
							["amount"] = 331777,
						},
					},
					["DamagedWho"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 260366,
								},
							},
							["amount"] = 260366,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 71411,
								},
							},
							["amount"] = 71411,
						},
					},
					["ActiveTime"] = 83.76000000000002,
					["TimeDamaging"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 67.95999999999999,
								},
							},
							["amount"] = 67.95999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 15.8,
								},
							},
							["amount"] = 15.8,
						},
					},
					["TimeSpent"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 67.95999999999999,
								},
							},
							["amount"] = 67.95999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 15.8,
								},
							},
							["amount"] = 15.8,
						},
					},
					["TimeDamage"] = 83.76000000000002,
					["Damage"] = 331777,
				},
			},
			["UnitLockout"] = 1682204410,
			["LastActive"] = 1682204410,
		},
	},
	["FightNum"] = 1,
	["CombatTimes"] = {
		{
			1682203972, -- [1]
			1682204517, -- [2]
			"04:52:53", -- [3]
			"05:01:57", -- [4]
			"Огненный Левиафан", -- [5]
		}, -- [1]
	},
	["FoughtWho"] = {
		"Огненный Левиафан 04:52:53-05:01:57", -- [1]
	},
}
