
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["Marazzm"] = {
			["GUID"] = "0x07000000008520A2",
			["type"] = "Grouped",
			["FightsSaved"] = 1,
			["Owner"] = false,
			["enClass"] = "DEATHKNIGHT",
			["unit"] = "Marazzm",
			["Name"] = "Marazzm",
			["Pet"] = {
				"Трофейный разрушитель <Marazzm>", -- [1]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
			},
			["level"] = 80,
			["UnitLockout"] = 1682203052,
			["LastFightIn"] = 0,
		},
		["Shephard"] = {
			["GUID"] = "0x07000000006BB84D",
			["type"] = "Self",
			["FightsSaved"] = 1,
			["Owner"] = false,
			["enClass"] = "DEATHKNIGHT",
			["Name"] = "Shephard",
			["Pet"] = {
				"Трофейный разрушитель <Shephard>", -- [1]
				"Механическое сиденье в трофейном разрушителе <Shephard>", -- [2]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
			},
			["level"] = 80,
			["UnitLockout"] = 1682202979,
			["LastFightIn"] = 0,
		},
		["Огненный Левиафан"] = {
			["GUID"] = "0xF1500081590002ED",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"???", -- [4]
				"???", -- [5]
				"???", -- [6]
				"???", -- [7]
				"???", -- [8]
				"???", -- [9]
				"???", -- [10]
				"???", -- [11]
				"2870572 (12%)", -- [12]
				"2870572 (12%)", -- [13]
				"2630572 (11%)", -- [14]
				"2630572 (11%)", -- [15]
				"2630572 (11%)", -- [16]
				"2630572 (11%)", -- [17]
				"2534572 (11%)", -- [18]
				"2342572 (10%)", -- [19]
				"2342572 (10%)", -- [20]
				"2342572 (10%)", -- [21]
				"2222572 (9%)", -- [22]
				"2222572 (9%)", -- [23]
				"2222572 (9%)", -- [24]
				"2006572 (8%)", -- [25]
				"2006572 (8%)", -- [26]
				"2006572 (8%)", -- [27]
				"1912541 (8%)", -- [28]
				"1816541 (7%)", -- [29]
				"1576541 (6%)", -- [30]
				"1576541 (6%)", -- [31]
				"1456541 (6%)", -- [32]
				"1329744 (5%)", -- [33]
				"1089744 (4%)", -- [34]
				"1089744 (4%)", -- [35]
				"969744 (4%)", -- [36]
				"850720 (3%)", -- [37]
				"850720 (3%)", -- [38]
				"610720 (2%)", -- [39]
				"492734 (2%)", -- [40]
				"252734 (1%)", -- [41]
				"60734 (0%)", -- [42]
				"0 (0%)", -- [43]
				"???", -- [44]
				"???", -- [45]
				"???", -- [46]
				"???", -- [47]
				"???", -- [48]
				"???", -- [49]
				"???", -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"MISC", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					48.12, -- [1]
				},
				["TimeDamage"] = {
					48.12, -- [1]
				},
				["DamageTaken"] = {
					22948516, -- [1]
				},
				["Damage"] = {
					255043, -- [1]
				},
			},
			["enClass"] = "MOB",
			["LastDamageTaken"] = 192000,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						false, -- [22]
						false, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						false, -- [28]
						true, -- [29]
						false, -- [30]
						false, -- [31]
						true, -- [32]
						false, -- [33]
						false, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						false, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						false, -- [42]
						true, -- [43]
						true, -- [44]
						false, -- [45]
						true, -- [46]
						true, -- [47]
						true, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [1]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -108000 (12000 сопрот.)", -- [2]
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [3]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [4]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [5]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2479 (Physical)", -- [6]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -108000 (12000 сопрот.)", -- [7]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель Hit -2532 (Physical)", -- [8]
						"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -112892", -- [9]
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [10]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [11]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [12]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [13]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2471 (Physical)", -- [14]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [15]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [16]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [17]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [18]
						"Трофейный разрушитель Синий колчедан Огненный Левиафан Hit -55212 (6134 сопрот.)", -- [19]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель Hit -2591 (Physical)", -- [20]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [21]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [22]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [23]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2670 (Physical)", -- [24]
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -96000 (24000 сопрот.)", -- [25]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [26]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [27]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [28]
						"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [29]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2685 (Physical)", -- [30]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2757 (Physical)", -- [31]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [32]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [33]
						"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [34]
						"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -94031 (23507 сопрот.)", -- [35]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -96000 (24000 сопрот.)", -- [36]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [37]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2499 (Physical)", -- [38]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [39]
						"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -126797", -- [40]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [41]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2741 (Physical)", -- [42]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [43]
						"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -119024", -- [44]
						"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2510 (Physical)", -- [45]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [46]
						"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -117986", -- [47]
						"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [48]
						"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [49]
						"Огненный Левиафан умирает.", -- [50]
					},
					["DeathAt"] = 1682203475,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						12.47573041276878, -- [19]
						12.47573041276878, -- [20]
						11.43267164292622, -- [21]
						11.43267164292622, -- [22]
						11.43267164292622, -- [23]
						11.43267164292622, -- [24]
						11.01544813498919, -- [25]
						10.18100111911514, -- [26]
						10.18100111911514, -- [27]
						10.18100111911514, -- [28]
						9.659471734193858, -- [29]
						9.659471734193858, -- [30]
						9.659471734193858, -- [31]
						8.72071884133555, -- [32]
						8.72071884133555, -- [33]
						8.72071884133555, -- [34]
						8.312052761389442, -- [35]
						7.894829253452416, -- [36]
						6.851770483609853, -- [37]
						6.851770483609853, -- [38]
						6.330241098688571, -- [39]
						5.779171420189706, -- [40]
						4.736112650347143, -- [41]
						4.736112650347143, -- [42]
						4.214583265425861, -- [43]
						3.697295652835273, -- [44]
						3.697295652835273, -- [45]
						2.65423688299271, -- [46]
						2.14146049958169, -- [47]
						1.098401729739127, -- [48]
						0.263954713865076, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-10.29899999999907, -- [1]
						-9.869000000006054, -- [2]
						-9.358000000007451, -- [3]
						-9.225999999995111, -- [4]
						-9.225999999995111, -- [5]
						-9.186000000016065, -- [6]
						-8.901000000012573, -- [7]
						-8.817000000010012, -- [8]
						-8.504000000015367, -- [9]
						-8.371000000013737, -- [10]
						-8.271999999997206, -- [11]
						-8.271999999997206, -- [12]
						-7.88100000002305, -- [13]
						-7.377000000007683, -- [14]
						-7.375, -- [15]
						-7.290999999997439, -- [16]
						-7.290999999997439, -- [17]
						-6.887000000016997, -- [18]
						-6.664000000018859, -- [19]
						-6.62400000001071, -- [20]
						-6.40600000001723, -- [21]
						-6.320000000006985, -- [22]
						-6.320000000006985, -- [23]
						-6.064000000013039, -- [24]
						-5.801000000006752, -- [25]
						-5.403000000020256, -- [26]
						-5.305000000022119, -- [27]
						-5.303000000014436, -- [28]
						-4.798999999999069, -- [29]
						-4.670000000012806, -- [30]
						-4.352000000013504, -- [31]
						-4.350999999995111, -- [32]
						-4.262000000016997, -- [33]
						-4.260999999998603, -- [34]
						-4.216000000014901, -- [35]
						-3.823000000003958, -- [36]
						-3.341000000014901, -- [37]
						-2.899000000004889, -- [38]
						-2.798000000009779, -- [39]
						-2.664000000018859, -- [40]
						-2.290999999997439, -- [41]
						-2.044000000023516, -- [42]
						-1.812000000005355, -- [43]
						-1.535000000003493, -- [44]
						-1.336999999999534, -- [45]
						-1.304000000003725, -- [46]
						-0.9180000000051223, -- [47]
						-0.7119999999995343, -- [48]
						-0.1940000000176951, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "Трофейный разрушитель <Shephard>",
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
						"???", -- [3]
						"???", -- [4]
						"???", -- [5]
						"???", -- [6]
						"???", -- [7]
						"???", -- [8]
						"???", -- [9]
						"???", -- [10]
						"???", -- [11]
						"???", -- [12]
						"???", -- [13]
						"???", -- [14]
						"???", -- [15]
						"???", -- [16]
						"???", -- [17]
						"???", -- [18]
						"2870572 (12%)", -- [19]
						"2870572 (12%)", -- [20]
						"2630572 (11%)", -- [21]
						"2630572 (11%)", -- [22]
						"2630572 (11%)", -- [23]
						"2630572 (11%)", -- [24]
						"2534572 (11%)", -- [25]
						"2342572 (10%)", -- [26]
						"2342572 (10%)", -- [27]
						"2342572 (10%)", -- [28]
						"2222572 (9%)", -- [29]
						"2222572 (9%)", -- [30]
						"2222572 (9%)", -- [31]
						"2006572 (8%)", -- [32]
						"2006572 (8%)", -- [33]
						"2006572 (8%)", -- [34]
						"1912541 (8%)", -- [35]
						"1816541 (7%)", -- [36]
						"1576541 (6%)", -- [37]
						"1576541 (6%)", -- [38]
						"1456541 (6%)", -- [39]
						"1329744 (5%)", -- [40]
						"1089744 (4%)", -- [41]
						"1089744 (4%)", -- [42]
						"969744 (4%)", -- [43]
						"850720 (3%)", -- [44]
						"850720 (3%)", -- [45]
						"610720 (2%)", -- [46]
						"492734 (2%)", -- [47]
						"252734 (1%)", -- [48]
						"60734 (0%)", -- [49]
						"0 (0%)", -- [50]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0.2399556700022817, -- [19]
						0, -- [20]
						1.043058769842563, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0.4172235079370253, -- [25]
						0.8344470158740507, -- [26]
						0, -- [27]
						0, -- [28]
						0.5215293849212817, -- [29]
						0, -- [30]
						0, -- [31]
						0.938752892858307, -- [32]
						0, -- [33]
						0, -- [34]
						0.4086660799461087, -- [35]
						0.4172235079370253, -- [36]
						1.043058769842563, -- [37]
						0, -- [38]
						0.5215293849212817, -- [39]
						0.5510696784988646, -- [40]
						1.043058769842563, -- [41]
						0, -- [42]
						0.5215293849212817, -- [43]
						0.5172876125905885, -- [44]
						0, -- [45]
						1.043058769842563, -- [46]
						0.5127763834110195, -- [47]
						1.043058769842563, -- [48]
						0.8344470158740507, -- [49]
						0, -- [50]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [1]
			},
			["level"] = -1,
			["LastDamageAbility"] = "Синий колчедан (УЗВ)",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				[14] = 1.043058769842563,
				[29] = 0.4172235079370253,
				[30] = 1.043058769842563,
				[32] = 0.5215293849212817,
				[33] = 0.5510696784988646,
				[34] = 1.043058769842563,
				[18] = 0.4172235079370253,
				[37] = 0.5172876125905885,
				[19] = 0.8344470158740507,
				[39] = 1.043058769842563,
				[40] = 0.5127763834110195,
				[41] = 1.043058769842563,
				[42] = 0.8344470158740507,
				[22] = 0.5215293849212817,
				[12] = 0.2399556700022817,
				[25] = 0.938752892858307,
				[28] = 0.4086660799461087,
				[36] = 0.5215293849212817,
			},
			["type"] = "Boss",
			["FightsSaved"] = 1,
			["LastAbility"] = 197857.621,
			["unit"] = "raid2target",
			["Owner"] = false,
			["TimeLast"] = {
				["DeathCount"] = 1682203473,
				["ActiveTime"] = 1682203471,
				["TimeDamage"] = 1682203471,
				["OVERALL"] = 1682203473,
				["DamageTaken"] = 1682203473,
				["Damage"] = 1682203471,
			},
			["NextEventNum"] = 44,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				0, -- [4]
				0, -- [5]
				0, -- [6]
				0, -- [7]
				0, -- [8]
				0, -- [9]
				0, -- [10]
				0, -- [11]
				12.47573041276878, -- [12]
				12.47573041276878, -- [13]
				11.43267164292622, -- [14]
				11.43267164292622, -- [15]
				11.43267164292622, -- [16]
				11.43267164292622, -- [17]
				11.01544813498919, -- [18]
				10.18100111911514, -- [19]
				10.18100111911514, -- [20]
				10.18100111911514, -- [21]
				9.659471734193858, -- [22]
				9.659471734193858, -- [23]
				9.659471734193858, -- [24]
				8.72071884133555, -- [25]
				8.72071884133555, -- [26]
				8.72071884133555, -- [27]
				8.312052761389442, -- [28]
				7.894829253452416, -- [29]
				6.851770483609853, -- [30]
				6.851770483609853, -- [31]
				6.330241098688571, -- [32]
				5.779171420189706, -- [33]
				4.736112650347143, -- [34]
				4.736112650347143, -- [35]
				4.214583265425861, -- [36]
				3.697295652835273, -- [37]
				3.697295652835273, -- [38]
				2.65423688299271, -- [39]
				2.14146049958169, -- [40]
				1.098401729739127, -- [41]
				0.263954713865076, -- [42]
				0, -- [43]
				0, -- [44]
				0, -- [45]
				0, -- [46]
				0, -- [47]
				0, -- [48]
				0, -- [49]
				0, -- [50]
			},
			["LastEvents"] = {
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель Hit -2532 (Physical)", -- [1]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -112892", -- [2]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [3]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [4]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [5]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [6]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2471 (Physical)", -- [7]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [8]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [9]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [10]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [11]
				"Трофейный разрушитель Синий колчедан Огненный Левиафан Hit -55212 (6134 сопрот.)", -- [12]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель Hit -2591 (Physical)", -- [13]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [14]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [15]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [16]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2670 (Physical)", -- [17]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -96000 (24000 сопрот.)", -- [18]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [19]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [20]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [21]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [22]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2685 (Physical)", -- [23]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2757 (Physical)", -- [24]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [25]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [26]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [27]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -94031 (23507 сопрот.)", -- [28]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -96000 (24000 сопрот.)", -- [29]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [30]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2499 (Physical)", -- [31]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [32]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -126797", -- [33]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [34]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2741 (Physical)", -- [35]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [36]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -119024", -- [37]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2510 (Physical)", -- [38]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [39]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -117986", -- [40]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [41]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [42]
				"Огненный Левиафан умирает.", -- [43]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [44]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -108000 (12000 сопрот.)", -- [45]
				"Трофейный разрушитель Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [46]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель Hit -3000 (Fire)", -- [47]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [48]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2479 (Physical)", -- [49]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -108000 (12000 сопрот.)", -- [50]
			},
			["Name"] = "Огненный Левиафан",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				false, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				197850.141, -- [1]
				197850.454, -- [2]
				197850.587, -- [3]
				197850.686, -- [4]
				197850.686, -- [5]
				197851.077, -- [6]
				197851.581, -- [7]
				197851.583, -- [8]
				197851.667, -- [9]
				197851.667, -- [10]
				197852.071, -- [11]
				197852.294, -- [12]
				197852.334, -- [13]
				197852.552, -- [14]
				197852.638, -- [15]
				197852.638, -- [16]
				197852.894, -- [17]
				197853.157, -- [18]
				197853.555, -- [19]
				197853.653, -- [20]
				197853.655, -- [21]
				197854.159, -- [22]
				197854.288, -- [23]
				197854.606, -- [24]
				197854.607, -- [25]
				197854.696, -- [26]
				197854.697, -- [27]
				197854.742, -- [28]
				197855.135, -- [29]
				197855.617, -- [30]
				197856.059, -- [31]
				197856.16, -- [32]
				197856.294, -- [33]
				197856.667, -- [34]
				197856.914, -- [35]
				197857.146, -- [36]
				197857.423, -- [37]
				197857.621, -- [38]
				197857.654, -- [39]
				197858.04, -- [40]
				197858.246, -- [41]
				197858.764, -- [42]
				197858.958, -- [43]
				197848.659, -- [44]
				197849.089, -- [45]
				197849.6, -- [46]
				197849.732, -- [47]
				197849.732, -- [48]
				197849.772, -- [49]
				197850.057, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["Attacks"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2768,
									["min"] = 2470,
									["count"] = 47,
									["amount"] = 123043,
								},
							},
							["count"] = 47,
							["amount"] = 123043,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 3000,
									["min"] = 3000,
									["count"] = 44,
									["amount"] = 132000,
								},
							},
							["count"] = 44,
							["amount"] = 132000,
						},
					},
					["PartialBlock"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 2,
									["amount"] = 82,
								},
							},
							["count"] = 2,
							["amount"] = 82,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 44,
								},
							},
							["amount"] = 44,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 47,
								},
							},
							["amount"] = 47,
						},
					},
					["DamagedWho"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 52580,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 103580,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 20860,
								},
								["Огненное дыхание"] = {
									["count"] = 30000,
								},
							},
							["amount"] = 50860,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 49603,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 100603,
						},
					},
					["TimeSpent"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 17.67,
								},
								["Огненное дыхание"] = {
									["count"] = 0,
								},
							},
							["amount"] = 17.67,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 4.83,
								},
								["Огненное дыхание"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 7.510000000000001,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 15.42,
								},
								["Огненное дыхание"] = {
									["count"] = 7.52,
								},
							},
							["amount"] = 22.94000000000001,
						},
					},
					["DamageTaken"] = 22948516,
					["ElementDone"] = {
						["Fire"] = 132000,
						["Physical"] = 123043,
					},
					["PartialResist"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 62,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 48000,
									["min"] = 4800,
									["count"] = 43,
									["amount"] = 1075200,
								},
							},
							["count"] = 105,
							["amount"] = 1075200,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 31,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 26196,
									["min"] = 6134,
									["count"] = 15,
									["amount"] = 271073,
								},
							},
							["count"] = 46,
							["amount"] = 271073,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 105,
									["amount"] = 0,
								},
							},
							["count"] = 105,
							["amount"] = 0,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 46,
									["amount"] = 0,
								},
							},
							["count"] = 46,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 48.12,
					["WhoDamaged"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7504800,
								},
								["Синий колчедан"] = {
									["count"] = 2358961,
								},
							},
							["amount"] = 9863761,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 231917,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 2503200,
								},
							},
							["amount"] = 2735117,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7924800,
								},
								["Синий колчедан"] = {
									["count"] = 2424838,
								},
							},
							["amount"] = 10349638,
						},
					},
					["TimeDamage"] = 48.12,
					["TimeDamaging"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 17.67,
								},
								["Огненное дыхание"] = {
									["count"] = 0,
								},
							},
							["amount"] = 17.67,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 4.83,
								},
								["Огненное дыхание"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 7.510000000000001,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 15.42,
								},
								["Огненное дыхание"] = {
									["count"] = 7.52,
								},
							},
							["amount"] = 22.94000000000001,
						},
					},
					["Damage"] = 255043,
				},
				["LastFightData"] = {
					["Attacks"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2768,
									["min"] = 2470,
									["count"] = 47,
									["amount"] = 123043,
								},
							},
							["count"] = 47,
							["amount"] = 123043,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 3000,
									["min"] = 3000,
									["count"] = 44,
									["amount"] = 132000,
								},
							},
							["count"] = 44,
							["amount"] = 132000,
						},
					},
					["PartialBlock"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 2,
									["amount"] = 82,
								},
							},
							["count"] = 2,
							["amount"] = 82,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 44,
								},
							},
							["amount"] = 44,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 47,
								},
							},
							["amount"] = 47,
						},
					},
					["DamagedWho"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 52580,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 103580,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 20860,
								},
								["Огненное дыхание"] = {
									["count"] = 30000,
								},
							},
							["amount"] = 50860,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 49603,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 100603,
						},
					},
					["TimeSpent"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 17.67,
								},
								["Огненное дыхание"] = {
									["count"] = 0,
								},
							},
							["amount"] = 17.67,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 4.83,
								},
								["Огненное дыхание"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 7.510000000000001,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 15.42,
								},
								["Огненное дыхание"] = {
									["count"] = 7.52,
								},
							},
							["amount"] = 22.94000000000001,
						},
					},
					["DamageTaken"] = 22948516,
					["ElementDone"] = {
						["Fire"] = 132000,
						["Physical"] = 123043,
					},
					["PartialResist"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 62,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 48000,
									["min"] = 4800,
									["count"] = 43,
									["amount"] = 1075200,
								},
							},
							["count"] = 105,
							["amount"] = 1075200,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 31,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 26196,
									["min"] = 6134,
									["count"] = 15,
									["amount"] = 271073,
								},
							},
							["count"] = 46,
							["amount"] = 271073,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 105,
									["amount"] = 0,
								},
							},
							["count"] = 105,
							["amount"] = 0,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 46,
									["amount"] = 0,
								},
							},
							["count"] = 46,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 48.12,
					["WhoDamaged"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7504800,
								},
								["Синий колчедан"] = {
									["count"] = 2358961,
								},
							},
							["amount"] = 9863761,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 231917,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 2503200,
								},
							},
							["amount"] = 2735117,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7924800,
								},
								["Синий колчедан"] = {
									["count"] = 2424838,
								},
							},
							["amount"] = 10349638,
						},
					},
					["TimeDamage"] = 48.12,
					["TimeDamaging"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 17.67,
								},
								["Огненное дыхание"] = {
									["count"] = 0,
								},
							},
							["amount"] = 17.67,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 4.83,
								},
								["Огненное дыхание"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 7.510000000000001,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 15.42,
								},
								["Огненное дыхание"] = {
									["count"] = 7.52,
								},
							},
							["amount"] = 22.94000000000001,
						},
					},
					["Damage"] = 255043,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Attacks"] = {
						["Заградительные стрелы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2768,
									["min"] = 2470,
									["count"] = 47,
									["amount"] = 123043,
								},
							},
							["count"] = 47,
							["amount"] = 123043,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 3000,
									["min"] = 3000,
									["count"] = 44,
									["amount"] = 132000,
								},
							},
							["count"] = 44,
							["amount"] = 132000,
						},
					},
					["PartialBlock"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 2,
									["amount"] = 82,
								},
							},
							["count"] = 2,
							["amount"] = 82,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 44,
								},
							},
							["amount"] = 44,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 47,
								},
							},
							["amount"] = 47,
						},
					},
					["DamagedWho"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 52580,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 103580,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 20860,
								},
								["Огненное дыхание"] = {
									["count"] = 30000,
								},
							},
							["amount"] = 50860,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 49603,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 100603,
						},
					},
					["TimeSpent"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 17.67,
								},
								["Огненное дыхание"] = {
									["count"] = 0,
								},
							},
							["amount"] = 17.67,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 4.83,
								},
								["Огненное дыхание"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 7.510000000000001,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 15.42,
								},
								["Огненное дыхание"] = {
									["count"] = 7.52,
								},
							},
							["amount"] = 22.94000000000001,
						},
					},
					["DamageTaken"] = 22948516,
					["ElementDone"] = {
						["Fire"] = 132000,
						["Physical"] = 123043,
					},
					["PartialResist"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 62,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 48000,
									["min"] = 4800,
									["count"] = 43,
									["amount"] = 1075200,
								},
							},
							["count"] = 105,
							["amount"] = 1075200,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 31,
									["amount"] = 0,
								},
								["25%Сопротив."] = {
									["max"] = 26196,
									["min"] = 6134,
									["count"] = 15,
									["amount"] = 271073,
								},
							},
							["count"] = 46,
							["amount"] = 271073,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 105,
									["amount"] = 0,
								},
							},
							["count"] = 105,
							["amount"] = 0,
						},
						["Синий колчедан"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 46,
									["amount"] = 0,
								},
							},
							["count"] = 46,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 48.12,
					["WhoDamaged"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7504800,
								},
								["Синий колчедан"] = {
									["count"] = 2358961,
								},
							},
							["amount"] = 9863761,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 231917,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 2503200,
								},
							},
							["amount"] = 2735117,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7924800,
								},
								["Синий колчедан"] = {
									["count"] = 2424838,
								},
							},
							["amount"] = 10349638,
						},
					},
					["TimeDamage"] = 48.12,
					["TimeDamaging"] = {
						["Трофейный разрушитель <Marazzm>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 17.67,
								},
								["Огненное дыхание"] = {
									["count"] = 0,
								},
							},
							["amount"] = 17.67,
						},
						["Трофейный разрушитель"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 4.83,
								},
								["Огненное дыхание"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 7.510000000000001,
						},
						["Трофейный разрушитель <Shephard>"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 15.42,
								},
								["Огненное дыхание"] = {
									["count"] = 7.52,
								},
							},
							["amount"] = 22.94000000000001,
						},
					},
					["Damage"] = 255043,
				},
			},
			["UnitLockout"] = 1682203466,
			["LastActive"] = 1682203473,
		},
		["Трофейный разрушитель <Marazzm>"] = {
			["GUID"] = "0xF15000815500000E",
			["LastEventHealth"] = {
				"770183 (61%)", -- [1]
				"770183 (61%)", -- [2]
				"761562 (60%)", -- [3]
				"758562 (60%)", -- [4]
				"758562 (60%)", -- [5]
				"752826 (59%)", -- [6]
				"752826 (59%)", -- [7]
				"931192 (73%)", -- [8]
				"928713 (73%)", -- [9]
				"928713 (73%)", -- [10]
				"928713 (73%)", -- [11]
				"925713 (73%)", -- [12]
				"925713 (73%)", -- [13]
				"730291 (57%)", -- [14]
				"730291 (57%)", -- [15]
				"721621 (57%)", -- [16]
				"715864 (56%)", -- [17]
				"715864 (56%)", -- [18]
				"713365 (56%)", -- [19]
				"713365 (56%)", -- [20]
				"713365 (56%)", -- [21]
				"713365 (56%)", -- [22]
				"710855 (56%)", -- [23]
				"803640 (63%)", -- [24]
				"803640 (63%)", -- [25]
				"800640 (63%)", -- [26]
				"800640 (63%)", -- [27]
				"794903 (63%)", -- [28]
				"794903 (63%)", -- [29]
				"794903 (63%)", -- [30]
				"794903 (63%)", -- [31]
				"791903 (62%)", -- [32]
				"791903 (62%)", -- [33]
				"786295 (62%)", -- [34]
				"783639 (62%)", -- [35]
				"783639 (62%)", -- [36]
				"783639 (62%)", -- [37]
				"783639 (62%)", -- [38]
				"781003 (61%)", -- [39]
				"781003 (61%)", -- [40]
				"781003 (61%)", -- [41]
				"781003 (61%)", -- [42]
				"778480 (61%)", -- [43]
				"778480 (61%)", -- [44]
				"778480 (61%)", -- [45]
				"775736 (61%)", -- [46]
				"775736 (61%)", -- [47]
				"775736 (61%)", -- [48]
				"775736 (61%)", -- [49]
				"770183 (61%)", -- [50]
			},
			["LastAttackedBy"] = "Огненный Левиафан",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					292.63, -- [1]
				},
				["DOT_Time"] = {
					171, -- [1]
				},
				["TimeDamage"] = {
					292.63, -- [1]
				},
				["DamageTaken"] = {
					317440, -- [1]
				},
				["Damage"] = {
					24050819, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Трофейный разрушитель",
			["level"] = 1,
			["LastDamageAbility"] = "Заградительные стрелы",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				0.1970634920634921, -- [1]
				nil, -- [2]
				0.196031746031746, -- [3]
				0.2380952380952381, -- [4]
				nil, -- [5]
				0.2380952380952381, -- [6]
				nil, -- [7]
				0.2380952380952381, -- [8]
				0.1967460317460318, -- [9]
				nil, -- [10]
				nil, -- [11]
				0.2380952380952381, -- [12]
				nil, -- [13]
				0.2380952380952381, -- [14]
				nil, -- [15]
				0.2130952380952381, -- [16]
				0.2380952380952381, -- [17]
				nil, -- [18]
				nil, -- [19]
				0.2175396825396825, -- [20]
				nil, -- [21]
				nil, -- [22]
				nil, -- [23]
				0.2054761904761905, -- [24]
				nil, -- [25]
				0.2380952380952381, -- [26]
				nil, -- [27]
				0.2380952380952381, -- [28]
				nil, -- [29]
				0.2171428571428571, -- [30]
				nil, -- [31]
				0.2380952380952381, -- [32]
				nil, -- [33]
				0.2194444444444444, -- [34]
				[37] = 0.2125396825396825,
				[41] = 0.2135714285714286,
				[46] = 0.2083333333333333,
				[50] = 0.2380952380952381,
			},
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastDamageTaken"] = 2741,
			["TimeLast"] = {
				["DOT_Time"] = 1682203472,
				["ActiveTime"] = 1682203472,
				["TimeDamage"] = 1682203472,
				["OVERALL"] = 1682203472,
				["DamageTaken"] = 1682203471,
				["Damage"] = 1682203472,
			},
			["Owner"] = "Marazzm",
			["LastAbility"] = 197858.245,
			["NextEventNum"] = 24,
			["LastEventHealthNum"] = {
				61.12563492063492, -- [1]
				61.12563492063492, -- [2]
				60.44142857142857, -- [3]
				60.20333333333333, -- [4]
				60.20333333333333, -- [5]
				59.74809523809524, -- [6]
				59.74809523809524, -- [7]
				73.90412698412699, -- [8]
				73.70738095238096, -- [9]
				73.70738095238096, -- [10]
				73.70738095238096, -- [11]
				73.46928571428572, -- [12]
				73.46928571428572, -- [13]
				57.95960317460317, -- [14]
				57.95960317460317, -- [15]
				57.27150793650794, -- [16]
				56.81460317460318, -- [17]
				56.81460317460318, -- [18]
				56.61626984126984, -- [19]
				56.61626984126984, -- [20]
				56.61626984126984, -- [21]
				56.61626984126984, -- [22]
				56.41706349206349, -- [23]
				63.78095238095238, -- [24]
				63.78095238095238, -- [25]
				63.54285714285714, -- [26]
				63.54285714285714, -- [27]
				63.08753968253969, -- [28]
				63.08753968253969, -- [29]
				63.08753968253969, -- [30]
				63.08753968253969, -- [31]
				62.84944444444444, -- [32]
				62.84944444444444, -- [33]
				62.40436507936508, -- [34]
				62.19357142857143, -- [35]
				62.19357142857143, -- [36]
				62.19357142857143, -- [37]
				62.19357142857143, -- [38]
				61.98436507936508, -- [39]
				61.98436507936508, -- [40]
				61.98436507936508, -- [41]
				61.98436507936508, -- [42]
				61.78412698412699, -- [43]
				61.78412698412699, -- [44]
				61.78412698412699, -- [45]
				61.56634920634921, -- [46]
				61.56634920634921, -- [47]
				61.56634920634921, -- [48]
				61.56634920634921, -- [49]
				61.12563492063492, -- [50]
			},
			["LastEvents"] = {
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2483 (Physical)", -- [1]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [2]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2470 (Physical)", -- [3]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [4]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [5]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [6]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -108000 (12000 сопрот.)", -- [7]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [8]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2479 (Physical)", -- [9]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -108000 (12000 сопрот.)", -- [10]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -112892", -- [11]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [12]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [13]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [14]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [15]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2685 (Physical)", -- [16]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [17]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -96000 (24000 сопрот.)", -- [18]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [19]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2741 (Physical)", -- [20]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -120000", -- [21]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -119024", -- [22]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [23]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2589 (Physical)", -- [24]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -121710", -- [25]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [26]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [27]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [28]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [29]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2736 (Physical)", -- [30]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -88445 (22111 сопрот.)", -- [31]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [32]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [33]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2765 (Physical)", -- [34]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [35]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [36]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2678 (Physical)", -- [37]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -89154 (22288 сопрот.)", -- [38]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [39]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [40]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2691 (Physical)", -- [41]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -130762", -- [42]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [43]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [44]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -124168", -- [45]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Marazzm> Hit -2625 (Physical)", -- [46]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [47]
				"Трофейный разрушитель <Marazzm> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [48]
				"Трофейный разрушитель <Marazzm> Синий колчедан Огненный Левиафан Hit -108598", -- [49]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Marazzm> Hit -3000 (Fire)", -- [50]
			},
			["Name"] = "Трофейный разрушитель",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				197844.883, -- [1]
				197845.03, -- [2]
				197847.274, -- [3]
				197847.701, -- [4]
				197848.237, -- [5]
				197848.659, -- [6]
				197849.089, -- [7]
				197849.732, -- [8]
				197849.772, -- [9]
				197850.057, -- [10]
				197850.454, -- [11]
				197850.686, -- [12]
				197851.077, -- [13]
				197851.668, -- [14]
				197852.071, -- [15]
				197854.289, -- [16]
				197854.697, -- [17]
				197855.135, -- [18]
				197856.16, -- [19]
				197856.914, -- [20]
				197857.146, -- [21]
				197857.423, -- [22]
				197858.245, -- [23]
				197831.156, -- [24]
				197831.506, -- [25]
				197831.67, -- [26]
				197831.751, -- [27]
				197832.646, -- [28]
				197832.805, -- [29]
				197832.892, -- [30]
				197833.238, -- [31]
				197833.617, -- [32]
				197833.816, -- [33]
				197836.185, -- [34]
				197836.841, -- [35]
				197837.814, -- [36]
				197838.429, -- [37]
				197838.753, -- [38]
				197838.871, -- [39]
				197839.893, -- [40]
				197840.46, -- [41]
				197840.504, -- [42]
				197840.911, -- [43]
				197841.879, -- [44]
				197842.227, -- [45]
				197842.69, -- [46]
				197842.941, -- [47]
				197843.944, -- [48]
				197844.371, -- [49]
				197844.741, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 120,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 11,
									["amount"] = 440,
								},
							},
							["count"] = 11,
							["amount"] = 440,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 73126,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 38.45999999999999,
								},
							},
							["amount"] = 38.45999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 106.09,
								},
								["Таран"] = {
									["count"] = 15.65,
								},
							},
							["amount"] = 121.74,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 4.609999999999999,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11.71,
								},
								["Валун"] = {
									["count"] = 54.67,
								},
								["Таран"] = {
									["count"] = 4.850000000000001,
								},
							},
							["amount"] = 75.84,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 42.33000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 14.26,
								},
							},
							["amount"] = 56.59,
						},
					},
					["DamageTaken"] = 317440,
					["PartialResist"] = {
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 235,
									["amount"] = 0,
								},
							},
							["count"] = 235,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 82,
									["amount"] = 0,
								},
							},
							["count"] = 82,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 235,
									["amount"] = 0,
								},
							},
							["count"] = 235,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 82,
									["amount"] = 0,
								},
							},
							["count"] = 82,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 292.63,
					["ElementTaken"] = {
						["Fire"] = 79824,
						["Physical"] = 53552,
						["Melee"] = 70996,
						["Nature"] = 113068,
					},
					["DOT_Time"] = 171,
					["Damage"] = 24050819,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Ульдуарский великан"] = {
									["count"] = 39,
								},
								["Огненный Левиафан"] = {
									["count"] = 132,
								},
							},
							["amount"] = 171,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 440,
						["Physical"] = 120,
					},
					["ElementDone"] = {
						["Physical"] = 1501098,
						["Fire"] = 11825226,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 37,
								},
							},
							["amount"] = 45,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 19,
								},
								["Dodge"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 190,
								},
							},
							["amount"] = 235,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 77,
								},
							},
							["amount"] = 84,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 1741016,
								},
							},
							["amount"] = 1741016,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8155028,
								},
								["Таран"] = {
									["count"] = 1426564,
								},
							},
							["amount"] = 9581592,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 356734,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 504000,
								},
								["Валун"] = {
									["count"] = 1929182,
								},
								["Таран"] = {
									["count"] = 74534,
								},
							},
							["amount"] = 2864450,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7504800,
								},
								["Синий колчедан"] = {
									["count"] = 2358961,
								},
							},
							["amount"] = 9863761,
						},
					},
					["TimeDamage"] = 292.63,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 38.45999999999999,
								},
							},
							["amount"] = 38.45999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 106.09,
								},
								["Таран"] = {
									["count"] = 15.65,
								},
							},
							["amount"] = 121.74,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 4.609999999999999,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11.71,
								},
								["Валун"] = {
									["count"] = 54.67,
								},
								["Таран"] = {
									["count"] = 4.850000000000001,
								},
							},
							["amount"] = 75.84,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 42.33000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 14.26,
								},
							},
							["amount"] = 56.59,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 102481,
									["min"] = 102481,
									["count"] = 1,
									["amount"] = 102481,
								},
								["Hit"] = {
									["max"] = 131810,
									["min"] = 88445,
									["count"] = 23,
									["amount"] = 2613214,
								},
							},
							["count"] = 24,
							["amount"] = 2715695,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 24000,
									["count"] = 57,
									["amount"] = 8008800,
								},
							},
							["count"] = 57,
							["amount"] = 8008800,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 65090,
									["min"] = 59946,
									["count"] = 3,
									["amount"] = 185074,
								},
								["Hit"] = {
									["max"] = 65950,
									["min"] = 49430,
									["count"] = 194,
									["amount"] = 11640152,
								},
							},
							["count"] = 197,
							["amount"] = 11825226,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25700,
									["min"] = 23390,
									["count"] = 61,
									["amount"] = 1501098,
								},
							},
							["count"] = 61,
							["amount"] = 1501098,
						},
					},
					["WhoDamaged"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 28824,
								},
							},
							["amount"] = 28824,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 70996,
								},
								["Подрезать сухожилия"] = {
									["count"] = 972,
								},
								["Молния"] = {
									["count"] = 38982,
								},
							},
							["amount"] = 110950,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Удар Земли"] = {
									["count"] = 74086,
								},
							},
							["amount"] = 74086,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 52580,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 103580,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 61,
								},
							},
							["amount"] = 61,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 197,
								},
							},
							["amount"] = 197,
						},
					},
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 120,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 11,
									["amount"] = 440,
								},
							},
							["count"] = 11,
							["amount"] = 440,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 73126,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 38.45999999999999,
								},
							},
							["amount"] = 38.45999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 106.09,
								},
								["Таран"] = {
									["count"] = 15.65,
								},
							},
							["amount"] = 121.74,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 4.609999999999999,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11.71,
								},
								["Валун"] = {
									["count"] = 54.67,
								},
								["Таран"] = {
									["count"] = 4.850000000000001,
								},
							},
							["amount"] = 75.84,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 42.33000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 14.26,
								},
							},
							["amount"] = 56.59,
						},
					},
					["DamageTaken"] = 317440,
					["PartialResist"] = {
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 235,
									["amount"] = 0,
								},
							},
							["count"] = 235,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 82,
									["amount"] = 0,
								},
							},
							["count"] = 82,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 235,
									["amount"] = 0,
								},
							},
							["count"] = 235,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 82,
									["amount"] = 0,
								},
							},
							["count"] = 82,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 292.63,
					["ElementTaken"] = {
						["Fire"] = 79824,
						["Physical"] = 53552,
						["Melee"] = 70996,
						["Nature"] = 113068,
					},
					["DOT_Time"] = 171,
					["Damage"] = 24050819,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Ульдуарский великан"] = {
									["count"] = 39,
								},
								["Огненный Левиафан"] = {
									["count"] = 132,
								},
							},
							["amount"] = 171,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 440,
						["Physical"] = 120,
					},
					["ElementDone"] = {
						["Physical"] = 1501098,
						["Fire"] = 11825226,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 37,
								},
							},
							["amount"] = 45,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 19,
								},
								["Dodge"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 190,
								},
							},
							["amount"] = 235,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 77,
								},
							},
							["amount"] = 84,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 1741016,
								},
							},
							["amount"] = 1741016,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8155028,
								},
								["Таран"] = {
									["count"] = 1426564,
								},
							},
							["amount"] = 9581592,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 356734,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 504000,
								},
								["Валун"] = {
									["count"] = 1929182,
								},
								["Таран"] = {
									["count"] = 74534,
								},
							},
							["amount"] = 2864450,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7504800,
								},
								["Синий колчедан"] = {
									["count"] = 2358961,
								},
							},
							["amount"] = 9863761,
						},
					},
					["TimeDamage"] = 292.63,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 38.45999999999999,
								},
							},
							["amount"] = 38.45999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 106.09,
								},
								["Таран"] = {
									["count"] = 15.65,
								},
							},
							["amount"] = 121.74,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 4.609999999999999,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11.71,
								},
								["Валун"] = {
									["count"] = 54.67,
								},
								["Таран"] = {
									["count"] = 4.850000000000001,
								},
							},
							["amount"] = 75.84,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 42.33000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 14.26,
								},
							},
							["amount"] = 56.59,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 102481,
									["min"] = 102481,
									["count"] = 1,
									["amount"] = 102481,
								},
								["Hit"] = {
									["max"] = 131810,
									["min"] = 88445,
									["count"] = 23,
									["amount"] = 2613214,
								},
							},
							["count"] = 24,
							["amount"] = 2715695,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 24000,
									["count"] = 57,
									["amount"] = 8008800,
								},
							},
							["count"] = 57,
							["amount"] = 8008800,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 65090,
									["min"] = 59946,
									["count"] = 3,
									["amount"] = 185074,
								},
								["Hit"] = {
									["max"] = 65950,
									["min"] = 49430,
									["count"] = 194,
									["amount"] = 11640152,
								},
							},
							["count"] = 197,
							["amount"] = 11825226,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25700,
									["min"] = 23390,
									["count"] = 61,
									["amount"] = 1501098,
								},
							},
							["count"] = 61,
							["amount"] = 1501098,
						},
					},
					["WhoDamaged"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 28824,
								},
							},
							["amount"] = 28824,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 70996,
								},
								["Подрезать сухожилия"] = {
									["count"] = 972,
								},
								["Молния"] = {
									["count"] = 38982,
								},
							},
							["amount"] = 110950,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Удар Земли"] = {
									["count"] = 74086,
								},
							},
							["amount"] = 74086,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 52580,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 103580,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 61,
								},
							},
							["amount"] = 61,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 197,
								},
							},
							["amount"] = 197,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 120,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 11,
									["amount"] = 440,
								},
							},
							["count"] = 11,
							["amount"] = 440,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 73126,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 38.45999999999999,
								},
							},
							["amount"] = 38.45999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 106.09,
								},
								["Таран"] = {
									["count"] = 15.65,
								},
							},
							["amount"] = 121.74,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 4.609999999999999,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11.71,
								},
								["Валун"] = {
									["count"] = 54.67,
								},
								["Таран"] = {
									["count"] = 4.850000000000001,
								},
							},
							["amount"] = 75.84,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 42.33000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 14.26,
								},
							},
							["amount"] = 56.59,
						},
					},
					["DamageTaken"] = 317440,
					["PartialResist"] = {
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 235,
									["amount"] = 0,
								},
							},
							["count"] = 235,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 82,
									["amount"] = 0,
								},
							},
							["count"] = 82,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 235,
									["amount"] = 0,
								},
							},
							["count"] = 235,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 82,
									["amount"] = 0,
								},
							},
							["count"] = 82,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 292.63,
					["ElementTaken"] = {
						["Fire"] = 79824,
						["Physical"] = 53552,
						["Melee"] = 70996,
						["Nature"] = 113068,
					},
					["DOT_Time"] = 171,
					["Damage"] = 24050819,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Ульдуарский великан"] = {
									["count"] = 39,
								},
								["Огненный Левиафан"] = {
									["count"] = 132,
								},
							},
							["amount"] = 171,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 440,
						["Physical"] = 120,
					},
					["ElementDone"] = {
						["Physical"] = 1501098,
						["Fire"] = 11825226,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 37,
								},
							},
							["amount"] = 45,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 19,
								},
								["Dodge"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 190,
								},
							},
							["amount"] = 235,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 77,
								},
							},
							["amount"] = 84,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 1741016,
								},
							},
							["amount"] = 1741016,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 8155028,
								},
								["Таран"] = {
									["count"] = 1426564,
								},
							},
							["amount"] = 9581592,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 356734,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 504000,
								},
								["Валун"] = {
									["count"] = 1929182,
								},
								["Таран"] = {
									["count"] = 74534,
								},
							},
							["amount"] = 2864450,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7504800,
								},
								["Синий колчедан"] = {
									["count"] = 2358961,
								},
							},
							["amount"] = 9863761,
						},
					},
					["TimeDamage"] = 292.63,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 38.45999999999999,
								},
							},
							["amount"] = 38.45999999999999,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 106.09,
								},
								["Таран"] = {
									["count"] = 15.65,
								},
							},
							["amount"] = 121.74,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Синий колчедан"] = {
									["count"] = 4.609999999999999,
								},
								["Синий колчедан (УЗВ)"] = {
									["count"] = 11.71,
								},
								["Валун"] = {
									["count"] = 54.67,
								},
								["Таран"] = {
									["count"] = 4.850000000000001,
								},
							},
							["amount"] = 75.84,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 42.33000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 14.26,
								},
							},
							["amount"] = 56.59,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 102481,
									["min"] = 102481,
									["count"] = 1,
									["amount"] = 102481,
								},
								["Hit"] = {
									["max"] = 131810,
									["min"] = 88445,
									["count"] = 23,
									["amount"] = 2613214,
								},
							},
							["count"] = 24,
							["amount"] = 2715695,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 24000,
									["count"] = 57,
									["amount"] = 8008800,
								},
							},
							["count"] = 57,
							["amount"] = 8008800,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 65090,
									["min"] = 59946,
									["count"] = 3,
									["amount"] = 185074,
								},
								["Hit"] = {
									["max"] = 65950,
									["min"] = 49430,
									["count"] = 194,
									["amount"] = 11640152,
								},
							},
							["count"] = 197,
							["amount"] = 11825226,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25700,
									["min"] = 23390,
									["count"] = 61,
									["amount"] = 1501098,
								},
							},
							["count"] = 61,
							["amount"] = 1501098,
						},
					},
					["WhoDamaged"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 28824,
								},
							},
							["amount"] = 28824,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 70996,
								},
								["Подрезать сухожилия"] = {
									["count"] = 972,
								},
								["Молния"] = {
									["count"] = 38982,
								},
							},
							["amount"] = 110950,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Удар Земли"] = {
									["count"] = 74086,
								},
							},
							["amount"] = 74086,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 52580,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 103580,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 61,
								},
							},
							["amount"] = 61,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 197,
								},
							},
							["amount"] = 197,
						},
					},
				},
			},
			["UnitLockout"] = 1682203052,
			["LastActive"] = 1682203472,
		},
		["Трофейный разрушитель <Shephard>"] = {
			["GUID"] = "0xF150008155000014",
			["LastEventHealth"] = {
				"715864 (56%)", -- [1]
				"713365 (56%)", -- [2]
				"713365 (56%)", -- [3]
				"713365 (56%)", -- [4]
				"710855 (56%)", -- [5]
				"710855 (56%)", -- [6]
				"710855 (56%)", -- [7]
				"710855 (56%)", -- [8]
				"786295 (62%)", -- [9]
				"783639 (62%)", -- [10]
				"783639 (62%)", -- [11]
				"783639 (62%)", -- [12]
				"783639 (62%)", -- [13]
				"781003 (61%)", -- [14]
				"781003 (61%)", -- [15]
				"781003 (61%)", -- [16]
				"781003 (61%)", -- [17]
				"778480 (61%)", -- [18]
				"778480 (61%)", -- [19]
				"778480 (61%)", -- [20]
				"775736 (61%)", -- [21]
				"775736 (61%)", -- [22]
				"775736 (61%)", -- [23]
				"773183 (61%)", -- [24]
				"773183 (61%)", -- [25]
				"773183 (61%)", -- [26]
				"770183 (61%)", -- [27]
				"770183 (61%)", -- [28]
				"767183 (60%)", -- [29]
				"764562 (60%)", -- [30]
				"764562 (60%)", -- [31]
				"764562 (60%)", -- [32]
				"761562 (60%)", -- [33]
				"761562 (60%)", -- [34]
				"758562 (60%)", -- [35]
				"755826 (59%)", -- [36]
				"755826 (59%)", -- [37]
				"752826 (59%)", -- [38]
				"733291 (58%)", -- [39]
				"733291 (58%)", -- [40]
				"730291 (57%)", -- [41]
				"730291 (57%)", -- [42]
				"727291 (57%)", -- [43]
				"724621 (57%)", -- [44]
				"724621 (57%)", -- [45]
				"721621 (57%)", -- [46]
				"718864 (57%)", -- [47]
				"718864 (57%)", -- [48]
				"715864 (56%)", -- [49]
				"715864 (56%)", -- [50]
			},
			["LastAttackedBy"] = "Огненный Левиафан",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					295.47, -- [1]
				},
				["DOT_Time"] = {
					138, -- [1]
				},
				["TimeDamage"] = {
					295.47, -- [1]
				},
				["DamageTaken"] = {
					492877, -- [1]
				},
				["Damage"] = {
					24746261, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Трофейный разрушитель",
			["level"] = 1,
			["LastDamageAbility"] = "Заградительные стрелы",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				nil, -- [1]
				0.1983333333333333, -- [2]
				[5] = 0.1992063492063492,
				[10] = 0.2107936507936508,
				[14] = 0.2092063492063492,
				[18] = 0.2002380952380952,
				[21] = 0.2177777777777778,
				[24] = 0.2026190476190476,
				[27] = 0.2380952380952381,
				[29] = 0.2380952380952381,
				[30] = 0.208015873015873,
				[33] = 0.2380952380952381,
				[35] = 0.2380952380952381,
				[36] = 0.2171428571428571,
				[38] = 0.2380952380952381,
				[39] = 0.1961111111111111,
				[41] = 0.2380952380952381,
				[43] = 0.2380952380952381,
				[44] = 0.2119047619047619,
				[46] = 0.2380952380952381,
				[47] = 0.2188095238095238,
				[49] = 0.2380952380952381,
			},
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastDamageTaken"] = 2510,
			["TimeLast"] = {
				["DOT_Time"] = 1682203473,
				["ActiveTime"] = 1682203473,
				["TimeDamage"] = 1682203473,
				["OVERALL"] = 1682203473,
				["DamageTaken"] = 1682203471,
				["Damage"] = 1682203473,
			},
			["Owner"] = "Shephard",
			["LastAbility"] = 197858.763,
			["NextEventNum"] = 9,
			["LastEventHealthNum"] = {
				56.81460317460318, -- [1]
				56.61626984126984, -- [2]
				56.61626984126984, -- [3]
				56.61626984126984, -- [4]
				56.41706349206349, -- [5]
				56.41706349206349, -- [6]
				56.41706349206349, -- [7]
				56.41706349206349, -- [8]
				62.40436507936508, -- [9]
				62.19357142857143, -- [10]
				62.19357142857143, -- [11]
				62.19357142857143, -- [12]
				62.19357142857143, -- [13]
				61.98436507936508, -- [14]
				61.98436507936508, -- [15]
				61.98436507936508, -- [16]
				61.98436507936508, -- [17]
				61.78412698412699, -- [18]
				61.78412698412699, -- [19]
				61.78412698412699, -- [20]
				61.56634920634921, -- [21]
				61.56634920634921, -- [22]
				61.56634920634921, -- [23]
				61.36373015873016, -- [24]
				61.36373015873016, -- [25]
				61.36373015873016, -- [26]
				61.12563492063492, -- [27]
				61.12563492063492, -- [28]
				60.88753968253968, -- [29]
				60.67952380952381, -- [30]
				60.67952380952381, -- [31]
				60.67952380952381, -- [32]
				60.44142857142857, -- [33]
				60.44142857142857, -- [34]
				60.20333333333333, -- [35]
				59.98619047619048, -- [36]
				59.98619047619048, -- [37]
				59.74809523809524, -- [38]
				58.19769841269842, -- [39]
				58.19769841269842, -- [40]
				57.95960317460317, -- [41]
				57.95960317460317, -- [42]
				57.72150793650793, -- [43]
				57.50960317460317, -- [44]
				57.50960317460317, -- [45]
				57.27150793650794, -- [46]
				57.05269841269841, -- [47]
				57.05269841269841, -- [48]
				56.81460317460318, -- [49]
				56.81460317460318, -- [50]
			},
			["LastEvents"] = {
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [1]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2499 (Physical)", -- [2]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -126797", -- [3]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [4]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2510 (Physical)", -- [5]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [6]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -117986", -- [7]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [8]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [9]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2656 (Physical)", -- [10]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [11]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -112322 (12480 сопрот.)", -- [12]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [13]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2636 (Physical)", -- [14]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [15]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -121438", -- [16]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [17]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2523 (Physical)", -- [18]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [19]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -114750 (12750 сопрот.)", -- [20]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2744 (Physical)", -- [21]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [22]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [23]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2553 (Physical)", -- [24]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [25]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -121596", -- [26]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [27]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [28]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [29]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2621 (Physical)", -- [30]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -125630", -- [31]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [32]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [33]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [34]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [35]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2736 (Physical)", -- [36]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [37]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [38]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2471 (Physical)", -- [39]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [40]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [41]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -240000", -- [42]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [43]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2670 (Physical)", -- [44]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -192000 (48000 сопрот.)", -- [45]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [46]
				"Огненный Левиафан Заградительные стрелы Трофейный разрушитель <Shephard> Hit -2757 (Physical)", -- [47]
				"Трофейный разрушитель <Shephard> Синий колчедан (УЗВ) Огненный Левиафан Tick -216000 (24000 сопрот.)", -- [48]
				"Огненный Левиафан Огненное дыхание Трофейный разрушитель <Shephard> Hit -3000 (Fire)", -- [49]
				"Трофейный разрушитель <Shephard> Синий колчедан Огненный Левиафан Hit -94031 (23507 сопрот.)", -- [50]
			},
			["Name"] = "Трофейный разрушитель",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				197855.616, -- [1]
				197856.059, -- [2]
				197856.294, -- [3]
				197856.667, -- [4]
				197857.621, -- [5]
				197857.654, -- [6]
				197858.04, -- [7]
				197858.763, -- [8]
				197836.356, -- [9]
				197836.761, -- [10]
				197837.376, -- [11]
				197837.945, -- [12]
				197838.387, -- [13]
				197838.793, -- [14]
				197839.398, -- [15]
				197839.665, -- [16]
				197840.417, -- [17]
				197840.542, -- [18]
				197841.397, -- [19]
				197841.485, -- [20]
				197842.519, -- [21]
				197842.52, -- [22]
				197843.476, -- [23]
				197844.416, -- [24]
				197844.459, -- [25]
				197844.652, -- [26]
				197844.74, -- [27]
				197845.529, -- [28]
				197845.671, -- [29]
				197846.373, -- [30]
				197846.459, -- [31]
				197846.593, -- [32]
				197846.691, -- [33]
				197847.543, -- [34]
				197847.7, -- [35]
				197848.264, -- [36]
				197848.613, -- [37]
				197848.658, -- [38]
				197851.582, -- [39]
				197851.583, -- [40]
				197851.667, -- [41]
				197852.552, -- [42]
				197852.638, -- [43]
				197852.895, -- [44]
				197853.555, -- [45]
				197853.654, -- [46]
				197854.606, -- [47]
				197854.607, -- [48]
				197854.696, -- [49]
				197854.742, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 320,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 9,
									["amount"] = 360,
								},
							},
							["count"] = 9,
							["amount"] = 360,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 43173,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 19.9,
								},
							},
							["amount"] = 19.9,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 151.34,
								},
								["Таран"] = {
									["count"] = 4.419999999999999,
								},
							},
							["amount"] = 155.7599999999999,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 54.59999999999999,
								},
								["Таран"] = {
									["count"] = 7.969999999999999,
								},
							},
							["amount"] = 62.56999999999999,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 44.47000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 12.77,
								},
							},
							["amount"] = 57.24,
						},
					},
					["DamageTaken"] = 492877,
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 504,
									["amount"] = 0,
								},
							},
							["count"] = 504,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 35,
									["amount"] = 0,
								},
							},
							["count"] = 35,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 121,
									["amount"] = 0,
								},
							},
							["count"] = 121,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 504,
									["amount"] = 0,
								},
							},
							["count"] = 504,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 35,
									["amount"] = 0,
								},
							},
							["count"] = 35,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 121,
									["amount"] = 0,
								},
							},
							["count"] = 121,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 295.47,
					["ElementTaken"] = {
						["Fire"] = 70573,
						["Physical"] = 51708,
						["Melee"] = 163984,
						["Nature"] = 206612,
					},
					["DOT_Time"] = 138,
					["Damage"] = 24746261,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Огненный Левиафан"] = {
									["count"] = 138,
								},
							},
							["amount"] = 138,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 360,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Physical"] = 1420462,
						["Fire"] = 12976161,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 19,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 52,
								},
							},
							["amount"] = 69,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 25,
								},
								["Miss"] = {
									["count"] = 28,
								},
								["Crit"] = {
									["count"] = 29,
								},
								["Hit"] = {
									["count"] = 422,
								},
							},
							["amount"] = 504,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 116,
								},
							},
							["amount"] = 123,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 623341,
								},
							},
							["amount"] = 623341,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 10514704,
								},
								["Таран"] = {
									["count"] = 1271236,
								},
							},
							["amount"] = 11785940,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 1838116,
								},
								["Таран"] = {
									["count"] = 149226,
								},
							},
							["amount"] = 1987342,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7924800,
								},
								["Синий колчедан"] = {
									["count"] = 2424838,
								},
							},
							["amount"] = 10349638,
						},
					},
					["TimeDamage"] = 295.47,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 19.9,
								},
							},
							["amount"] = 19.9,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 151.34,
								},
								["Таран"] = {
									["count"] = 4.419999999999999,
								},
							},
							["amount"] = 155.7599999999999,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 54.59999999999999,
								},
								["Таран"] = {
									["count"] = 7.969999999999999,
								},
							},
							["amount"] = 62.56999999999999,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 44.47000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 12.77,
								},
							},
							["amount"] = 57.24,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 126797,
									["min"] = 126797,
									["count"] = 1,
									["amount"] = 126797,
								},
								["Hit"] = {
									["max"] = 127086,
									["min"] = 94031,
									["count"] = 20,
									["amount"] = 2298041,
								},
							},
							["count"] = 21,
							["amount"] = 2424838,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 43200,
									["count"] = 46,
									["amount"] = 7924800,
								},
							},
							["count"] = 46,
							["amount"] = 7924800,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 64678,
									["min"] = 56792,
									["count"] = 8,
									["amount"] = 485062,
								},
								["Hit"] = {
									["max"] = 65886,
									["min"] = 48760,
									["count"] = 210,
									["amount"] = 12491099,
								},
							},
							["count"] = 218,
							["amount"] = 12976161,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25687,
									["min"] = 23311,
									["count"] = 58,
									["amount"] = 1420462,
								},
							},
							["count"] = 58,
							["amount"] = 1420462,
						},
					},
					["WhoDamaged"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 19573,
								},
								["Атака ближнего боя"] = {
									["count"] = 2256,
								},
							},
							["amount"] = 21829,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 59283,
								},
								["Подрезать сухожилия"] = {
									["count"] = 2105,
								},
								["Атака ближнего боя"] = {
									["count"] = 153530,
								},
							},
							["amount"] = 214918,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 8198,
								},
								["Удар Земли"] = {
									["count"] = 147329,
								},
							},
							["amount"] = 155527,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 49603,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 100603,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 58,
								},
							},
							["amount"] = 58,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
					},
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 320,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 9,
									["amount"] = 360,
								},
							},
							["count"] = 9,
							["amount"] = 360,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 43173,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 19.9,
								},
							},
							["amount"] = 19.9,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 151.34,
								},
								["Таран"] = {
									["count"] = 4.419999999999999,
								},
							},
							["amount"] = 155.7599999999999,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 54.59999999999999,
								},
								["Таран"] = {
									["count"] = 7.969999999999999,
								},
							},
							["amount"] = 62.56999999999999,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 44.47000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 12.77,
								},
							},
							["amount"] = 57.24,
						},
					},
					["DamageTaken"] = 492877,
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 504,
									["amount"] = 0,
								},
							},
							["count"] = 504,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 35,
									["amount"] = 0,
								},
							},
							["count"] = 35,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 121,
									["amount"] = 0,
								},
							},
							["count"] = 121,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 504,
									["amount"] = 0,
								},
							},
							["count"] = 504,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 35,
									["amount"] = 0,
								},
							},
							["count"] = 35,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 121,
									["amount"] = 0,
								},
							},
							["count"] = 121,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 295.47,
					["ElementTaken"] = {
						["Fire"] = 70573,
						["Physical"] = 51708,
						["Melee"] = 163984,
						["Nature"] = 206612,
					},
					["DOT_Time"] = 138,
					["Damage"] = 24746261,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Огненный Левиафан"] = {
									["count"] = 138,
								},
							},
							["amount"] = 138,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 360,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Physical"] = 1420462,
						["Fire"] = 12976161,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 19,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 52,
								},
							},
							["amount"] = 69,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 25,
								},
								["Miss"] = {
									["count"] = 28,
								},
								["Crit"] = {
									["count"] = 29,
								},
								["Hit"] = {
									["count"] = 422,
								},
							},
							["amount"] = 504,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 116,
								},
							},
							["amount"] = 123,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 623341,
								},
							},
							["amount"] = 623341,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 10514704,
								},
								["Таран"] = {
									["count"] = 1271236,
								},
							},
							["amount"] = 11785940,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 1838116,
								},
								["Таран"] = {
									["count"] = 149226,
								},
							},
							["amount"] = 1987342,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7924800,
								},
								["Синий колчедан"] = {
									["count"] = 2424838,
								},
							},
							["amount"] = 10349638,
						},
					},
					["TimeDamage"] = 295.47,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 19.9,
								},
							},
							["amount"] = 19.9,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 151.34,
								},
								["Таран"] = {
									["count"] = 4.419999999999999,
								},
							},
							["amount"] = 155.7599999999999,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 54.59999999999999,
								},
								["Таран"] = {
									["count"] = 7.969999999999999,
								},
							},
							["amount"] = 62.56999999999999,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 44.47000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 12.77,
								},
							},
							["amount"] = 57.24,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 126797,
									["min"] = 126797,
									["count"] = 1,
									["amount"] = 126797,
								},
								["Hit"] = {
									["max"] = 127086,
									["min"] = 94031,
									["count"] = 20,
									["amount"] = 2298041,
								},
							},
							["count"] = 21,
							["amount"] = 2424838,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 43200,
									["count"] = 46,
									["amount"] = 7924800,
								},
							},
							["count"] = 46,
							["amount"] = 7924800,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 64678,
									["min"] = 56792,
									["count"] = 8,
									["amount"] = 485062,
								},
								["Hit"] = {
									["max"] = 65886,
									["min"] = 48760,
									["count"] = 210,
									["amount"] = 12491099,
								},
							},
							["count"] = 218,
							["amount"] = 12976161,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25687,
									["min"] = 23311,
									["count"] = 58,
									["amount"] = 1420462,
								},
							},
							["count"] = 58,
							["amount"] = 1420462,
						},
					},
					["WhoDamaged"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 19573,
								},
								["Атака ближнего боя"] = {
									["count"] = 2256,
								},
							},
							["amount"] = 21829,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 59283,
								},
								["Подрезать сухожилия"] = {
									["count"] = 2105,
								},
								["Атака ближнего боя"] = {
									["count"] = 153530,
								},
							},
							["amount"] = 214918,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 8198,
								},
								["Удар Земли"] = {
									["count"] = 147329,
								},
							},
							["amount"] = 155527,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 49603,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 100603,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 58,
								},
							},
							["amount"] = 58,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Fire"] = 320,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 9,
									["amount"] = 360,
								},
							},
							["count"] = 9,
							["amount"] = 360,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 43173,
					},
					["TimeSpent"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 19.9,
								},
							},
							["amount"] = 19.9,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 151.34,
								},
								["Таран"] = {
									["count"] = 4.419999999999999,
								},
							},
							["amount"] = 155.7599999999999,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 54.59999999999999,
								},
								["Таран"] = {
									["count"] = 7.969999999999999,
								},
							},
							["amount"] = 62.56999999999999,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 44.47000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 12.77,
								},
							},
							["amount"] = 57.24,
						},
					},
					["DamageTaken"] = 492877,
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 504,
									["amount"] = 0,
								},
							},
							["count"] = 504,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 35,
									["amount"] = 0,
								},
							},
							["count"] = 35,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 121,
									["amount"] = 0,
								},
							},
							["count"] = 121,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 504,
									["amount"] = 0,
								},
							},
							["count"] = 504,
							["amount"] = 0,
						},
						["Выброс лавы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Заградительные стрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Раскол брони"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Подрезать сухожилия"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 35,
									["amount"] = 0,
								},
							},
							["count"] = 35,
							["amount"] = 0,
						},
						["Молния"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 121,
									["amount"] = 0,
								},
							},
							["count"] = 121,
							["amount"] = 0,
						},
						["Огненное дыхание"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["Удар Земли"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 295.47,
					["ElementTaken"] = {
						["Fire"] = 70573,
						["Physical"] = 51708,
						["Melee"] = 163984,
						["Nature"] = 206612,
					},
					["DOT_Time"] = 138,
					["Damage"] = 24746261,
					["DOTs"] = {
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Огненный Левиафан"] = {
									["count"] = 138,
								},
							},
							["amount"] = 138,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 360,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Physical"] = 1420462,
						["Fire"] = 12976161,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 19,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 52,
								},
							},
							["amount"] = 69,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 25,
								},
								["Miss"] = {
									["count"] = 28,
								},
								["Crit"] = {
									["count"] = 29,
								},
								["Hit"] = {
									["count"] = 422,
								},
							},
							["amount"] = 504,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 116,
								},
							},
							["amount"] = 123,
						},
					},
					["DamagedWho"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 623341,
								},
							},
							["amount"] = 623341,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 10514704,
								},
								["Таран"] = {
									["count"] = 1271236,
								},
							},
							["amount"] = 11785940,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 1838116,
								},
								["Таран"] = {
									["count"] = 149226,
								},
							},
							["amount"] = 1987342,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 7924800,
								},
								["Синий колчедан"] = {
									["count"] = 2424838,
								},
							},
							["amount"] = 10349638,
						},
					},
					["TimeDamage"] = 295.47,
					["TimeDamaging"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 19.9,
								},
							},
							["amount"] = 19.9,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 151.34,
								},
								["Таран"] = {
									["count"] = 4.419999999999999,
								},
							},
							["amount"] = 155.7599999999999,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Валун"] = {
									["count"] = 54.59999999999999,
								},
								["Таран"] = {
									["count"] = 7.969999999999999,
								},
							},
							["amount"] = 62.56999999999999,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Синий колчедан (УЗВ)"] = {
									["count"] = 44.47000000000001,
								},
								["Синий колчедан"] = {
									["count"] = 12.77,
								},
							},
							["amount"] = 57.24,
						},
					},
					["Attacks"] = {
						["Синий колчедан"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 126797,
									["min"] = 126797,
									["count"] = 1,
									["amount"] = 126797,
								},
								["Hit"] = {
									["max"] = 127086,
									["min"] = 94031,
									["count"] = 20,
									["amount"] = 2298041,
								},
							},
							["count"] = 21,
							["amount"] = 2424838,
						},
						["Синий колчедан (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 240000,
									["min"] = 43200,
									["count"] = 46,
									["amount"] = 7924800,
								},
							},
							["count"] = 46,
							["amount"] = 7924800,
						},
						["Валун"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 64678,
									["min"] = 56792,
									["count"] = 8,
									["amount"] = 485062,
								},
								["Hit"] = {
									["max"] = 65886,
									["min"] = 48760,
									["count"] = 210,
									["amount"] = 12491099,
								},
							},
							["count"] = 218,
							["amount"] = 12976161,
						},
						["Таран"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 25687,
									["min"] = 23311,
									["count"] = 58,
									["amount"] = 1420462,
								},
							},
							["count"] = 58,
							["amount"] = 1420462,
						},
					},
					["WhoDamaged"] = {
						["Испещренный рунами часовой"] = {
							["Details"] = {
								["Выброс лавы"] = {
									["count"] = 19573,
								},
								["Атака ближнего боя"] = {
									["count"] = 2256,
								},
							},
							["amount"] = 21829,
						},
						["Кованый защитник"] = {
							["Details"] = {
								["Молния"] = {
									["count"] = 59283,
								},
								["Подрезать сухожилия"] = {
									["count"] = 2105,
								},
								["Атака ближнего боя"] = {
									["count"] = 153530,
								},
							},
							["amount"] = 214918,
						},
						["Ульдуарский великан"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 8198,
								},
								["Удар Земли"] = {
									["count"] = 147329,
								},
							},
							["amount"] = 155527,
						},
						["Огненный Левиафан"] = {
							["Details"] = {
								["Заградительные стрелы"] = {
									["count"] = 49603,
								},
								["Огненное дыхание"] = {
									["count"] = 51000,
								},
							},
							["amount"] = 100603,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 58,
								},
							},
							["amount"] = 58,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
					},
				},
			},
			["UnitLockout"] = 1682202979,
			["LastActive"] = 1682203473,
		},
		["Механическое сиденье в трофейном разрушителе <Shephard>"] = {
			["GUID"] = "0xF15000818F000016",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"???", -- [4]
				"???", -- [5]
				"???", -- [6]
				"???", -- [7]
				"???", -- [8]
				"???", -- [9]
				"???", -- [10]
				"???", -- [11]
				"???", -- [12]
				"???", -- [13]
				"???", -- [14]
				"???", -- [15]
				"???", -- [16]
				"???", -- [17]
				"???", -- [18]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
			},
			["TimeWindows"] = {
				["Damage"] = {
					234984, -- [1]
				},
				["TimeDamage"] = {
					40.74, -- [1]
				},
				["ActiveTime"] = {
					40.74, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["TimeLast"] = {
				["Damage"] = 1682203350,
				["OVERALL"] = 1682203350,
				["TimeDamage"] = 1682203350,
				["ActiveTime"] = 1682203350,
			},
			["Owner"] = "Shephard",
			["LastAbility"] = 197736.005,
			["NextEventNum"] = 19,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				0, -- [4]
				0, -- [5]
				0, -- [6]
				0, -- [7]
				0, -- [8]
				0, -- [9]
				0, -- [10]
				0, -- [11]
				0, -- [12]
				0, -- [13]
				0, -- [14]
				0, -- [15]
				0, -- [16]
				0, -- [17]
				0, -- [18]
			},
			["LastEvents"] = {
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13616", -- [1]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12854", -- [2]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12414", -- [3]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13556", -- [4]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13334", -- [5]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12564", -- [6]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12734", -- [7]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13510", -- [8]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12456", -- [9]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13700", -- [10]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13484", -- [11]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13298", -- [12]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12658", -- [13]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12796", -- [14]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13014", -- [15]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -13786", -- [16]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12528", -- [17]
				"Механическое сиденье в трофейном разрушителе <Shephard> Противовоздушная ракета Механолифт 304-А Hit -12682", -- [18]
			},
			["Name"] = "Механическое сиденье в трофейном разрушителе",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
			},
			["LastEventTimes"] = {
				197685.637, -- [1]
				197688.454, -- [2]
				197690.978, -- [3]
				197692.808, -- [4]
				197699.062, -- [5]
				197700.302, -- [6]
				197700.304, -- [7]
				197704.284, -- [8]
				197704.409, -- [9]
				197704.409, -- [10]
				197711.108, -- [11]
				197715.35, -- [12]
				197720.437, -- [13]
				197724.125, -- [14]
				197724.536, -- [15]
				197725.45, -- [16]
				197733.125, -- [17]
				197736.005, -- [18]
			},
			["Fights"] = {
				["Fight1"] = {
					["Attacks"] = {
						["Противовоздушная ракета"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 13786,
									["min"] = 12414,
									["count"] = 18,
									["amount"] = 234984,
								},
							},
							["count"] = 18,
							["amount"] = 234984,
						},
					},
					["DamagedWho"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 234984,
								},
							},
							["amount"] = 234984,
						},
					},
					["ActiveTime"] = 40.74,
					["TimeDamaging"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 40.74,
								},
							},
							["amount"] = 40.74,
						},
					},
					["TimeSpent"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 40.74,
								},
							},
							["amount"] = 40.74,
						},
					},
					["TimeDamage"] = 40.74,
					["Damage"] = 234984,
				},
				["LastFightData"] = {
					["Attacks"] = {
						["Противовоздушная ракета"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 13786,
									["min"] = 12414,
									["count"] = 18,
									["amount"] = 234984,
								},
							},
							["count"] = 18,
							["amount"] = 234984,
						},
					},
					["DamagedWho"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 234984,
								},
							},
							["amount"] = 234984,
						},
					},
					["ActiveTime"] = 40.74,
					["TimeDamaging"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 40.74,
								},
							},
							["amount"] = 40.74,
						},
					},
					["TimeSpent"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 40.74,
								},
							},
							["amount"] = 40.74,
						},
					},
					["TimeDamage"] = 40.74,
					["Damage"] = 234984,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Attacks"] = {
						["Противовоздушная ракета"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 13786,
									["min"] = 12414,
									["count"] = 18,
									["amount"] = 234984,
								},
							},
							["count"] = 18,
							["amount"] = 234984,
						},
					},
					["DamagedWho"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 234984,
								},
							},
							["amount"] = 234984,
						},
					},
					["ActiveTime"] = 40.74,
					["TimeDamaging"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 40.74,
								},
							},
							["amount"] = 40.74,
						},
					},
					["TimeSpent"] = {
						["Механолифт 304-А"] = {
							["Details"] = {
								["Противовоздушная ракета"] = {
									["count"] = 40.74,
								},
							},
							["amount"] = 40.74,
						},
					},
					["TimeDamage"] = 40.74,
					["Damage"] = 234984,
				},
			},
			["UnitLockout"] = 1682203350,
			["LastActive"] = 1682203350,
		},
	},
	["FightNum"] = 1,
	["CombatTimes"] = {
		{
			1682202979, -- [1]
			1682203474, -- [2]
			"04:36:20", -- [3]
			"04:44:34", -- [4]
			"Огненный Левиафан", -- [5]
		}, -- [1]
	},
	["FoughtWho"] = {
		"Огненный Левиафан 04:36:20-04:44:34", -- [1]
	},
}
