
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["Всадник без головы"] = {
			["GUID"] = "0xF130005C8200008A",
			["LastEventHealth"] = {
				"10081 (8%)", -- [1]
				"10081 (8%)", -- [2]
				"10081 (8%)", -- [3]
				"10081 (8%)", -- [4]
				"10081 (8%)", -- [5]
				"12601 (10%)", -- [6]
				"12601 (10%)", -- [7]
				"12601 (10%)", -- [8]
				"12601 (10%)", -- [9]
				"12601 (10%)", -- [10]
				"12601 (10%)", -- [11]
				"12601 (10%)", -- [12]
				"12601 (10%)", -- [13]
				"12601 (10%)", -- [14]
				"0 (0%)", -- [15]
				"2521 (2%)", -- [16]
				"2521 (2%)", -- [17]
				"2521 (2%)", -- [18]
				"2521 (2%)", -- [19]
				"2521 (2%)", -- [20]
				"2521 (2%)", -- [21]
				"5041 (4%)", -- [22]
				"5041 (4%)", -- [23]
				"5041 (4%)", -- [24]
				"5041 (4%)", -- [25]
				"5041 (4%)", -- [26]
				"5041 (4%)", -- [27]
				"5041 (4%)", -- [28]
				"5041 (4%)", -- [29]
				"5041 (4%)", -- [30]
				"5041 (4%)", -- [31]
				"5041 (4%)", -- [32]
				"5041 (4%)", -- [33]
				"5041 (4%)", -- [34]
				"5041 (4%)", -- [35]
				"7561 (6%)", -- [36]
				"7561 (6%)", -- [37]
				"7561 (6%)", -- [38]
				"7561 (6%)", -- [39]
				"7561 (6%)", -- [40]
				"7561 (6%)", -- [41]
				"7561 (6%)", -- [42]
				"7561 (6%)", -- [43]
				"7561 (6%)", -- [44]
				"7561 (6%)", -- [45]
				"7561 (6%)", -- [46]
				"7561 (6%)", -- [47]
				"10081 (8%)", -- [48]
				"10081 (8%)", -- [49]
				"10081 (8%)", -- [50]
			},
			["LastAttackedBy"] = "Pucifall",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					18.84, -- [1]
				},
				["Damage"] = {
					10193, -- [1]
				},
				["DamageTaken"] = {
					393187, -- [1]
				},
				["ActiveTime"] = {
					18.84, -- [1]
				},
			},
			["enClass"] = "MOB",
			["unit"] = "party2target",
			["level"] = -1,
			["LastDamageAbility"] = "Кровоизлияние",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
			},
			["type"] = "Boss",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["LastEventTimes"] = {
				12968.508, -- [1]
				12968.648, -- [2]
				12968.759, -- [3]
				12968.904, -- [4]
				12968.906, -- [5]
				12969.002, -- [6]
				12969.106, -- [7]
				12969.107, -- [8]
				12969.108, -- [9]
				12969.259, -- [10]
				12969.26, -- [11]
				12969.523, -- [12]
				12969.523, -- [13]
				12969.779, -- [14]
				12969.941, -- [15]
				12965.659, -- [16]
				12965.735, -- [17]
				12965.774, -- [18]
				12965.775, -- [19]
				12965.775, -- [20]
				12965.905, -- [21]
				12966.037, -- [22]
				12966.038, -- [23]
				12966.178, -- [24]
				12966.295, -- [25]
				12966.296, -- [26]
				12966.296, -- [27]
				12966.453, -- [28]
				12966.539, -- [29]
				12966.567, -- [30]
				12966.77, -- [31]
				12966.773, -- [32]
				12966.891, -- [33]
				12966.891, -- [34]
				12967.013, -- [35]
				12967.013, -- [36]
				12967.168, -- [37]
				12967.169, -- [38]
				12967.386, -- [39]
				12967.388, -- [40]
				12967.388, -- [41]
				12967.587, -- [42]
				12967.587, -- [43]
				12967.587, -- [44]
				12967.711, -- [45]
				12967.889, -- [46]
				12967.889, -- [47]
				12968.158, -- [48]
				12968.405, -- [49]
				12968.427, -- [50]
			},
			["Owner"] = false,
			["LastDamageTaken"] = 7144,
			["NextEventNum"] = 16,
			["LastEventHealthNum"] = {
				8.000793650793652, -- [1]
				8.000793650793652, -- [2]
				8.000793650793652, -- [3]
				8.000793650793652, -- [4]
				8.000793650793652, -- [5]
				10.00079365079365, -- [6]
				10.00079365079365, -- [7]
				10.00079365079365, -- [8]
				10.00079365079365, -- [9]
				10.00079365079365, -- [10]
				10.00079365079365, -- [11]
				10.00079365079365, -- [12]
				10.00079365079365, -- [13]
				10.00079365079365, -- [14]
				0, -- [15]
				2.000793650793651, -- [16]
				2.000793650793651, -- [17]
				2.000793650793651, -- [18]
				2.000793650793651, -- [19]
				2.000793650793651, -- [20]
				2.000793650793651, -- [21]
				4.000793650793651, -- [22]
				4.000793650793651, -- [23]
				4.000793650793651, -- [24]
				4.000793650793651, -- [25]
				4.000793650793651, -- [26]
				4.000793650793651, -- [27]
				4.000793650793651, -- [28]
				4.000793650793651, -- [29]
				4.000793650793651, -- [30]
				4.000793650793651, -- [31]
				4.000793650793651, -- [32]
				4.000793650793651, -- [33]
				4.000793650793651, -- [34]
				4.000793650793651, -- [35]
				6.000793650793651, -- [36]
				6.000793650793651, -- [37]
				6.000793650793651, -- [38]
				6.000793650793651, -- [39]
				6.000793650793651, -- [40]
				6.000793650793651, -- [41]
				6.000793650793651, -- [42]
				6.000793650793651, -- [43]
				6.000793650793651, -- [44]
				6.000793650793651, -- [45]
				6.000793650793651, -- [46]
				6.000793650793651, -- [47]
				8.000793650793652, -- [48]
				8.000793650793652, -- [49]
				8.000793650793652, -- [50]
			},
			["LastEvents"] = {
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [1]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [2]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [3]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [4]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [5]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [6]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [7]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [8]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [9]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [10]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [11]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [12]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [13]
				"Всадник без головы Колун всадника Mazdaqq Hit -1580 (Physical)", -- [14]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [15]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [16]
				"Slysweetelf Гнев Всадник без головы Immune (Nature)", -- [17]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [18]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [19]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [20]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [21]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [22]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [23]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [24]
				"Saluma Удар героя Всадник без головы Immune (Physical)", -- [25]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [26]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [27]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [28]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [29]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [30]
				"Pucifall Воровская честь Всадник без головы Immune (Physical)", -- [31]
				"Yodakompota Укус змеи Всадник без головы Immune (Nature)", -- [32]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [33]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [34]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [35]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [36]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [37]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [38]
				"Slysweetelf Лунный огонь Всадник без головы Immune (Arcane)", -- [39]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [40]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [41]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [42]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [43]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [44]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [45]
				"Mazdaqq Озноб Всадник без головы Immune (Frost)", -- [46]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [47]
				"Yodakompota Автоматическая стрельба Всадник без головы Immune (Physical)", -- [48]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [49]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [50]
			},
			["Name"] = "Всадник без головы",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["TimeLast"] = {
				["ActiveTime"] = 1698607195,
				["TimeDamage"] = 1698607195,
				["OVERALL"] = 1698607195,
				["DamageTaken"] = 1698607189,
				["Damage"] = 1698607195,
			},
			["Fights"] = {
				["Fight1"] = {
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Колун всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 7,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.84,
								},
							},
							["amount"] = 11.84,
						},
					},
					["DamageTaken"] = 393187,
					["PartialResist"] = {
						["Вихрь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Звездопад"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 231,
									["amount"] = 0,
								},
							},
							["count"] = 231,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Калечащий яд"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 80,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 0,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Гнев"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Потрошение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар героя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Вихрь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Звездопад"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 231,
									["amount"] = 0,
								},
							},
							["count"] = 231,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Калечащий яд"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 80,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 0,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Гнев"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Потрошение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар героя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 18.84,
					["ElementTaken"] = {
						["Physical"] = 184143,
						["Melee"] = 88066,
						["Arcane"] = 10645,
						["Frost"] = 16287,
						["Shadow"] = 34105,
						["Nature"] = 59941,
					},
					["Damage"] = 10193,
					["ElementTakenBlock"] = {
						["Melee"] = 120,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Melee"] = 8613,
						["Physical"] = 1580,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 100,
								},
								["Hit"] = {
									["count"] = 49,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 22,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 176,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 12,
								},
								["Immune"] = {
									["count"] = 118,
								},
								["Hit"] = {
									["count"] = 68,
								},
								["Crit"] = {
									["count"] = 28,
								},
								["Miss"] = {
									["count"] = 5,
								},
							},
							["amount"] = 231,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 38,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 23,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 43,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 18.84,
					["WhoDamaged"] = {
						["Pucifall"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30269,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2558,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 5396,
								},
								["Кровоизлияние"] = {
									["count"] = 12182,
								},
								["Внезапный удар"] = {
									["count"] = 13322,
								},
								["Удар в спину"] = {
									["count"] = 21806,
								},
							},
							["amount"] = 85533,
						},
						["Yodakompota"] = {
							["Details"] = {
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 972,
								},
								["Укус змеи (УЗВ)"] = {
									["count"] = 1952,
								},
								["Глушащий выстрел"] = {
									["count"] = 3291,
								},
								["Выстрел химеры"] = {
									["count"] = 21245,
								},
								["Автоматическая стрельба"] = {
									["count"] = 25234,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 2541,
								},
							},
							["amount"] = 55235,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9031,
								},
								["Цапнуть"] = {
									["count"] = 6785,
								},
							},
							["amount"] = 15816,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 24298,
								},
							},
							["amount"] = 24298,
						},
						["Slysweetelf"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 9837,
								},
								["Лунный огонь"] = {
									["count"] = 808,
								},
								["Гнев"] = {
									["count"] = 4509,
								},
							},
							["amount"] = 15154,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 6819,
								},
								["Удар Плети"] = {
									["count"] = 3392,
								},
								["Ледяное прикосновение"] = {
									["count"] = 8521,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7766,
								},
								["Кровавый удар"] = {
									["count"] = 4523,
								},
								["Атака ближнего боя"] = {
									["count"] = 24679,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 150,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 2751,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 1821,
								},
								["Удар чумы"] = {
									["count"] = 7309,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6522,
								},
								["Лик смерти"] = {
									["count"] = 15521,
								},
								["Некроз"] = {
									["count"] = 3272,
								},
							},
							["amount"] = 93046,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10535,
								},
								["Цапнуть"] = {
									["count"] = 6136,
								},
							},
							["amount"] = 16671,
						},
						["Charli <Yodakompota>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1138,
								},
								["Укус"] = {
									["count"] = 533,
								},
							},
							["amount"] = 1671,
						},
						["Saluma"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12414,
								},
								["Удар героя"] = {
									["count"] = 25029,
								},
								["Кровожадность"] = {
									["count"] = 8607,
								},
								["Вихрь"] = {
									["count"] = 39519,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 85763,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 2698,
									["min"] = 1111,
									["count"] = 4,
									["amount"] = 8613,
								},
							},
							["count"] = 5,
							["amount"] = 8613,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1580,
									["min"] = 1580,
									["count"] = 1,
									["amount"] = 1580,
								},
							},
							["count"] = 1,
							["amount"] = 1580,
						},
					},
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Колун всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 7,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.84,
								},
							},
							["amount"] = 11.84,
						},
					},
					["DamagedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1111,
								},
								["Колун всадника"] = {
									["count"] = 1580,
								},
							},
							["amount"] = 2691,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7502,
								},
							},
							["amount"] = 7502,
						},
					},
				},
				["LastFightData"] = {
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Колун всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 7,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.84,
								},
							},
							["amount"] = 11.84,
						},
					},
					["DamageTaken"] = 393187,
					["PartialResist"] = {
						["Вихрь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Звездопад"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 231,
									["amount"] = 0,
								},
							},
							["count"] = 231,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Калечащий яд"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 80,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 0,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Гнев"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Потрошение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар героя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Вихрь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Звездопад"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 231,
									["amount"] = 0,
								},
							},
							["count"] = 231,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Калечащий яд"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 80,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 0,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Гнев"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Потрошение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар героя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 18.84,
					["ElementTaken"] = {
						["Physical"] = 184143,
						["Melee"] = 88066,
						["Arcane"] = 10645,
						["Frost"] = 16287,
						["Shadow"] = 34105,
						["Nature"] = 59941,
					},
					["Damage"] = 10193,
					["ElementTakenBlock"] = {
						["Melee"] = 120,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Melee"] = 8613,
						["Physical"] = 1580,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 100,
								},
								["Hit"] = {
									["count"] = 49,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 22,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 176,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 12,
								},
								["Immune"] = {
									["count"] = 118,
								},
								["Hit"] = {
									["count"] = 68,
								},
								["Crit"] = {
									["count"] = 28,
								},
								["Miss"] = {
									["count"] = 5,
								},
							},
							["amount"] = 231,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 38,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 23,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 43,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 18.84,
					["WhoDamaged"] = {
						["Pucifall"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30269,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2558,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 5396,
								},
								["Кровоизлияние"] = {
									["count"] = 12182,
								},
								["Внезапный удар"] = {
									["count"] = 13322,
								},
								["Удар в спину"] = {
									["count"] = 21806,
								},
							},
							["amount"] = 85533,
						},
						["Yodakompota"] = {
							["Details"] = {
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 972,
								},
								["Укус змеи (УЗВ)"] = {
									["count"] = 1952,
								},
								["Глушащий выстрел"] = {
									["count"] = 3291,
								},
								["Выстрел химеры"] = {
									["count"] = 21245,
								},
								["Автоматическая стрельба"] = {
									["count"] = 25234,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 2541,
								},
							},
							["amount"] = 55235,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9031,
								},
								["Цапнуть"] = {
									["count"] = 6785,
								},
							},
							["amount"] = 15816,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 24298,
								},
							},
							["amount"] = 24298,
						},
						["Slysweetelf"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 9837,
								},
								["Лунный огонь"] = {
									["count"] = 808,
								},
								["Гнев"] = {
									["count"] = 4509,
								},
							},
							["amount"] = 15154,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 6819,
								},
								["Удар Плети"] = {
									["count"] = 3392,
								},
								["Ледяное прикосновение"] = {
									["count"] = 8521,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7766,
								},
								["Кровавый удар"] = {
									["count"] = 4523,
								},
								["Атака ближнего боя"] = {
									["count"] = 24679,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 150,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 2751,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 1821,
								},
								["Удар чумы"] = {
									["count"] = 7309,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6522,
								},
								["Лик смерти"] = {
									["count"] = 15521,
								},
								["Некроз"] = {
									["count"] = 3272,
								},
							},
							["amount"] = 93046,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10535,
								},
								["Цапнуть"] = {
									["count"] = 6136,
								},
							},
							["amount"] = 16671,
						},
						["Charli <Yodakompota>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1138,
								},
								["Укус"] = {
									["count"] = 533,
								},
							},
							["amount"] = 1671,
						},
						["Saluma"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12414,
								},
								["Удар героя"] = {
									["count"] = 25029,
								},
								["Кровожадность"] = {
									["count"] = 8607,
								},
								["Вихрь"] = {
									["count"] = 39519,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 85763,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 2698,
									["min"] = 1111,
									["count"] = 4,
									["amount"] = 8613,
								},
							},
							["count"] = 5,
							["amount"] = 8613,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1580,
									["min"] = 1580,
									["count"] = 1,
									["amount"] = 1580,
								},
							},
							["count"] = 1,
							["amount"] = 1580,
						},
					},
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Колун всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 7,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.84,
								},
							},
							["amount"] = 11.84,
						},
					},
					["DamagedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1111,
								},
								["Колун всадника"] = {
									["count"] = 1580,
								},
							},
							["amount"] = 2691,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7502,
								},
							},
							["amount"] = 7502,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Колун всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 7,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.84,
								},
							},
							["amount"] = 11.84,
						},
					},
					["DamageTaken"] = 393187,
					["PartialResist"] = {
						["Вихрь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Звездопад"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 231,
									["amount"] = 0,
								},
							},
							["count"] = 231,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Калечащий яд"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 80,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 0,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Гнев"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Потрошение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар героя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Вихрь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Звездопад"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 231,
									["amount"] = 0,
								},
							},
							["count"] = 231,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Калечащий яд"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Укус"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 80,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 0,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Гнев"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Потрошение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар героя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 18.84,
					["ElementTaken"] = {
						["Physical"] = 184143,
						["Melee"] = 88066,
						["Arcane"] = 10645,
						["Frost"] = 16287,
						["Shadow"] = 34105,
						["Nature"] = 59941,
					},
					["Damage"] = 10193,
					["ElementTakenBlock"] = {
						["Melee"] = 120,
						["Physical"] = 40,
					},
					["ElementDone"] = {
						["Melee"] = 8613,
						["Physical"] = 1580,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 100,
								},
								["Hit"] = {
									["count"] = 49,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 22,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 176,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 12,
								},
								["Immune"] = {
									["count"] = 118,
								},
								["Hit"] = {
									["count"] = 68,
								},
								["Crit"] = {
									["count"] = 28,
								},
								["Miss"] = {
									["count"] = 5,
								},
							},
							["amount"] = 231,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 38,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 23,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 43,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 18.84,
					["WhoDamaged"] = {
						["Pucifall"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30269,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2558,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 5396,
								},
								["Кровоизлияние"] = {
									["count"] = 12182,
								},
								["Внезапный удар"] = {
									["count"] = 13322,
								},
								["Удар в спину"] = {
									["count"] = 21806,
								},
							},
							["amount"] = 85533,
						},
						["Yodakompota"] = {
							["Details"] = {
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 972,
								},
								["Укус змеи (УЗВ)"] = {
									["count"] = 1952,
								},
								["Глушащий выстрел"] = {
									["count"] = 3291,
								},
								["Выстрел химеры"] = {
									["count"] = 21245,
								},
								["Автоматическая стрельба"] = {
									["count"] = 25234,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 2541,
								},
							},
							["amount"] = 55235,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9031,
								},
								["Цапнуть"] = {
									["count"] = 6785,
								},
							},
							["amount"] = 15816,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 24298,
								},
							},
							["amount"] = 24298,
						},
						["Slysweetelf"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 9837,
								},
								["Лунный огонь"] = {
									["count"] = 808,
								},
								["Гнев"] = {
									["count"] = 4509,
								},
							},
							["amount"] = 15154,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 6819,
								},
								["Удар Плети"] = {
									["count"] = 3392,
								},
								["Ледяное прикосновение"] = {
									["count"] = 8521,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7766,
								},
								["Кровавый удар"] = {
									["count"] = 4523,
								},
								["Атака ближнего боя"] = {
									["count"] = 24679,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 150,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 2751,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 1821,
								},
								["Удар чумы"] = {
									["count"] = 7309,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6522,
								},
								["Лик смерти"] = {
									["count"] = 15521,
								},
								["Некроз"] = {
									["count"] = 3272,
								},
							},
							["amount"] = 93046,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10535,
								},
								["Цапнуть"] = {
									["count"] = 6136,
								},
							},
							["amount"] = 16671,
						},
						["Charli <Yodakompota>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1138,
								},
								["Укус"] = {
									["count"] = 533,
								},
							},
							["amount"] = 1671,
						},
						["Saluma"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12414,
								},
								["Удар героя"] = {
									["count"] = 25029,
								},
								["Кровожадность"] = {
									["count"] = 8607,
								},
								["Вихрь"] = {
									["count"] = 39519,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 85763,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 2698,
									["min"] = 1111,
									["count"] = 4,
									["amount"] = 8613,
								},
							},
							["count"] = 5,
							["amount"] = 8613,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1580,
									["min"] = 1580,
									["count"] = 1,
									["amount"] = 1580,
								},
							},
							["count"] = 1,
							["amount"] = 1580,
						},
					},
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Колун всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 7,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.84,
								},
							},
							["amount"] = 11.84,
						},
					},
					["DamagedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1111,
								},
								["Колун всадника"] = {
									["count"] = 1580,
								},
							},
							["amount"] = 2691,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7502,
								},
							},
							["amount"] = 7502,
						},
					},
				},
			},
			["UnitLockout"] = 1698607194,
			["LastActive"] = 1698607195,
		},
		["Pucifall"] = {
			["GUID"] = "0x070000000039CD33",
			["LastEventHealth"] = {
				"30296 (100%)", -- [1]
				"30296 (100%)", -- [2]
				"30296 (100%)", -- [3]
				"30296 (100%)", -- [4]
				"30296 (100%)", -- [5]
				"30296 (100%)", -- [6]
				"30296 (100%)", -- [7]
				"30296 (100%)", -- [8]
				"30296 (100%)", -- [9]
				"30296 (100%)", -- [10]
				"30296 (100%)", -- [11]
				"30296 (100%)", -- [12]
				"30296 (100%)", -- [13]
				"30296 (100%)", -- [14]
				"30296 (100%)", -- [15]
				"30296 (100%)", -- [16]
				"30296 (100%)", -- [17]
				"30296 (100%)", -- [18]
				"30296 (100%)", -- [19]
				"30296 (100%)", -- [20]
				"30296 (100%)", -- [21]
				"30296 (100%)", -- [22]
				"30296 (100%)", -- [23]
				"30296 (100%)", -- [24]
				"30296 (100%)", -- [25]
				"30296 (100%)", -- [26]
				"30296 (100%)", -- [27]
				"30296 (100%)", -- [28]
				"30296 (100%)", -- [29]
				"30296 (100%)", -- [30]
				"30296 (100%)", -- [31]
				"30296 (100%)", -- [32]
				"30296 (100%)", -- [33]
				"30296 (100%)", -- [34]
				"30296 (100%)", -- [35]
				"30296 (100%)", -- [36]
				"30296 (100%)", -- [37]
				"30296 (100%)", -- [38]
				"30296 (100%)", -- [39]
				"30296 (100%)", -- [40]
				"30296 (100%)", -- [41]
				"30296 (100%)", -- [42]
				"30296 (100%)", -- [43]
				"30296 (100%)", -- [44]
				"30296 (100%)", -- [45]
				"30296 (100%)", -- [46]
				"30296 (100%)", -- [47]
				"30296 (100%)", -- [48]
				"30296 (100%)", -- [49]
				"30296 (100%)", -- [50]
			},
			["LastEventType"] = {
				"HEAL", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"HEAL", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"HEAL", -- [24]
				"HEAL", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"HEAL", -- [34]
				"DAMAGE", -- [35]
				"HEAL", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"HEAL", -- [44]
				"DAMAGE", -- [45]
				"HEAL", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					65, -- [1]
				},
				["ActiveTime"] = {
					31.78000000000001, -- [1]
				},
				["TimeDamage"] = {
					31.78000000000001, -- [1]
				},
				["DOT_Time"] = {
					6, -- [1]
				},
				["Damage"] = {
					85533, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "Pucifall",
			["level"] = 80,
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				3.759572220755215, -- [1]
				[44] = 6.353974121996303,
				[36] = 3.759572220755215,
				[14] = 6.353974121996303,
				[17] = 3.759572220755215,
				[46] = 3.756271454977555,
				[25] = 3.756271454977555,
				[34] = 6.353974121996303,
				[24] = 6.357274887773964,
			},
			["type"] = "Ungrouped",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["Owner"] = false,
			["LastEventTimes"] = {
				12966.037, -- [1]
				12966.77, -- [2]
				12951.467, -- [3]
				12951.468, -- [4]
				12951.468, -- [5]
				12951.686, -- [6]
				12951.686, -- [7]
				12951.822, -- [8]
				12952.616, -- [9]
				12952.95, -- [10]
				12952.95, -- [11]
				12953.383, -- [12]
				12953.383, -- [13]
				12953.821, -- [14]
				12953.821, -- [15]
				12953.822, -- [16]
				12954.075, -- [17]
				12954.076, -- [18]
				12954.92, -- [19]
				12955.283, -- [20]
				12955.808, -- [21]
				12955.968, -- [22]
				12956.321, -- [23]
				12956.891, -- [24]
				12956.988, -- [25]
				12956.988, -- [26]
				12957.571, -- [27]
				12957.921, -- [28]
				12958.065, -- [29]
				12958.065, -- [30]
				12958.711, -- [31]
				12959.251, -- [32]
				12959.251, -- [33]
				12959.835, -- [34]
				12959.925, -- [35]
				12960.026, -- [36]
				12960.026, -- [37]
				12960.258, -- [38]
				12961.426, -- [39]
				12961.614, -- [40]
				12961.754, -- [41]
				12962.034, -- [42]
				12962.034, -- [43]
				12962.837, -- [44]
				12962.838, -- [45]
				12962.998, -- [46]
				12963.359, -- [47]
				12963.621, -- [48]
				12963.904, -- [49]
				12964.163, -- [50]
			},
			["NextEventNum"] = 3,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Slysweetelf Восстановление Pucifall Tick +1139 (1139 избыт. лечение)", -- [1]
				"Pucifall Воровская честь Всадник без головы Immune (Physical)", -- [2]
				"Pucifall Засада Всадник без головы Immune (Physical)", -- [3]
				"Pucifall Удар в спину Всадник без головы Crit -7294 (Physical)", -- [4]
				"Pucifall Нейтрализующий яд VII Всадник без головы Hit -674 (Nature)", -- [5]
				"Pucifall Калечащий яд Всадник без головы Immune (Nature)", -- [6]
				"Pucifall Атака ближнего боя Всадник без головы Crit -1176 (Physical)", -- [7]
				"Pucifall Рваная рана (УЗВ) Всадник без головы Tick -836 (Physical)", -- [8]
				"Pucifall Атака ближнего боя Всадник без головы Miss", -- [9]
				"Pucifall Калечащий яд Всадник без головы Immune (Nature)", -- [10]
				"Pucifall Атака ближнего боя Всадник без головы Crit -1147 (Physical)", -- [11]
				"Pucifall Потрошение Всадник без головы Immune (Physical)", -- [12]
				"Pucifall Нейтрализующий яд VII Всадник без головы Immune (Nature)", -- [13]
				"Slysweetelf Омоложение Pucifall Tick +1925 (1925 избыт. лечение)", -- [14]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [15]
				"Pucifall Рваная рана Всадник без головы Immune (Physical)", -- [16]
				"Slysweetelf Восстановление Pucifall Tick +1139 (1139 избыт. лечение)", -- [17]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [18]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [19]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [20]
				"Pucifall Рваная рана Всадник без головы Immune (Physical)", -- [21]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [22]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [23]
				"Slysweetelf Омоложение Pucifall Tick +1926 (1926 избыт. лечение)", -- [24]
				"Slysweetelf Восстановление Pucifall Tick +1138 (1138 избыт. лечение)", -- [25]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [26]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [27]
				"Pucifall Рваная рана Всадник без головы Immune (Physical)", -- [28]
				"Pucifall Воровская честь Всадник без головы Immune (Physical)", -- [29]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [30]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [31]
				"Pucifall Калечащий яд Всадник без головы Immune (Nature)", -- [32]
				"Pucifall Атака ближнего боя Всадник без головы Crit -1271 (Physical)", -- [33]
				"Slysweetelf Омоложение Pucifall Tick +1925 (1925 избыт. лечение)", -- [34]
				"Pucifall Удар в спину Всадник без головы Dodge (Physical)", -- [35]
				"Slysweetelf Восстановление Pucifall Tick +1139 (1139 избыт. лечение)", -- [36]
				"Pucifall Атака ближнего боя Всадник без головы Crit -3201 (Physical)", -- [37]
				"Pucifall Атака ближнего боя Всадник без головы Glancing -633 (Physical)", -- [38]
				"Pucifall Атака ближнего боя Всадник без головы Crit -1444 (Physical)", -- [39]
				"Pucifall Атака ближнего боя Всадник без головы Crit -3337 (Physical)", -- [40]
				"Pucifall Нейтрализующий яд VII Всадник без головы Hit -734 (Nature)", -- [41]
				"Pucifall Засада Всадник без головы Immune (Physical)", -- [42]
				"Pucifall Удар в спину Всадник без головы Crit -7801 (Physical)", -- [43]
				"Slysweetelf Омоложение Pucifall Tick +1925 (1925 избыт. лечение)", -- [44]
				"Pucifall Атака ближнего боя Всадник без головы Crit -1299 (Physical)", -- [45]
				"Slysweetelf Восстановление Pucifall Tick +1138 (1138 избыт. лечение)", -- [46]
				"Pucifall Атака ближнего боя Всадник без головы Crit -3250 (Physical)", -- [47]
				"Pucifall Нейтрализующий яд VII Всадник без головы Hit -734 (Nature)", -- [48]
				"Pucifall Кровоизлияние Всадник без головы Crit -7144 (Physical)", -- [49]
				"Pucifall Атака ближнего боя Всадник без головы Immune", -- [50]
			},
			["Name"] = "Pucifall",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["TimeLast"] = {
				["EnergyGain"] = 1698607181,
				["ActiveTime"] = 1698607192,
				["TimeDamage"] = 1698607192,
				["OVERALL"] = 1698607192,
				["DOT_Time"] = 1698607177,
				["Damage"] = 1698607189,
			},
			["Fights"] = {
				["Fight1"] = {
					["DOTs"] = {
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["EnergyGained"] = {
						["Маленькие хитрости"] = {
							["Details"] = {
								["Pucifall"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["Эффект неослабевающих ударов"] = {
							["Details"] = {
								["Pucifall"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
					},
					["ElementDone"] = {
						["Physical"] = 49868,
						["Melee"] = 30269,
						["Nature"] = 5396,
					},
					["TimeSpent"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Калечащий яд"] = {
									["count"] = 2.4,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 1.23,
								},
								["Потрошение"] = {
									["count"] = 0.43,
								},
								["Засада"] = {
									["count"] = 4.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 15.44,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.39,
								},
								["Воровская честь"] = {
									["count"] = 2.99,
								},
								["Жестокость"] = {
									["count"] = 0.38,
								},
								["Внезапный удар"] = {
									["count"] = 0,
								},
								["Кровоизлияние"] = {
									["count"] = 1.13,
								},
								["Рваная рана"] = {
									["count"] = 1.61,
								},
								["Удар в спину"] = {
									["count"] = 0.9500000000000001,
								},
							},
							["amount"] = 31.78000000000001,
						},
					},
					["Attacks"] = {
						["Калечащий яд"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 734,
									["min"] = 645,
									["count"] = 8,
									["amount"] = 5396,
								},
							},
							["count"] = 9,
							["amount"] = 5396,
						},
						["Потрошение"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 1483,
									["min"] = 633,
									["count"] = 3,
									["amount"] = 3485,
								},
								["Immune"] = {
									["count"] = 20,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 3337,
									["min"] = 1128,
									["count"] = 14,
									["amount"] = 26784,
								},
								["Miss"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 40,
							["amount"] = 30269,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1722,
									["min"] = 1722,
									["count"] = 1,
									["amount"] = 1722,
								},
								["Tick"] = {
									["max"] = 836,
									["min"] = 836,
									["count"] = 1,
									["amount"] = 836,
								},
							},
							["count"] = 2,
							["amount"] = 2558,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 13322,
									["min"] = 13322,
									["count"] = 1,
									["amount"] = 13322,
								},
							},
							["count"] = 1,
							["amount"] = 13322,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7144,
									["min"] = 5038,
									["count"] = 2,
									["amount"] = 12182,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 12182,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7801,
									["min"] = 6711,
									["count"] = 3,
									["amount"] = 21806,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 21806,
						},
					},
					["DamagedWho"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30269,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2558,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 5396,
								},
								["Кровоизлияние"] = {
									["count"] = 12182,
								},
								["Внезапный удар"] = {
									["count"] = 13322,
								},
								["Удар в спину"] = {
									["count"] = 21806,
								},
							},
							["amount"] = 85533,
						},
					},
					["EnergyGain"] = 65,
					["ActiveTime"] = 31.78000000000001,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 26,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 14,
								},
								["Miss"] = {
									["count"] = 3,
								},
							},
							["amount"] = 40,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
					},
					["TimeDamage"] = 31.78000000000001,
					["TimeDamaging"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Калечащий яд"] = {
									["count"] = 2.4,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 1.23,
								},
								["Потрошение"] = {
									["count"] = 0.43,
								},
								["Засада"] = {
									["count"] = 4.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 15.44,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.39,
								},
								["Воровская честь"] = {
									["count"] = 2.99,
								},
								["Жестокость"] = {
									["count"] = 0.38,
								},
								["Внезапный удар"] = {
									["count"] = 0,
								},
								["Кровоизлияние"] = {
									["count"] = 1.13,
								},
								["Рваная рана"] = {
									["count"] = 1.61,
								},
								["Удар в спину"] = {
									["count"] = 0.9500000000000001,
								},
							},
							["amount"] = 31.78000000000001,
						},
					},
					["EnergyGainedFrom"] = {
						["Pucifall"] = {
							["Details"] = {
								["Маленькие хитрости"] = {
									["count"] = 15,
								},
								["Эффект неослабевающих ударов"] = {
									["count"] = 50,
								},
							},
							["amount"] = 65,
						},
					},
					["DOT_Time"] = 6,
					["Damage"] = 85533,
				},
				["LastFightData"] = {
					["DOTs"] = {
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["EnergyGained"] = {
						["Маленькие хитрости"] = {
							["Details"] = {
								["Pucifall"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["Эффект неослабевающих ударов"] = {
							["Details"] = {
								["Pucifall"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
					},
					["ElementDone"] = {
						["Physical"] = 49868,
						["Melee"] = 30269,
						["Nature"] = 5396,
					},
					["TimeSpent"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Калечащий яд"] = {
									["count"] = 2.4,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 1.23,
								},
								["Потрошение"] = {
									["count"] = 0.43,
								},
								["Засада"] = {
									["count"] = 4.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 15.44,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.39,
								},
								["Воровская честь"] = {
									["count"] = 2.99,
								},
								["Жестокость"] = {
									["count"] = 0.38,
								},
								["Внезапный удар"] = {
									["count"] = 0,
								},
								["Кровоизлияние"] = {
									["count"] = 1.13,
								},
								["Рваная рана"] = {
									["count"] = 1.61,
								},
								["Удар в спину"] = {
									["count"] = 0.9500000000000001,
								},
							},
							["amount"] = 31.78000000000001,
						},
					},
					["Attacks"] = {
						["Калечащий яд"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 734,
									["min"] = 645,
									["count"] = 8,
									["amount"] = 5396,
								},
							},
							["count"] = 9,
							["amount"] = 5396,
						},
						["Потрошение"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 1483,
									["min"] = 633,
									["count"] = 3,
									["amount"] = 3485,
								},
								["Immune"] = {
									["count"] = 20,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 3337,
									["min"] = 1128,
									["count"] = 14,
									["amount"] = 26784,
								},
								["Miss"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 40,
							["amount"] = 30269,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1722,
									["min"] = 1722,
									["count"] = 1,
									["amount"] = 1722,
								},
								["Tick"] = {
									["max"] = 836,
									["min"] = 836,
									["count"] = 1,
									["amount"] = 836,
								},
							},
							["count"] = 2,
							["amount"] = 2558,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 13322,
									["min"] = 13322,
									["count"] = 1,
									["amount"] = 13322,
								},
							},
							["count"] = 1,
							["amount"] = 13322,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7144,
									["min"] = 5038,
									["count"] = 2,
									["amount"] = 12182,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 12182,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7801,
									["min"] = 6711,
									["count"] = 3,
									["amount"] = 21806,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 21806,
						},
					},
					["DamagedWho"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30269,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2558,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 5396,
								},
								["Кровоизлияние"] = {
									["count"] = 12182,
								},
								["Внезапный удар"] = {
									["count"] = 13322,
								},
								["Удар в спину"] = {
									["count"] = 21806,
								},
							},
							["amount"] = 85533,
						},
					},
					["EnergyGain"] = 65,
					["ActiveTime"] = 31.78000000000001,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 26,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 14,
								},
								["Miss"] = {
									["count"] = 3,
								},
							},
							["amount"] = 40,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
					},
					["TimeDamage"] = 31.78000000000001,
					["TimeDamaging"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Калечащий яд"] = {
									["count"] = 2.4,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 1.23,
								},
								["Потрошение"] = {
									["count"] = 0.43,
								},
								["Засада"] = {
									["count"] = 4.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 15.44,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.39,
								},
								["Воровская честь"] = {
									["count"] = 2.99,
								},
								["Жестокость"] = {
									["count"] = 0.38,
								},
								["Внезапный удар"] = {
									["count"] = 0,
								},
								["Кровоизлияние"] = {
									["count"] = 1.13,
								},
								["Рваная рана"] = {
									["count"] = 1.61,
								},
								["Удар в спину"] = {
									["count"] = 0.9500000000000001,
								},
							},
							["amount"] = 31.78000000000001,
						},
					},
					["EnergyGainedFrom"] = {
						["Pucifall"] = {
							["Details"] = {
								["Маленькие хитрости"] = {
									["count"] = 15,
								},
								["Эффект неослабевающих ударов"] = {
									["count"] = 50,
								},
							},
							["amount"] = 65,
						},
					},
					["DOT_Time"] = 6,
					["Damage"] = 85533,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["EnergyGained"] = {
						["Маленькие хитрости"] = {
							["Details"] = {
								["Pucifall"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["Эффект неослабевающих ударов"] = {
							["Details"] = {
								["Pucifall"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
					},
					["ElementDone"] = {
						["Physical"] = 49868,
						["Melee"] = 30269,
						["Nature"] = 5396,
					},
					["TimeSpent"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Калечащий яд"] = {
									["count"] = 2.4,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 1.23,
								},
								["Потрошение"] = {
									["count"] = 0.43,
								},
								["Засада"] = {
									["count"] = 4.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 15.44,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.39,
								},
								["Воровская честь"] = {
									["count"] = 2.99,
								},
								["Жестокость"] = {
									["count"] = 0.38,
								},
								["Внезапный удар"] = {
									["count"] = 0,
								},
								["Кровоизлияние"] = {
									["count"] = 1.13,
								},
								["Рваная рана"] = {
									["count"] = 1.61,
								},
								["Удар в спину"] = {
									["count"] = 0.9500000000000001,
								},
							},
							["amount"] = 31.78000000000001,
						},
					},
					["Attacks"] = {
						["Калечащий яд"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Нейтрализующий яд VII"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 734,
									["min"] = 645,
									["count"] = 8,
									["amount"] = 5396,
								},
							},
							["count"] = 9,
							["amount"] = 5396,
						},
						["Потрошение"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Засада"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 1483,
									["min"] = 633,
									["count"] = 3,
									["amount"] = 3485,
								},
								["Immune"] = {
									["count"] = 20,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 3337,
									["min"] = 1128,
									["count"] = 14,
									["amount"] = 26784,
								},
								["Miss"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 40,
							["amount"] = 30269,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1722,
									["min"] = 1722,
									["count"] = 1,
									["amount"] = 1722,
								},
								["Tick"] = {
									["max"] = 836,
									["min"] = 836,
									["count"] = 1,
									["amount"] = 836,
								},
							},
							["count"] = 2,
							["amount"] = 2558,
						},
						["Воровская честь"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жестокость"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Внезапный удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 13322,
									["min"] = 13322,
									["count"] = 1,
									["amount"] = 13322,
								},
							},
							["count"] = 1,
							["amount"] = 13322,
						},
						["Кровоизлияние"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7144,
									["min"] = 5038,
									["count"] = 2,
									["amount"] = 12182,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 12182,
						},
						["Рваная рана"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар в спину"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7801,
									["min"] = 6711,
									["count"] = 3,
									["amount"] = 21806,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 21806,
						},
					},
					["DamagedWho"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30269,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2558,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 5396,
								},
								["Кровоизлияние"] = {
									["count"] = 12182,
								},
								["Внезапный удар"] = {
									["count"] = 13322,
								},
								["Удар в спину"] = {
									["count"] = 21806,
								},
							},
							["amount"] = 85533,
						},
					},
					["EnergyGain"] = 65,
					["ActiveTime"] = 31.78000000000001,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 26,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 14,
								},
								["Miss"] = {
									["count"] = 3,
								},
							},
							["amount"] = 40,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
					},
					["TimeDamage"] = 31.78000000000001,
					["TimeDamaging"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Калечащий яд"] = {
									["count"] = 2.4,
								},
								["Нейтрализующий яд VII"] = {
									["count"] = 1.23,
								},
								["Потрошение"] = {
									["count"] = 0.43,
								},
								["Засада"] = {
									["count"] = 4.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 15.44,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.39,
								},
								["Воровская честь"] = {
									["count"] = 2.99,
								},
								["Жестокость"] = {
									["count"] = 0.38,
								},
								["Внезапный удар"] = {
									["count"] = 0,
								},
								["Кровоизлияние"] = {
									["count"] = 1.13,
								},
								["Рваная рана"] = {
									["count"] = 1.61,
								},
								["Удар в спину"] = {
									["count"] = 0.9500000000000001,
								},
							},
							["amount"] = 31.78000000000001,
						},
					},
					["EnergyGainedFrom"] = {
						["Pucifall"] = {
							["Details"] = {
								["Маленькие хитрости"] = {
									["count"] = 15,
								},
								["Эффект неослабевающих ударов"] = {
									["count"] = 50,
								},
							},
							["amount"] = 65,
						},
					},
					["DOT_Time"] = 6,
					["Damage"] = 85533,
				},
			},
			["UnitLockout"] = 1698607154,
			["LastActive"] = 1698607192,
		},
		["Yodakompota"] = {
			["GUID"] = "0x0700000000017340",
			["LastEventHealth"] = {
				"24679 (100%)", -- [1]
				"24679 (100%)", -- [2]
				"24679 (100%)", -- [3]
				"24679 (100%)", -- [4]
				"24679 (100%)", -- [5]
				"24679 (100%)", -- [6]
				"24679 (100%)", -- [7]
				"24679 (100%)", -- [8]
				"24679 (100%)", -- [9]
				"24679 (100%)", -- [10]
				"24679 (100%)", -- [11]
				"24679 (100%)", -- [12]
				"24679 (100%)", -- [13]
				"24679 (100%)", -- [14]
				"24679 (100%)", -- [15]
				"24679 (100%)", -- [16]
				"24679 (100%)", -- [17]
				"24679 (100%)", -- [18]
				"24679 (100%)", -- [19]
				"24679 (100%)", -- [20]
				"24679 (100%)", -- [21]
				"24679 (100%)", -- [22]
				"24679 (100%)", -- [23]
				"24679 (100%)", -- [24]
				"24679 (100%)", -- [25]
				"24679 (100%)", -- [26]
				"24679 (100%)", -- [27]
				"24679 (100%)", -- [28]
				"24679 (100%)", -- [29]
				"24679 (100%)", -- [30]
				"24679 (100%)", -- [31]
				"24679 (100%)", -- [32]
				"24679 (100%)", -- [33]
				"24679 (100%)", -- [34]
				"24679 (100%)", -- [35]
				"24679 (100%)", -- [36]
				"24679 (100%)", -- [37]
				"24679 (100%)", -- [38]
				"24679 (100%)", -- [39]
				"24679 (100%)", -- [40]
				"24679 (100%)", -- [41]
				"24679 (100%)", -- [42]
				"24679 (100%)", -- [43]
				"24679 (100%)", -- [44]
				"24679 (100%)", -- [45]
				"24679 (100%)", -- [46]
				"24679 (100%)", -- [47]
				"24679 (100%)", -- [48]
			},
			["LastEventType"] = {
				"HEAL", -- [1]
				"HEAL", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"HEAL", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"HEAL", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"HEAL", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"HEAL", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"HEAL", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"HEAL", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					32.36000000000001, -- [1]
				},
				["Damage"] = {
					73567, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["ActiveTime"] = {
					32.36000000000001, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = "Yodakompota",
			["level"] = 80,
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				7.439523481502492, -- [1]
				7.439523481502492, -- [2]
				7.443575509542526, -- [3]
				[13] = 7.439523481502492,
				[40] = 7.804206005105556,
				[44] = 7.800153977065522,
				[16] = 7.800153977065522,
				[35] = 7.804206005105556,
				[28] = 7.804206005105556,
				[5] = 7.439523481502492,
				[21] = 7.804206005105556,
				[9] = 7.439523481502492,
			},
			["type"] = "Ungrouped",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["LastEventTimes"] = {
				12930.422, -- [1]
				12933.351, -- [2]
				12936.288, -- [3]
				12939.281, -- [4]
				12939.405, -- [5]
				12940.859, -- [6]
				12941.817, -- [7]
				12941.97, -- [8]
				12942.488, -- [9]
				12942.603, -- [10]
				12943.478, -- [11]
				12944.069, -- [12]
				12945.31, -- [13]
				12946.274, -- [14]
				12946.546, -- [15]
				12949.358, -- [16]
				12949.497, -- [17]
				12950.617, -- [18]
				12951.821, -- [19]
				12952.316, -- [20]
				12952.316, -- [21]
				12952.453, -- [22]
				12952.839, -- [23]
				12952.951, -- [24]
				12953.822, -- [25]
				12954.844, -- [26]
				12954.921, -- [27]
				12955.282, -- [28]
				12955.585, -- [29]
				12955.968, -- [30]
				12956.891, -- [31]
				12957.737, -- [32]
				12957.921, -- [33]
				12958.065, -- [34]
				12958.3, -- [35]
				12958.585, -- [36]
				12958.837, -- [37]
				12959.85, -- [38]
				12961.051, -- [39]
				12961.426, -- [40]
				12963.902, -- [41]
				12963.905, -- [42]
				12964.162, -- [43]
				12964.351, -- [44]
				12964.679, -- [45]
				12965.558, -- [46]
				12966.773, -- [47]
				12968.158, -- [48]
			},
			["Owner"] = false,
			["Pet"] = {
				"Charli <Yodakompota>", -- [1]
			},
			["NextEventNum"] = 49,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
			},
			["LastEvents"] = {
				"Slysweetelf Омоложение Yodakompota Tick +1836 (1836 избыт. лечение)", -- [1]
				"Slysweetelf Омоложение Yodakompota Tick +1836 (1836 избыт. лечение)", -- [2]
				"Slysweetelf Омоложение Yodakompota Tick +1837 (1837 избыт. лечение)", -- [3]
				"Yodakompota Автоматическая стрельба Всадник без головы Crit -5761 (Physical)", -- [4]
				"Slysweetelf Омоложение Yodakompota Tick +1836 (1836 избыт. лечение)", -- [5]
				"Yodakompota Глушащий выстрел Всадник без головы Crit -3291 (Physical)", -- [6]
				"Yodakompota Автоматическая стрельба Всадник без головы Hit -3002 (Physical)", -- [7]
				"Yodakompota Выстрел химеры Всадник без головы Hit -4255 (Nature)", -- [8]
				"Slysweetelf Омоложение Yodakompota Tick +1836 (1836 избыт. лечение)", -- [9]
				"Yodakompota Выстрел химеры - змея Всадник без головы Immune (Nature)", -- [10]
				"Yodakompota Укус змеи Всадник без головы Immune (Nature)", -- [11]
				"Yodakompota Автоматическая стрельба Всадник без головы Immune (Physical)", -- [12]
				"Slysweetelf Омоложение Yodakompota Tick +1836 (1836 избыт. лечение)", -- [13]
				"Yodakompota Автоматическая стрельба Голова Всадника Crit -6896 (Physical)", -- [14]
				"Yodakompota Укус змеи Всадник без головы Immune (Nature)", -- [15]
				"Slysweetelf Омоложение Yodakompota Tick +1925 (1925 избыт. лечение)", -- [16]
				"Yodakompota Укус змеи (УЗВ) Всадник без головы Tick -908 (Nature)", -- [17]
				"Yodakompota Автоматическая стрельба Всадник без головы Crit -7152 (Physical)", -- [18]
				"Yodakompota Выстрел химеры Всадник без головы Crit -12971 (Nature)", -- [19]
				"Yodakompota Выстрел химеры - змея Всадник без головы Hit -2541 (Nature)", -- [20]
				"Slysweetelf Омоложение Yodakompota Tick +1926 (1926 избыт. лечение)", -- [21]
				"Yodakompota Укус змеи (УЗВ) Всадник без головы Tick -1044 (Nature)", -- [22]
				"Yodakompota Автоматическая стрельба Всадник без головы Crit -6608 (Physical)", -- [23]
				"Yodakompota Пронзающие выстрелы (УЗВ) Всадник без головы Tick -486 (Physical)", -- [24]
				"Yodakompota Пронзающие выстрелы Всадник без головы Immune (Physical)", -- [25]
				"Yodakompota Автоматическая стрельба Всадник без головы Immune (Physical)", -- [26]
				"Yodakompota Пронзающие выстрелы Всадник без головы Immune (Physical)", -- [27]
				"Slysweetelf Омоложение Yodakompota Tick +1926 (1926 избыт. лечение)", -- [28]
				"Yodakompota Укус змеи Всадник без головы Immune (Nature)", -- [29]
				"Yodakompota Пронзающие выстрелы Всадник без головы Immune (Physical)", -- [30]
				"Yodakompota Пронзающие выстрелы Всадник без головы Immune (Physical)", -- [31]
				"Yodakompota Автоматическая стрельба Голова Всадника Crit -5891 (Physical)", -- [32]
				"Yodakompota Пронзающие выстрелы Всадник без головы Immune (Physical)", -- [33]
				"Yodakompota Мятежная стрела - автоматическая стрельба Голова Всадника Crit -5545 (Nature)", -- [34]
				"Slysweetelf Омоложение Yodakompota Tick +1926 (1926 избыт. лечение)", -- [35]
				"Yodakompota Укус змеи Всадник без головы Immune (Nature)", -- [36]
				"Yodakompota Пронзающие выстрелы Всадник без головы Immune (Physical)", -- [37]
				"Yodakompota Пронзающие выстрелы (УЗВ) Всадник без головы Tick -486 (Physical)", -- [38]
				"Yodakompota Автоматическая стрельба Всадник без головы Hit -2711 (Physical)", -- [39]
				"Slysweetelf Омоложение Yodakompota Tick +1926 (1926 избыт. лечение)", -- [40]
				"Yodakompota Выстрел химеры Всадник без головы Hit -4019 (Nature)", -- [41]
				"Yodakompota Укус змеи Всадник без головы Immune (Nature)", -- [42]
				"Yodakompota Выстрел химеры - змея Всадник без головы Immune (Nature)", -- [43]
				"Slysweetelf Омоложение Yodakompota Tick +1925 (1925 избыт. лечение)", -- [44]
				"Yodakompota Глушащий выстрел Всадник без головы Immune (Physical)", -- [45]
				"Yodakompota Автоматическая стрельба Всадник без головы Immune (Physical)", -- [46]
				"Yodakompota Укус змеи Всадник без головы Immune (Nature)", -- [47]
				"Yodakompota Автоматическая стрельба Всадник без головы Immune (Physical)", -- [48]
			},
			["Name"] = "Yodakompota",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
			},
			["TimeLast"] = {
				["ActiveTime"] = 1698607193,
				["TimeDamage"] = 1698607193,
				["OVERALL"] = 1698607193,
				["DOT_Time"] = 1698607185,
				["Damage"] = 1698607189,
			},
			["Fights"] = {
				["Fight1"] = {
					["DOTs"] = {
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 3.05,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 0.14,
								},
							},
							["amount"] = 3.19,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Укус змеи (УЗВ)"] = {
									["count"] = 3.09,
								},
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 1.12,
								},
								["Пронзающие выстрелы"] = {
									["count"] = 2.68,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 1.39,
								},
								["Укус змеи"] = {
									["count"] = 3.55,
								},
								["Глушащий выстрел"] = {
									["count"] = 2.1,
								},
								["Автоматическая стрельба"] = {
									["count"] = 11.04,
								},
								["Выстрел химеры"] = {
									["count"] = 4.2,
								},
							},
							["amount"] = 29.17,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementDone"] = {
						["Nature"] = 31283,
						["Physical"] = 42284,
					},
					["ActiveTime"] = 32.36000000000001,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 12787,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 5545,
								},
							},
							["amount"] = 18332,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 972,
								},
								["Укус змеи (УЗВ)"] = {
									["count"] = 1952,
								},
								["Глушащий выстрел"] = {
									["count"] = 3291,
								},
								["Выстрел химеры"] = {
									["count"] = 21245,
								},
								["Автоматическая стрельба"] = {
									["count"] = 25234,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 2541,
								},
							},
							["amount"] = 55235,
						},
					},
					["TimeDamage"] = 32.36000000000001,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 3.05,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 0.14,
								},
							},
							["amount"] = 3.19,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Укус змеи (УЗВ)"] = {
									["count"] = 3.09,
								},
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 1.12,
								},
								["Пронзающие выстрелы"] = {
									["count"] = 2.68,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 1.39,
								},
								["Укус змеи"] = {
									["count"] = 3.55,
								},
								["Глушащий выстрел"] = {
									["count"] = 2.1,
								},
								["Автоматическая стрельба"] = {
									["count"] = 11.04,
								},
								["Выстрел химеры"] = {
									["count"] = 4.2,
								},
							},
							["amount"] = 29.17,
						},
					},
					["Attacks"] = {
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 486,
									["min"] = 486,
									["count"] = 2,
									["amount"] = 972,
								},
							},
							["count"] = 2,
							["amount"] = 972,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7152,
									["min"] = 5761,
									["count"] = 5,
									["amount"] = 32308,
								},
								["Hit"] = {
									["max"] = 3002,
									["min"] = 2711,
									["count"] = 2,
									["amount"] = 5713,
								},
							},
							["count"] = 11,
							["amount"] = 38021,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1044,
									["min"] = 908,
									["count"] = 2,
									["amount"] = 1952,
								},
							},
							["count"] = 2,
							["amount"] = 1952,
						},
						["Мятежная стрела - автоматическая стрельба"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5545,
									["min"] = 5545,
									["count"] = 1,
									["amount"] = 5545,
								},
							},
							["count"] = 1,
							["amount"] = 5545,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3291,
									["min"] = 3291,
									["count"] = 1,
									["amount"] = 3291,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 3291,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2541,
									["min"] = 2541,
									["count"] = 1,
									["amount"] = 2541,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 2541,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 12971,
									["min"] = 12971,
									["count"] = 1,
									["amount"] = 12971,
								},
								["Hit"] = {
									["max"] = 4255,
									["min"] = 4019,
									["count"] = 2,
									["amount"] = 8274,
								},
							},
							["count"] = 3,
							["amount"] = 21245,
						},
					},
					["DOT_Time"] = 12,
					["Damage"] = 73567,
				},
				["LastFightData"] = {
					["DOTs"] = {
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 3.05,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 0.14,
								},
							},
							["amount"] = 3.19,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Укус змеи (УЗВ)"] = {
									["count"] = 3.09,
								},
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 1.12,
								},
								["Пронзающие выстрелы"] = {
									["count"] = 2.68,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 1.39,
								},
								["Укус змеи"] = {
									["count"] = 3.55,
								},
								["Глушащий выстрел"] = {
									["count"] = 2.1,
								},
								["Автоматическая стрельба"] = {
									["count"] = 11.04,
								},
								["Выстрел химеры"] = {
									["count"] = 4.2,
								},
							},
							["amount"] = 29.17,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementDone"] = {
						["Nature"] = 31283,
						["Physical"] = 42284,
					},
					["ActiveTime"] = 32.36000000000001,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 12787,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 5545,
								},
							},
							["amount"] = 18332,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 972,
								},
								["Укус змеи (УЗВ)"] = {
									["count"] = 1952,
								},
								["Глушащий выстрел"] = {
									["count"] = 3291,
								},
								["Выстрел химеры"] = {
									["count"] = 21245,
								},
								["Автоматическая стрельба"] = {
									["count"] = 25234,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 2541,
								},
							},
							["amount"] = 55235,
						},
					},
					["TimeDamage"] = 32.36000000000001,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 3.05,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 0.14,
								},
							},
							["amount"] = 3.19,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Укус змеи (УЗВ)"] = {
									["count"] = 3.09,
								},
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 1.12,
								},
								["Пронзающие выстрелы"] = {
									["count"] = 2.68,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 1.39,
								},
								["Укус змеи"] = {
									["count"] = 3.55,
								},
								["Глушащий выстрел"] = {
									["count"] = 2.1,
								},
								["Автоматическая стрельба"] = {
									["count"] = 11.04,
								},
								["Выстрел химеры"] = {
									["count"] = 4.2,
								},
							},
							["amount"] = 29.17,
						},
					},
					["Attacks"] = {
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 486,
									["min"] = 486,
									["count"] = 2,
									["amount"] = 972,
								},
							},
							["count"] = 2,
							["amount"] = 972,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7152,
									["min"] = 5761,
									["count"] = 5,
									["amount"] = 32308,
								},
								["Hit"] = {
									["max"] = 3002,
									["min"] = 2711,
									["count"] = 2,
									["amount"] = 5713,
								},
							},
							["count"] = 11,
							["amount"] = 38021,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1044,
									["min"] = 908,
									["count"] = 2,
									["amount"] = 1952,
								},
							},
							["count"] = 2,
							["amount"] = 1952,
						},
						["Мятежная стрела - автоматическая стрельба"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5545,
									["min"] = 5545,
									["count"] = 1,
									["amount"] = 5545,
								},
							},
							["count"] = 1,
							["amount"] = 5545,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3291,
									["min"] = 3291,
									["count"] = 1,
									["amount"] = 3291,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 3291,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2541,
									["min"] = 2541,
									["count"] = 1,
									["amount"] = 2541,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 2541,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 12971,
									["min"] = 12971,
									["count"] = 1,
									["amount"] = 12971,
								},
								["Hit"] = {
									["max"] = 4255,
									["min"] = 4019,
									["count"] = 2,
									["amount"] = 8274,
								},
							},
							["count"] = 3,
							["amount"] = 21245,
						},
					},
					["DOT_Time"] = 12,
					["Damage"] = 73567,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 3.05,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 0.14,
								},
							},
							["amount"] = 3.19,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Укус змеи (УЗВ)"] = {
									["count"] = 3.09,
								},
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 1.12,
								},
								["Пронзающие выстрелы"] = {
									["count"] = 2.68,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 1.39,
								},
								["Укус змеи"] = {
									["count"] = 3.55,
								},
								["Глушащий выстрел"] = {
									["count"] = 2.1,
								},
								["Автоматическая стрельба"] = {
									["count"] = 11.04,
								},
								["Выстрел химеры"] = {
									["count"] = 4.2,
								},
							},
							["amount"] = 29.17,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementDone"] = {
						["Nature"] = 31283,
						["Physical"] = 42284,
					},
					["ActiveTime"] = 32.36000000000001,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 12787,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 5545,
								},
							},
							["amount"] = 18332,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 972,
								},
								["Укус змеи (УЗВ)"] = {
									["count"] = 1952,
								},
								["Глушащий выстрел"] = {
									["count"] = 3291,
								},
								["Выстрел химеры"] = {
									["count"] = 21245,
								},
								["Автоматическая стрельба"] = {
									["count"] = 25234,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 2541,
								},
							},
							["amount"] = 55235,
						},
					},
					["TimeDamage"] = 32.36000000000001,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Автоматическая стрельба"] = {
									["count"] = 3.05,
								},
								["Мятежная стрела - автоматическая стрельба"] = {
									["count"] = 0.14,
								},
							},
							["amount"] = 3.19,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Укус змеи (УЗВ)"] = {
									["count"] = 3.09,
								},
								["Пронзающие выстрелы (УЗВ)"] = {
									["count"] = 1.12,
								},
								["Пронзающие выстрелы"] = {
									["count"] = 2.68,
								},
								["Выстрел химеры - змея"] = {
									["count"] = 1.39,
								},
								["Укус змеи"] = {
									["count"] = 3.55,
								},
								["Глушащий выстрел"] = {
									["count"] = 2.1,
								},
								["Автоматическая стрельба"] = {
									["count"] = 11.04,
								},
								["Выстрел химеры"] = {
									["count"] = 4.2,
								},
							},
							["amount"] = 29.17,
						},
					},
					["Attacks"] = {
						["Пронзающие выстрелы (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 486,
									["min"] = 486,
									["count"] = 2,
									["amount"] = 972,
								},
							},
							["count"] = 2,
							["amount"] = 972,
						},
						["Пронзающие выстрелы"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Укус змеи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Автоматическая стрельба"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7152,
									["min"] = 5761,
									["count"] = 5,
									["amount"] = 32308,
								},
								["Hit"] = {
									["max"] = 3002,
									["min"] = 2711,
									["count"] = 2,
									["amount"] = 5713,
								},
							},
							["count"] = 11,
							["amount"] = 38021,
						},
						["Укус змеи (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1044,
									["min"] = 908,
									["count"] = 2,
									["amount"] = 1952,
								},
							},
							["count"] = 2,
							["amount"] = 1952,
						},
						["Мятежная стрела - автоматическая стрельба"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5545,
									["min"] = 5545,
									["count"] = 1,
									["amount"] = 5545,
								},
							},
							["count"] = 1,
							["amount"] = 5545,
						},
						["Глушащий выстрел"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3291,
									["min"] = 3291,
									["count"] = 1,
									["amount"] = 3291,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 3291,
						},
						["Выстрел химеры - змея"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2541,
									["min"] = 2541,
									["count"] = 1,
									["amount"] = 2541,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 2541,
						},
						["Выстрел химеры"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 12971,
									["min"] = 12971,
									["count"] = 1,
									["amount"] = 12971,
								},
								["Hit"] = {
									["max"] = 4255,
									["min"] = 4019,
									["count"] = 2,
									["amount"] = 8274,
								},
							},
							["count"] = 3,
							["amount"] = 21245,
						},
					},
					["DOT_Time"] = 12,
					["Damage"] = 73567,
				},
			},
			["UnitLockout"] = 1698607155,
			["LastActive"] = 1698607193,
		},
		["Войско мертвых <Mazdaqq>"] = {
			["GUID"] = "0xF130005E8F00008D",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"???", -- [4]
				"???", -- [5]
				"???", -- [6]
				"???", -- [7]
				"???", -- [8]
				"???", -- [9]
				"???", -- [10]
				"???", -- [11]
				"???", -- [12]
				"???", -- [13]
				"???", -- [14]
				"???", -- [15]
				"???", -- [16]
				"???", -- [17]
				"???", -- [18]
				"???", -- [19]
				"???", -- [20]
				"???", -- [21]
				"???", -- [22]
				"???", -- [23]
				"???", -- [24]
				"???", -- [25]
				"???", -- [26]
				"???", -- [27]
				"???", -- [28]
				"???", -- [29]
				"???", -- [30]
				"???", -- [31]
				"???", -- [32]
				"???", -- [33]
				"???", -- [34]
				"???", -- [35]
				"???", -- [36]
				"???", -- [37]
				"???", -- [38]
				"???", -- [39]
				"???", -- [40]
				"???", -- [41]
				"???", -- [42]
				"???", -- [43]
				"???", -- [44]
				"???", -- [45]
				"???", -- [46]
				"???", -- [47]
				"???", -- [48]
				"???", -- [49]
				"???", -- [50]
			},
			["LastAttackedBy"] = "Всадник без головы",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					36.00999999999999, -- [1]
				},
				["Damage"] = {
					19279, -- [1]
				},
				["DamageTaken"] = {
					7502, -- [1]
				},
				["ActiveTime"] = {
					36.00999999999999, -- [1]
				},
			},
			["enClass"] = "PET",
			["LastDamageTaken"] = 2698,
			["level"] = 1,
			["LastDamageAbility"] = "Атака ближнего боя",
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["Owner"] = "Mazdaqq",
			["LastEventTimes"] = {
				12964.028, -- [1]
				12964.029, -- [2]
				12964.029, -- [3]
				12964.163, -- [4]
				12964.163, -- [5]
				12964.163, -- [6]
				12964.721, -- [7]
				12964.721, -- [8]
				12964.906, -- [9]
				12965.003, -- [10]
				12965.384, -- [11]
				12965.386, -- [12]
				12965.505, -- [13]
				12965.657, -- [14]
				12965.658, -- [15]
				12965.659, -- [16]
				12965.774, -- [17]
				12965.775, -- [18]
				12965.775, -- [19]
				12966.296, -- [20]
				12966.453, -- [21]
				12967.013, -- [22]
				12967.168, -- [23]
				12967.168, -- [24]
				12967.388, -- [25]
				12967.388, -- [26]
				12967.587, -- [27]
				12968.648, -- [28]
				12968.759, -- [29]
				12968.906, -- [30]
				12969.002, -- [31]
				12969.107, -- [32]
				12969.108, -- [33]
				12969.259, -- [34]
				12961.053, -- [35]
				12961.053, -- [36]
				12961.053, -- [37]
				12961.254, -- [38]
				12961.428, -- [39]
				12961.755, -- [40]
				12961.757, -- [41]
				12962.036, -- [42]
				12962.281, -- [43]
				12962.409, -- [44]
				12962.411, -- [45]
				12962.504, -- [46]
				12962.504, -- [47]
				12962.656, -- [48]
				12963.13, -- [49]
				12963.907, -- [50]
			},
			["NextEventNum"] = 35,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				0, -- [4]
				0, -- [5]
				0, -- [6]
				0, -- [7]
				0, -- [8]
				0, -- [9]
				0, -- [10]
				0, -- [11]
				0, -- [12]
				0, -- [13]
				0, -- [14]
				0, -- [15]
				0, -- [16]
				0, -- [17]
				0, -- [18]
				0, -- [19]
				0, -- [20]
				0, -- [21]
				0, -- [22]
				0, -- [23]
				0, -- [24]
				0, -- [25]
				0, -- [26]
				0, -- [27]
				0, -- [28]
				0, -- [29]
				0, -- [30]
				0, -- [31]
				0, -- [32]
				0, -- [33]
				0, -- [34]
				0, -- [35]
				0, -- [36]
				0, -- [37]
				0, -- [38]
				0, -- [39]
				0, -- [40]
				0, -- [41]
				0, -- [42]
				0, -- [43]
				0, -- [44]
				0, -- [45]
				0, -- [46]
				0, -- [47]
				0, -- [48]
				0, -- [49]
				0, -- [50]
			},
			["LastEvents"] = {
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [1]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [2]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [3]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [4]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [5]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [6]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [7]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [8]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [9]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [10]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [11]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [12]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [13]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [14]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [15]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [16]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [17]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [18]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [19]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [20]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [21]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [22]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [23]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [24]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [25]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [26]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [27]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [28]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [29]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [30]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [31]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [32]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [33]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [34]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -125 (Physical)", -- [35]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -133 (Physical)", -- [36]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -173 (Physical)", -- [37]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -191 (Physical)", -- [38]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -130 (Physical)", -- [39]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -193 (Physical)", -- [40]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -193 (Physical)", -- [41]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -182 (Physical)", -- [42]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -119 (Physical)", -- [43]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -134 (Physical)", -- [44]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -114 (Physical)", -- [45]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -274 (Physical)", -- [46]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -137 (Physical)", -- [47]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -116 (Physical)", -- [48]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -115 (Physical)", -- [49]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [50]
			},
			["Name"] = "Войско мертвых",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["TimeLast"] = {
				["ActiveTime"] = 1698607194,
				["TimeDamage"] = 1698607194,
				["OVERALL"] = 1698607194,
				["DamageTaken"] = 1698607176,
				["Damage"] = 1698607188,
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 120,
						["Physical"] = 70,
					},
					["ElementDone"] = {
						["Melee"] = 10851,
						["Physical"] = 8428,
					},
					["TimeSpent"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.39,
								},
								["Цапнуть"] = {
									["count"] = 0.8900000000000001,
								},
							},
							["amount"] = 3.28,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.27999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.45,
								},
							},
							["amount"] = 32.73,
						},
					},
					["DamagedWho"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1820,
								},
								["Цапнуть"] = {
									["count"] = 1643,
								},
							},
							["amount"] = 3463,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9031,
								},
								["Цапнуть"] = {
									["count"] = 6785,
								},
							},
							["amount"] = 15816,
						},
					},
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7502,
								},
							},
							["amount"] = 7502,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 11,
						},
					},
					["DamageTaken"] = 7502,
					["TimeDamage"] = 36.00999999999999,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 137,
									["min"] = 114,
									["count"] = 8,
									["amount"] = 982,
								},
								["Immune"] = {
									["count"] = 73,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 138,
									["min"] = 80,
									["count"] = 3,
									["amount"] = 308,
								},
								["Hit"] = {
									["max"] = 198,
									["min"] = 114,
									["count"] = 56,
									["amount"] = 7119,
								},
								["Crit"] = {
									["max"] = 392,
									["min"] = 230,
									["count"] = 8,
									["amount"] = 2442,
								},
							},
							["count"] = 148,
							["amount"] = 10851,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 36,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 257,
									["min"] = 149,
									["count"] = 2,
									["amount"] = 406,
								},
								["Hit"] = {
									["max"] = 293,
									["min"] = 171,
									["count"] = 34,
									["amount"] = 6563,
								},
								["Crit"] = {
									["max"] = 592,
									["min"] = 366,
									["count"] = 2,
									["amount"] = 958,
								},
								["Crit (Блокировано)"] = {
									["max"] = 501,
									["min"] = 501,
									["count"] = 1,
									["amount"] = 501,
								},
							},
							["count"] = 75,
							["amount"] = 8428,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 73,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 59,
								},
							},
							["amount"] = 148,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 36,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 36,
								},
							},
							["amount"] = 75,
						},
					},
					["ActiveTime"] = 36.00999999999999,
					["TimeDamaging"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.39,
								},
								["Цапнуть"] = {
									["count"] = 0.8900000000000001,
								},
							},
							["amount"] = 3.28,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.27999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.45,
								},
							},
							["amount"] = 32.73,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 7502,
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
					},
					["Damage"] = 19279,
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 120,
						["Physical"] = 70,
					},
					["ElementDone"] = {
						["Melee"] = 10851,
						["Physical"] = 8428,
					},
					["TimeSpent"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.39,
								},
								["Цапнуть"] = {
									["count"] = 0.8900000000000001,
								},
							},
							["amount"] = 3.28,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.27999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.45,
								},
							},
							["amount"] = 32.73,
						},
					},
					["DamagedWho"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1820,
								},
								["Цапнуть"] = {
									["count"] = 1643,
								},
							},
							["amount"] = 3463,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9031,
								},
								["Цапнуть"] = {
									["count"] = 6785,
								},
							},
							["amount"] = 15816,
						},
					},
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7502,
								},
							},
							["amount"] = 7502,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 11,
						},
					},
					["DamageTaken"] = 7502,
					["TimeDamage"] = 36.00999999999999,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 137,
									["min"] = 114,
									["count"] = 8,
									["amount"] = 982,
								},
								["Immune"] = {
									["count"] = 73,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 138,
									["min"] = 80,
									["count"] = 3,
									["amount"] = 308,
								},
								["Hit"] = {
									["max"] = 198,
									["min"] = 114,
									["count"] = 56,
									["amount"] = 7119,
								},
								["Crit"] = {
									["max"] = 392,
									["min"] = 230,
									["count"] = 8,
									["amount"] = 2442,
								},
							},
							["count"] = 148,
							["amount"] = 10851,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 36,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 257,
									["min"] = 149,
									["count"] = 2,
									["amount"] = 406,
								},
								["Hit"] = {
									["max"] = 293,
									["min"] = 171,
									["count"] = 34,
									["amount"] = 6563,
								},
								["Crit"] = {
									["max"] = 592,
									["min"] = 366,
									["count"] = 2,
									["amount"] = 958,
								},
								["Crit (Блокировано)"] = {
									["max"] = 501,
									["min"] = 501,
									["count"] = 1,
									["amount"] = 501,
								},
							},
							["count"] = 75,
							["amount"] = 8428,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 73,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 59,
								},
							},
							["amount"] = 148,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 36,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 36,
								},
							},
							["amount"] = 75,
						},
					},
					["ActiveTime"] = 36.00999999999999,
					["TimeDamaging"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.39,
								},
								["Цапнуть"] = {
									["count"] = 0.8900000000000001,
								},
							},
							["amount"] = 3.28,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.27999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.45,
								},
							},
							["amount"] = 32.73,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 7502,
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
					},
					["Damage"] = 19279,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 120,
						["Physical"] = 70,
					},
					["ElementDone"] = {
						["Melee"] = 10851,
						["Physical"] = 8428,
					},
					["TimeSpent"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.39,
								},
								["Цапнуть"] = {
									["count"] = 0.8900000000000001,
								},
							},
							["amount"] = 3.28,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.27999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.45,
								},
							},
							["amount"] = 32.73,
						},
					},
					["DamagedWho"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1820,
								},
								["Цапнуть"] = {
									["count"] = 1643,
								},
							},
							["amount"] = 3463,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9031,
								},
								["Цапнуть"] = {
									["count"] = 6785,
								},
							},
							["amount"] = 15816,
						},
					},
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7502,
								},
							},
							["amount"] = 7502,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 11,
						},
					},
					["DamageTaken"] = 7502,
					["TimeDamage"] = 36.00999999999999,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 137,
									["min"] = 114,
									["count"] = 8,
									["amount"] = 982,
								},
								["Immune"] = {
									["count"] = 73,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 138,
									["min"] = 80,
									["count"] = 3,
									["amount"] = 308,
								},
								["Hit"] = {
									["max"] = 198,
									["min"] = 114,
									["count"] = 56,
									["amount"] = 7119,
								},
								["Crit"] = {
									["max"] = 392,
									["min"] = 230,
									["count"] = 8,
									["amount"] = 2442,
								},
							},
							["count"] = 148,
							["amount"] = 10851,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 36,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 257,
									["min"] = 149,
									["count"] = 2,
									["amount"] = 406,
								},
								["Hit"] = {
									["max"] = 293,
									["min"] = 171,
									["count"] = 34,
									["amount"] = 6563,
								},
								["Crit"] = {
									["max"] = 592,
									["min"] = 366,
									["count"] = 2,
									["amount"] = 958,
								},
								["Crit (Блокировано)"] = {
									["max"] = 501,
									["min"] = 501,
									["count"] = 1,
									["amount"] = 501,
								},
							},
							["count"] = 75,
							["amount"] = 8428,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 73,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 59,
								},
							},
							["amount"] = 148,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 36,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 36,
								},
							},
							["amount"] = 75,
						},
					},
					["ActiveTime"] = 36.00999999999999,
					["TimeDamaging"] = {
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.39,
								},
								["Цапнуть"] = {
									["count"] = 0.8900000000000001,
								},
							},
							["amount"] = 3.28,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.27999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.45,
								},
							},
							["amount"] = 32.73,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 7502,
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
					},
					["Damage"] = 19279,
				},
			},
			["UnitLockout"] = 1698607194,
			["LastActive"] = 1698607194,
		},
		["Вороная горгулья <Mazdaqq>"] = {
			["GUID"] = "0xF130006CB5000095",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"???", -- [4]
				"???", -- [5]
				"???", -- [6]
				"???", -- [7]
				"???", -- [8]
				"???", -- [9]
				"???", -- [10]
				"???", -- [11]
				"???", -- [12]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
			},
			["TimeWindows"] = {
				["Damage"] = {
					24298, -- [1]
				},
				["TimeDamage"] = {
					22.36, -- [1]
				},
				["ActiveTime"] = {
					22.36, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["Owner"] = "Mazdaqq",
			["LastEventTimes"] = {
				12951.079, -- [1]
				12952.844, -- [2]
				12954.927, -- [3]
				12956.456, -- [4]
				12958.185, -- [5]
				12959.684, -- [6]
				12961.429, -- [7]
				12963.001, -- [8]
				12964.892, -- [9]
				12966.567, -- [10]
				12968.427, -- [11]
				12969.941, -- [12]
			},
			["NextEventNum"] = 13,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				0, -- [4]
				0, -- [5]
				0, -- [6]
				0, -- [7]
				0, -- [8]
				0, -- [9]
				0, -- [10]
				0, -- [11]
				0, -- [12]
			},
			["LastEvents"] = {
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -4847 (Nature)", -- [1]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -4843 (Nature)", -- [2]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [3]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [4]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [5]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -4872 (Nature)", -- [6]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -4860 (Nature)", -- [7]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -4876 (Nature)", -- [8]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [9]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [10]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [11]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [12]
			},
			["Name"] = "Вороная горгулья",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
			},
			["TimeLast"] = {
				["Damage"] = 1698607188,
				["OVERALL"] = 1698607195,
				["TimeDamage"] = 1698607195,
				["ActiveTime"] = 1698607195,
			},
			["Fights"] = {
				["Fight1"] = {
					["TimeSpent"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 22.36,
								},
							},
							["amount"] = 22.36,
						},
					},
					["ElementDone"] = {
						["Nature"] = 24298,
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 12,
						},
					},
					["DamagedWho"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 24298,
								},
							},
							["amount"] = 24298,
						},
					},
					["TimeDamage"] = 22.36,
					["TimeDamaging"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 22.36,
								},
							},
							["amount"] = 22.36,
						},
					},
					["Attacks"] = {
						["Удар горгульи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 4876,
									["min"] = 4843,
									["count"] = 5,
									["amount"] = 24298,
								},
							},
							["count"] = 12,
							["amount"] = 24298,
						},
					},
					["ActiveTime"] = 22.36,
					["Damage"] = 24298,
				},
				["LastFightData"] = {
					["TimeSpent"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 22.36,
								},
							},
							["amount"] = 22.36,
						},
					},
					["ElementDone"] = {
						["Nature"] = 24298,
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 12,
						},
					},
					["DamagedWho"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 24298,
								},
							},
							["amount"] = 24298,
						},
					},
					["TimeDamage"] = 22.36,
					["TimeDamaging"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 22.36,
								},
							},
							["amount"] = 22.36,
						},
					},
					["Attacks"] = {
						["Удар горгульи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 4876,
									["min"] = 4843,
									["count"] = 5,
									["amount"] = 24298,
								},
							},
							["count"] = 12,
							["amount"] = 24298,
						},
					},
					["ActiveTime"] = 22.36,
					["Damage"] = 24298,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 22.36,
								},
							},
							["amount"] = 22.36,
						},
					},
					["ElementDone"] = {
						["Nature"] = 24298,
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 12,
						},
					},
					["DamagedWho"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 24298,
								},
							},
							["amount"] = 24298,
						},
					},
					["TimeDamage"] = 22.36,
					["TimeDamaging"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 22.36,
								},
							},
							["amount"] = 22.36,
						},
					},
					["Attacks"] = {
						["Удар горгульи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 4876,
									["min"] = 4843,
									["count"] = 5,
									["amount"] = 24298,
								},
							},
							["count"] = 12,
							["amount"] = 24298,
						},
					},
					["ActiveTime"] = 22.36,
					["Damage"] = 24298,
				},
			},
			["UnitLockout"] = 1698607195,
			["LastActive"] = 1698607195,
		},
		["Slysweetelf"] = {
			["GUID"] = "0x070000000080CF86",
			["LastEventHealth"] = {
				"23233 (100%)", -- [1]
				"23233 (100%)", -- [2]
				"23233 (100%)", -- [3]
				"23233 (100%)", -- [4]
				"23233 (100%)", -- [5]
				"23233 (100%)", -- [6]
				"23233 (100%)", -- [7]
				"23233 (100%)", -- [8]
				"23233 (100%)", -- [9]
				"23233 (100%)", -- [10]
				"23233 (100%)", -- [11]
				"23233 (100%)", -- [12]
				"23233 (100%)", -- [13]
				"23233 (100%)", -- [14]
				"23233 (100%)", -- [15]
				"23233 (100%)", -- [16]
				"23233 (100%)", -- [17]
				"23233 (100%)", -- [18]
				"23233 (100%)", -- [19]
				"23233 (100%)", -- [20]
				"23233 (100%)", -- [21]
				"23233 (100%)", -- [22]
				"23233 (100%)", -- [23]
				"23233 (100%)", -- [24]
				"23233 (100%)", -- [25]
				"23233 (100%)", -- [26]
				"23233 (100%)", -- [27]
				"23233 (100%)", -- [28]
				"23233 (100%)", -- [29]
				"23233 (100%)", -- [30]
				"23233 (100%)", -- [31]
				"23233 (100%)", -- [32]
				"23233 (100%)", -- [33]
				"23233 (100%)", -- [34]
				"23233 (100%)", -- [35]
				"23233 (100%)", -- [36]
				"23233 (100%)", -- [37]
				"23233 (100%)", -- [38]
				"23233 (100%)", -- [39]
				"23233 (100%)", -- [40]
				"23233 (100%)", -- [41]
				"23233 (100%)", -- [42]
				"23233 (100%)", -- [43]
				"23233 (100%)", -- [44]
				"23233 (100%)", -- [45]
				"23233 (100%)", -- [46]
				"23233 (100%)", -- [47]
				"23233 (100%)", -- [48]
				"23233 (100%)", -- [49]
				"23233 (100%)", -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"HEAL", -- [4]
				"HEAL", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"HEAL", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"HEAL", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"HEAL", -- [23]
				"HEAL", -- [24]
				"HEAL", -- [25]
				"HEAL", -- [26]
				"HEAL", -- [27]
				"HEAL", -- [28]
				"HEAL", -- [29]
				"HEAL", -- [30]
				"HEAL", -- [31]
				"HEAL", -- [32]
				"HEAL", -- [33]
				"HEAL", -- [34]
				"HEAL", -- [35]
				"HEAL", -- [36]
				"HEAL", -- [37]
				"HEAL", -- [38]
				"HEAL", -- [39]
				"HEAL", -- [40]
				"DAMAGE", -- [41]
				"HEAL", -- [42]
				"HEAL", -- [43]
				"HEAL", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"HEAL", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["HOT_Time"] = {
					243, -- [1]
				},
				["TimeHeal"] = {
					3.5, -- [1]
				},
				["Overhealing"] = {
					148246, -- [1]
				},
				["ActiveTime"] = {
					17.95, -- [1]
				},
				["Healing"] = {
					1111, -- [1]
				},
				["ManaGain"] = {
					600, -- [1]
				},
				["TimeDamage"] = {
					14.45, -- [1]
				},
				["Damage"] = {
					19827, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = "Slysweetelf",
			["level"] = 80,
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				[19] = 4.898205139241596,
				[12] = 4.902509361683812,
				[44] = 8.289932423707658,
				[38] = 4.902509361683812,
				[50] = 4.898205139241596,
				[27] = 8.285628201265441,
				[30] = 4.898205139241596,
				[35] = 8.285628201265441,
			},
			["type"] = "Ungrouped",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["Owner"] = false,
			["LastEventTimes"] = {
				12962.279, -- [1]
				12962.279, -- [2]
				12962.837, -- [3]
				12962.998, -- [4]
				12962.999, -- [5]
				12963.128, -- [6]
				12963.128, -- [7]
				12964.351, -- [8]
				12964.352, -- [9]
				12964.464, -- [10]
				12964.59, -- [11]
				12964.623, -- [12]
				12965.735, -- [13]
				12966.037, -- [14]
				12966.037, -- [15]
				12967.386, -- [16]
				12967.467, -- [17]
				12967.467, -- [18]
				12952.616, -- [19]
				12953.379, -- [20]
				12953.379, -- [21]
				12953.821, -- [22]
				12953.941, -- [23]
				12954.075, -- [24]
				12954.075, -- [25]
				12954.65, -- [26]
				12954.92, -- [27]
				12955.282, -- [28]
				12955.44, -- [29]
				12955.584, -- [30]
				12956.891, -- [31]
				12956.988, -- [32]
				12956.988, -- [33]
				12957.1, -- [34]
				12958.065, -- [35]
				12958.3, -- [36]
				12958.433, -- [37]
				12958.584, -- [38]
				12959.835, -- [39]
				12959.926, -- [40]
				12960.026, -- [41]
				12960.026, -- [42]
				12960.154, -- [43]
				12961.051, -- [44]
				12961.252, -- [45]
				12961.252, -- [46]
				12961.252, -- [47]
				12961.426, -- [48]
				12961.427, -- [49]
				12961.614, -- [50]
			},
			["NextEventNum"] = 19,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Slysweetelf Звездопад Всадник без головы Hit -2192 (Arcane)", -- [1]
				"Slysweetelf Звездопад Всадник без головы Hit -770 (Arcane)", -- [2]
				"Slysweetelf Омоложение Pucifall Tick +1925 (1925 избыт. лечение)", -- [3]
				"Slysweetelf Восстановление Pucifall Tick +1138 (1138 избыт. лечение)", -- [4]
				"Slysweetelf Омоложение Saluma Tick +1925 (1925 избыт. лечение)", -- [5]
				"Slysweetelf Гнев Всадник без головы Hit -4509 (Nature)", -- [6]
				"Slysweetelf Восстановление Mazdaqq Tick +1138 (1138 избыт. лечение)", -- [7]
				"Slysweetelf Омоложение Yodakompota Tick +1925 (1925 избыт. лечение)", -- [8]
				"Slysweetelf Лунный огонь Всадник без головы Immune (Arcane)", -- [9]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [10]
				"Slysweetelf Гнев Всадник без головы Immune (Nature)", -- [11]
				"Slysweetelf Восстановление Slysweetelf Tick +1139 (1139 избыт. лечение)", -- [12]
				"Slysweetelf Гнев Всадник без головы Immune (Nature)", -- [13]
				"Slysweetelf Восстановление Pucifall Tick +1139 (1139 избыт. лечение)", -- [14]
				"Slysweetelf Омоложение Saluma Tick +1926 (1926 избыт. лечение)", -- [15]
				"Slysweetelf Лунный огонь Всадник без головы Immune (Arcane)", -- [16]
				"Slysweetelf Лунный огонь Голова Всадника Crit -690 (Arcane)", -- [17]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [18]
				"Slysweetelf Восстановление Slysweetelf Tick +1138 (1138 избыт. лечение)", -- [19]
				"Slysweetelf Звездопад Всадник без головы Hit -2303 (Arcane)", -- [20]
				"Slysweetelf Звездопад Всадник без головы Hit -770 (Arcane)", -- [21]
				"Slysweetelf Омоложение Pucifall Tick +1925 (1925 избыт. лечение)", -- [22]
				"Slysweetelf Омоложение Saluma Tick +1925 (1925 избыт. лечение)", -- [23]
				"Slysweetelf Восстановление Mazdaqq Tick +1139 (1139 избыт. лечение)", -- [24]
				"Slysweetelf Восстановление Pucifall Tick +1139 (1139 избыт. лечение)", -- [25]
				"Slysweetelf Омоложение Mazdaqq Tick +1823 (1823 избыт. лечение)", -- [26]
				"Slysweetelf Омоложение Slysweetelf Tick +1925 (1925 избыт. лечение)", -- [27]
				"Slysweetelf Омоложение Yodakompota Tick +1926 (1926 избыт. лечение)", -- [28]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [29]
				"Slysweetelf Восстановление Slysweetelf Tick +1138 (1138 избыт. лечение)", -- [30]
				"Slysweetelf Омоложение Pucifall Tick +1926 (1926 избыт. лечение)", -- [31]
				"Slysweetelf Восстановление Pucifall Tick +1138 (1138 избыт. лечение)", -- [32]
				"Slysweetelf Омоложение Saluma Tick +1926 (1926 избыт. лечение)", -- [33]
				"Slysweetelf Восстановление Mazdaqq Tick +1139 (1139 избыт. лечение)", -- [34]
				"Slysweetelf Омоложение Slysweetelf Tick +1925 (1925 избыт. лечение)", -- [35]
				"Slysweetelf Омоложение Yodakompota Tick +1926 (1926 избыт. лечение)", -- [36]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [37]
				"Slysweetelf Восстановление Slysweetelf Tick +1139 (1139 избыт. лечение)", -- [38]
				"Slysweetelf Омоложение Pucifall Tick +1925 (1925 избыт. лечение)", -- [39]
				"Slysweetelf Омоложение Saluma Tick +1925 (1925 избыт. лечение)", -- [40]
				"Slysweetelf Звездопад Крыса Crit -3983 (Arcane)", -- [41]
				"Slysweetelf Восстановление Pucifall Tick +1139 (1139 избыт. лечение)", -- [42]
				"Slysweetelf Восстановление Mazdaqq Tick +1139 (1139 избыт. лечение)", -- [43]
				"Slysweetelf Омоложение Slysweetelf Tick +1926 (1926 избыт. лечение)", -- [44]
				"Slysweetelf Лунный огонь Всадник без головы Crit -808 (Arcane)", -- [45]
				"Slysweetelf Звездопад Всадник без головы Hit -2263 (Arcane)", -- [46]
				"Slysweetelf Звездопад Всадник без головы Crit -1539 (Arcane)", -- [47]
				"Slysweetelf Омоложение Yodakompota Tick +1926 (1926 избыт. лечение)", -- [48]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [49]
				"Slysweetelf Восстановление Slysweetelf Tick +1138 (1138 избыт. лечение)", -- [50]
			},
			["Name"] = "Slysweetelf",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["TimeLast"] = {
				["TimeHeal"] = 1698607164,
				["Healing"] = 1698607164,
				["ActiveTime"] = 1698607192,
				["Overhealing"] = 1698607192,
				["TimeDamage"] = 1698607192,
				["HOT_Time"] = 1698607192,
				["ManaGain"] = 1698607185,
				["OVERALL"] = 1698607192,
				["Damage"] = 1698607192,
			},
			["Fights"] = {
				["Fight1"] = {
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["OverHeals"] = {
						["Покровительство Природы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5809,
									["min"] = 5809,
									["count"] = 1,
									["amount"] = 5809,
								},
							},
							["count"] = 1,
							["amount"] = 5809,
						},
						["Восстановление"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1139,
									["min"] = 1138,
									["count"] = 27,
									["amount"] = 30744,
								},
								["Crit"] = {
									["max"] = 7147,
									["min"] = 7147,
									["count"] = 1,
									["amount"] = 7147,
								},
								["Hit"] = {
									["max"] = 4693,
									["min"] = 4693,
									["count"] = 1,
									["amount"] = 4693,
								},
							},
							["count"] = 29,
							["amount"] = 42584,
						},
						["Омоложение"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1926,
									["min"] = 712,
									["count"] = 54,
									["amount"] = 99853,
								},
							},
							["count"] = 54,
							["amount"] = 99853,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 4.53,
								},
								["Лунный огонь"] = {
									["count"] = 4.1,
								},
								["Гнев"] = {
									["count"] = 2.24,
								},
							},
							["amount"] = 10.87,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 1111,
						},
					},
					["ManaGained"] = {
						["Восполнение маны"] = {
							["Details"] = {
								["Slysweetelf"] = {
									["count"] = 600,
								},
							},
							["amount"] = 600,
						},
					},
					["HOT_Time"] = 243,
					["ActiveTime"] = 17.95,
					["HOTs"] = {
						["Омоложение"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 24,
								},
								["Slysweetelf"] = {
									["count"] = 24,
								},
								["Pucifall"] = {
									["count"] = 27,
								},
								["Saluma"] = {
									["count"] = 30,
								},
								["Yodakompota"] = {
									["count"] = 27,
								},
								["Limbmasher <Mazdaqq>"] = {
									["count"] = 30,
								},
							},
							["amount"] = 162,
						},
						["Восстановление"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 27,
								},
								["Pucifall"] = {
									["count"] = 27,
								},
								["Slysweetelf"] = {
									["count"] = 27,
								},
							},
							["amount"] = 81,
						},
					},
					["Damage"] = 19827,
					["Heals"] = {
						["Омоложение"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1111,
									["min"] = 1111,
									["count"] = 1,
									["amount"] = 1111,
								},
							},
							["count"] = 1,
							["amount"] = 1111,
						},
					},
					["Healing"] = 1111,
					["Attacks"] = {
						["Звездопад"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3983,
									["min"] = 1539,
									["count"] = 2,
									["amount"] = 5522,
								},
								["Hit"] = {
									["max"] = 2303,
									["min"] = 770,
									["count"] = 5,
									["amount"] = 8298,
								},
							},
							["count"] = 7,
							["amount"] = 13820,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 808,
									["min"] = 690,
									["count"] = 2,
									["amount"] = 1498,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 1498,
						},
						["Гнев"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 4509,
									["min"] = 4509,
									["count"] = 1,
									["amount"] = 4509,
								},
							},
							["count"] = 3,
							["amount"] = 4509,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
					},
					["ElementDone"] = {
						["Nature"] = 4509,
						["Arcane"] = 15318,
					},
					["ManaGainedFrom"] = {
						["Slysweetelf"] = {
							["Details"] = {
								["Восполнение маны"] = {
									["count"] = 600,
								},
							},
							["amount"] = 600,
						},
					},
					["DamagedWho"] = {
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3983,
								},
							},
							["amount"] = 3983,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 9837,
								},
								["Лунный огонь"] = {
									["count"] = 808,
								},
								["Гнев"] = {
									["count"] = 4509,
								},
							},
							["amount"] = 15154,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 690,
								},
							},
							["amount"] = 690,
						},
					},
					["TimeDamage"] = 14.45,
					["TimeDamaging"] = {
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 4.53,
								},
								["Лунный огонь"] = {
									["count"] = 4.1,
								},
								["Гнев"] = {
									["count"] = 2.24,
								},
							},
							["amount"] = 10.87,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
					},
					["ManaGain"] = 600,
					["TimeHeal"] = 3.5,
					["Overhealing"] = 148246,
				},
				["LastFightData"] = {
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["OverHeals"] = {
						["Покровительство Природы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5809,
									["min"] = 5809,
									["count"] = 1,
									["amount"] = 5809,
								},
							},
							["count"] = 1,
							["amount"] = 5809,
						},
						["Восстановление"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1139,
									["min"] = 1138,
									["count"] = 27,
									["amount"] = 30744,
								},
								["Crit"] = {
									["max"] = 7147,
									["min"] = 7147,
									["count"] = 1,
									["amount"] = 7147,
								},
								["Hit"] = {
									["max"] = 4693,
									["min"] = 4693,
									["count"] = 1,
									["amount"] = 4693,
								},
							},
							["count"] = 29,
							["amount"] = 42584,
						},
						["Омоложение"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1926,
									["min"] = 712,
									["count"] = 54,
									["amount"] = 99853,
								},
							},
							["count"] = 54,
							["amount"] = 99853,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 4.53,
								},
								["Лунный огонь"] = {
									["count"] = 4.1,
								},
								["Гнев"] = {
									["count"] = 2.24,
								},
							},
							["amount"] = 10.87,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 1111,
						},
					},
					["ManaGained"] = {
						["Восполнение маны"] = {
							["Details"] = {
								["Slysweetelf"] = {
									["count"] = 600,
								},
							},
							["amount"] = 600,
						},
					},
					["HOT_Time"] = 243,
					["ActiveTime"] = 17.95,
					["HOTs"] = {
						["Омоложение"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 24,
								},
								["Slysweetelf"] = {
									["count"] = 24,
								},
								["Pucifall"] = {
									["count"] = 27,
								},
								["Saluma"] = {
									["count"] = 30,
								},
								["Yodakompota"] = {
									["count"] = 27,
								},
								["Limbmasher <Mazdaqq>"] = {
									["count"] = 30,
								},
							},
							["amount"] = 162,
						},
						["Восстановление"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 27,
								},
								["Pucifall"] = {
									["count"] = 27,
								},
								["Slysweetelf"] = {
									["count"] = 27,
								},
							},
							["amount"] = 81,
						},
					},
					["Damage"] = 19827,
					["Heals"] = {
						["Омоложение"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1111,
									["min"] = 1111,
									["count"] = 1,
									["amount"] = 1111,
								},
							},
							["count"] = 1,
							["amount"] = 1111,
						},
					},
					["Healing"] = 1111,
					["Attacks"] = {
						["Звездопад"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3983,
									["min"] = 1539,
									["count"] = 2,
									["amount"] = 5522,
								},
								["Hit"] = {
									["max"] = 2303,
									["min"] = 770,
									["count"] = 5,
									["amount"] = 8298,
								},
							},
							["count"] = 7,
							["amount"] = 13820,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 808,
									["min"] = 690,
									["count"] = 2,
									["amount"] = 1498,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 1498,
						},
						["Гнев"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 4509,
									["min"] = 4509,
									["count"] = 1,
									["amount"] = 4509,
								},
							},
							["count"] = 3,
							["amount"] = 4509,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
					},
					["ElementDone"] = {
						["Nature"] = 4509,
						["Arcane"] = 15318,
					},
					["ManaGainedFrom"] = {
						["Slysweetelf"] = {
							["Details"] = {
								["Восполнение маны"] = {
									["count"] = 600,
								},
							},
							["amount"] = 600,
						},
					},
					["DamagedWho"] = {
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3983,
								},
							},
							["amount"] = 3983,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 9837,
								},
								["Лунный огонь"] = {
									["count"] = 808,
								},
								["Гнев"] = {
									["count"] = 4509,
								},
							},
							["amount"] = 15154,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 690,
								},
							},
							["amount"] = 690,
						},
					},
					["TimeDamage"] = 14.45,
					["TimeDamaging"] = {
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 4.53,
								},
								["Лунный огонь"] = {
									["count"] = 4.1,
								},
								["Гнев"] = {
									["count"] = 2.24,
								},
							},
							["amount"] = 10.87,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
					},
					["ManaGain"] = 600,
					["TimeHeal"] = 3.5,
					["Overhealing"] = 148246,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["OverHeals"] = {
						["Покровительство Природы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 5809,
									["min"] = 5809,
									["count"] = 1,
									["amount"] = 5809,
								},
							},
							["count"] = 1,
							["amount"] = 5809,
						},
						["Восстановление"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1139,
									["min"] = 1138,
									["count"] = 27,
									["amount"] = 30744,
								},
								["Crit"] = {
									["max"] = 7147,
									["min"] = 7147,
									["count"] = 1,
									["amount"] = 7147,
								},
								["Hit"] = {
									["max"] = 4693,
									["min"] = 4693,
									["count"] = 1,
									["amount"] = 4693,
								},
							},
							["count"] = 29,
							["amount"] = 42584,
						},
						["Омоложение"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1926,
									["min"] = 712,
									["count"] = 54,
									["amount"] = 99853,
								},
							},
							["count"] = 54,
							["amount"] = 99853,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 4.53,
								},
								["Лунный огонь"] = {
									["count"] = 4.1,
								},
								["Гнев"] = {
									["count"] = 2.24,
								},
							},
							["amount"] = 10.87,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 1111,
						},
					},
					["ManaGained"] = {
						["Восполнение маны"] = {
							["Details"] = {
								["Slysweetelf"] = {
									["count"] = 600,
								},
							},
							["amount"] = 600,
						},
					},
					["HOT_Time"] = 243,
					["ActiveTime"] = 17.95,
					["HOTs"] = {
						["Омоложение"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 24,
								},
								["Slysweetelf"] = {
									["count"] = 24,
								},
								["Pucifall"] = {
									["count"] = 27,
								},
								["Saluma"] = {
									["count"] = 30,
								},
								["Yodakompota"] = {
									["count"] = 27,
								},
								["Limbmasher <Mazdaqq>"] = {
									["count"] = 30,
								},
							},
							["amount"] = 162,
						},
						["Восстановление"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 27,
								},
								["Pucifall"] = {
									["count"] = 27,
								},
								["Slysweetelf"] = {
									["count"] = 27,
								},
							},
							["amount"] = 81,
						},
					},
					["Damage"] = 19827,
					["Heals"] = {
						["Омоложение"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1111,
									["min"] = 1111,
									["count"] = 1,
									["amount"] = 1111,
								},
							},
							["count"] = 1,
							["amount"] = 1111,
						},
					},
					["Healing"] = 1111,
					["Attacks"] = {
						["Звездопад"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3983,
									["min"] = 1539,
									["count"] = 2,
									["amount"] = 5522,
								},
								["Hit"] = {
									["max"] = 2303,
									["min"] = 770,
									["count"] = 5,
									["amount"] = 8298,
								},
							},
							["count"] = 7,
							["amount"] = 13820,
						},
						["Лунный огонь"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 808,
									["min"] = 690,
									["count"] = 2,
									["amount"] = 1498,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 1498,
						},
						["Гнев"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 4509,
									["min"] = 4509,
									["count"] = 1,
									["amount"] = 4509,
								},
							},
							["count"] = 3,
							["amount"] = 4509,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
					},
					["ElementDone"] = {
						["Nature"] = 4509,
						["Arcane"] = 15318,
					},
					["ManaGainedFrom"] = {
						["Slysweetelf"] = {
							["Details"] = {
								["Восполнение маны"] = {
									["count"] = 600,
								},
							},
							["amount"] = 600,
						},
					},
					["DamagedWho"] = {
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3983,
								},
							},
							["amount"] = 3983,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 9837,
								},
								["Лунный огонь"] = {
									["count"] = 808,
								},
								["Гнев"] = {
									["count"] = 4509,
								},
							},
							["amount"] = 15154,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 690,
								},
							},
							["amount"] = 690,
						},
					},
					["TimeDamage"] = 14.45,
					["TimeDamaging"] = {
						["Крыса"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Звездопад"] = {
									["count"] = 4.53,
								},
								["Лунный огонь"] = {
									["count"] = 4.1,
								},
								["Гнев"] = {
									["count"] = 2.24,
								},
							},
							["amount"] = 10.87,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Лунный огонь"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
					},
					["ManaGain"] = 600,
					["TimeHeal"] = 3.5,
					["Overhealing"] = 148246,
				},
			},
			["UnitLockout"] = 1698607152,
			["LastActive"] = 1698607192,
		},
		["Mazdaqq"] = {
			["GUID"] = "0x0700000000845A82",
			["LastEventHealth"] = {
				"34105 (100%)", -- [1]
				"34105 (100%)", -- [2]
				"34105 (100%)", -- [3]
				"34105 (100%)", -- [4]
				"34105 (100%)", -- [5]
				"34105 (100%)", -- [6]
				"34105 (100%)", -- [7]
				"34105 (100%)", -- [8]
				"34105 (100%)", -- [9]
				"34105 (100%)", -- [10]
				"34105 (100%)", -- [11]
				"34105 (100%)", -- [12]
				"34105 (100%)", -- [13]
				"34105 (100%)", -- [14]
				"34105 (100%)", -- [15]
				"34105 (100%)", -- [16]
				"34105 (100%)", -- [17]
				"34105 (100%)", -- [18]
				"34105 (100%)", -- [19]
				"34105 (100%)", -- [20]
				"34105 (100%)", -- [21]
				"34105 (100%)", -- [22]
				"34105 (100%)", -- [23]
				"34105 (100%)", -- [24]
				"32525 (95%)", -- [25]
				"32525 (95%)", -- [26]
				"32481 (100%)", -- [27]
				"34105 (100%)", -- [28]
				"34105 (100%)", -- [29]
				"34105 (100%)", -- [30]
				"34105 (100%)", -- [31]
				"34105 (100%)", -- [32]
				"34105 (100%)", -- [33]
				"34105 (100%)", -- [34]
				"34105 (100%)", -- [35]
				"34105 (100%)", -- [36]
				"34105 (100%)", -- [37]
				"34105 (100%)", -- [38]
				"34105 (100%)", -- [39]
				"34105 (100%)", -- [40]
				"34105 (100%)", -- [41]
				"34105 (100%)", -- [42]
				"34105 (100%)", -- [43]
				"34105 (100%)", -- [44]
				"34105 (100%)", -- [45]
				"34105 (100%)", -- [46]
				"34105 (100%)", -- [47]
				"34105 (100%)", -- [48]
				"34105 (100%)", -- [49]
				"34105 (100%)", -- [50]
			},
			["LastAttackedBy"] = "Всадник без головы",
			["LastEventType"] = {
				"HEAL", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"HEAL", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"HEAL", -- [23]
				"HEAL", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"HEAL", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"HEAL", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"HEAL", -- [34]
				"DAMAGE", -- [35]
				"HEAL", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"HEAL", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"HEAL", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["HOT_Time"] = {
					60, -- [1]
				},
				["HealingTaken"] = {
					1111, -- [1]
				},
				["Overhealing"] = {
					5518, -- [1]
				},
				["ActiveTime"] = {
					36.28000000000001, -- [1]
				},
				["DOT_Time"] = {
					33, -- [1]
				},
				["TimeDamage"] = {
					36.28000000000001, -- [1]
				},
				["DamageTaken"] = {
					2691, -- [1]
				},
				["Damage"] = {
					140181, -- [1]
				},
			},
			["enClass"] = "DEATHKNIGHT",
			["unit"] = "Mazdaqq",
			["LastAbility"] = 91098.27,
			["LastEventTimes"] = {
				12963.128, -- [1]
				12963.266, -- [2]
				12963.359, -- [3]
				12964.028, -- [4]
				12964.35, -- [5]
				12964.623, -- [6]
				12964.907, -- [7]
				12965.505, -- [8]
				12966.296, -- [9]
				12966.539, -- [10]
				12966.769, -- [11]
				12966.772, -- [12]
				12966.773, -- [13]
				12967.011, -- [14]
				12967.384, -- [15]
				12967.385, -- [16]
				12967.586, -- [17]
				12967.888, -- [18]
				12968.508, -- [19]
				12969.26, -- [20]
				12969.522, -- [21]
				12969.523, -- [22]
				12969.773, -- [23]
				12969.776, -- [24]
				12969.779, -- [25]
				12969.794, -- [26]
				90523.49100000001, -- [27]
				12952.841, -- [28]
				12952.842, -- [29]
				12953.226, -- [30]
				12953.38, -- [31]
				12953.706, -- [32]
				12954.073, -- [33]
				12954.075, -- [34]
				12954.374, -- [35]
				12954.65, -- [36]
				12955.808, -- [37]
				12955.967, -- [38]
				12956.163, -- [39]
				12956.405, -- [40]
				12957.1, -- [41]
				12957.252, -- [42]
				12958.837, -- [43]
				12960.154, -- [44]
				12960.26, -- [45]
				12961.502, -- [46]
				12961.755, -- [47]
				12962.033, -- [48]
				12962.836, -- [49]
				12962.837, -- [50]
			},
			["level"] = 80,
			["LastDamageAbility"] = "Колун всадника",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				3.336754141621463, -- [1]
				[23] = 0.413429115965401,
				[24] = 0.2404339539656942,
				[34] = 3.339686263011289,
				[36] = 5.345257293651957,
				[27] = 3.386595240294326,
				[14] = 0.3958363876264477,
				[44] = 3.339686263011289,
				[31] = 0.1495381908811025,
				[49] = 1.284269168743586,
				[39] = 0.8913649025069638,
				[41] = 3.339686263011289,
				[11] = 1.011581879489811,
				[25] = 4.632751795924351,
			},
			["type"] = "Self",
			["FightsSaved"] = 1,
			["GuardianReverseGUIDs"] = {
				["Вороная горгулья"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "0xF130006CB5000095",
					},
				},
				["Войско мертвых"] = {
					["LatestGuardian"] = 7,
					["GUIDs"] = {
						"0xF130005E8F00008D", -- [1]
						"0xF130005E8F00008E", -- [2]
						"0xF130005E8F00008F", -- [3]
						"0xF130005E8F000090", -- [4]
						"0xF130005E8F000091", -- [5]
						"0xF130005E8F000092", -- [6]
						"0xF130005E8F000093", -- [7]
						[0] = "0xF130005E8F00008C",
					},
				},
			},
			["TimeLast"] = {
				["OVERALL"] = 1698607195,
				["DamageTaken"] = 1698607195,
				["HealingTaken"] = 1698607164,
				["Overhealing"] = 1698607195,
				["TimeDamage"] = 1698607195,
				["HOT_Time"] = 1698607195,
				["ActiveTime"] = 1698607195,
				["DOT_Time"] = 1698607188,
				["Damage"] = 1698607195,
			},
			["Owner"] = false,
			["Pet"] = {
				"Limbmasher <Mazdaqq>", -- [1]
				"Войско мертвых <Mazdaqq>", -- [2]
				"Вороная горгулья <Mazdaqq>", -- [3]
			},
			["NextEventNum"] = 28,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				95.36724820407565, -- [25]
				95.36724820407565, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Slysweetelf Восстановление Mazdaqq Tick +1138 (1138 избыт. лечение)", -- [1]
				"Mazdaqq Кровавая чума (УЗВ) Всадник без головы Tick -2064 (Shadow)", -- [2]
				"Mazdaqq Бродячая чума Всадник без головы Hit -1981 (Shadow)", -- [3]
				"Mazdaqq Атака ближнего боя Всадник без головы Immune", -- [4]
				"Mazdaqq Кровавый удар Всадник без головы Immune (Physical)", -- [5]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [6]
				"Mazdaqq Озноб Всадник без головы Immune (Frost)", -- [7]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [8]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [9]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [10]
				"Mazdaqq Власть крови Mazdaqq Tick +345 (345 избыт. лечение)", -- [11]
				"Mazdaqq Удар Плети Голова Всадника Crit -8246 (Physical)", -- [12]
				"Mazdaqq Атака ближнего боя Голова Всадника Glancing -3205 (Physical)", -- [13]
				"Mazdaqq Власть крови Mazdaqq Tick +135 (135 избыт. лечение)", -- [14]
				"Mazdaqq Некроз Голова Всадника Hit -641 (Shadow)", -- [15]
				"Mazdaqq Удар закаленным в крови клинком Голова Всадника Hit -794 (Physical)", -- [16]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [17]
				"Mazdaqq Озноб Всадник без головы Immune (Frost)", -- [18]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [19]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [20]
				"Mazdaqq Атака ближнего боя Голова Всадника Hit -3353 (Physical)", -- [21]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [22]
				"Mazdaqq Власть крови Mazdaqq Tick +141 (141 избыт. лечение)", -- [23]
				"Mazdaqq Власть крови Mazdaqq Tick +82 (82 избыт. лечение)", -- [24]
				"Всадник без головы Колун всадника Mazdaqq Hit -1580 (Physical)", -- [25]
				"Mazdaqq Удар Плети Голова Всадника Hit -3401 (Physical)", -- [26]
				"Silentpain Символ Света небес Mazdaqq Hit +1100 (649 избыт. лечение)", -- [27]
				"Mazdaqq Кровавый удар Всадник без головы Hit -2673 (Physical)", -- [28]
				"Mazdaqq Озноб (УЗВ) Всадник без головы Tick -2459 (Frost)", -- [29]
				"Mazdaqq Атака ближнего боя Всадник без головы Crit -8314 (Physical)", -- [30]
				"Mazdaqq Власть крови Mazdaqq Tick +51 (51 избыт. лечение)", -- [31]
				"Mazdaqq Некроз Всадник без головы Immune (Shadow)", -- [32]
				"Mazdaqq Удар Плети Всадник без головы Immune (Physical)", -- [33]
				"Slysweetelf Восстановление Mazdaqq Tick +1139 (1139 избыт. лечение)", -- [34]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [35]
				"Slysweetelf Омоложение Mazdaqq Tick +1823 (1823 избыт. лечение)", -- [36]
				"Mazdaqq Озноб Всадник без головы Immune (Frost)", -- [37]
				"Mazdaqq Атака ближнего боя Голова Всадника Crit -7257 (Physical)", -- [38]
				"Mazdaqq Власть крови Mazdaqq Tick +304 (304 избыт. лечение)", -- [39]
				"Mazdaqq Некроз Голова Всадника Hit -1451 (Shadow)", -- [40]
				"Slysweetelf Восстановление Mazdaqq Tick +1139 (1139 избыт. лечение)", -- [41]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [42]
				"Mazdaqq Озноб Всадник без головы Immune (Frost)", -- [43]
				"Slysweetelf Восстановление Mazdaqq Tick +1139 (1139 избыт. лечение)", -- [44]
				"Mazdaqq Кровавая чума (УЗВ) Всадник без головы Tick -2064 (Shadow)", -- [45]
				"Mazdaqq Хватка смерти Всадник без головы Immune (Physical)", -- [46]
				"Mazdaqq Озноб (УЗВ) Всадник без головы Tick -2459 (Frost)", -- [47]
				"Mazdaqq Бродячая чума Всадник без головы Hit -2361 (Shadow)", -- [48]
				"Mazdaqq Власть крови Mazdaqq Tick +438 (438 избыт. лечение)", -- [49]
				"Mazdaqq Лик смерти Всадник без головы Crit -10442 (Shadow)", -- [50]
			},
			["Name"] = "Mazdaqq",
			["LastDamageTaken"] = 1580,
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1074,
									["min"] = 1074,
									["count"] = 2,
									["amount"] = 2148,
								},
							},
							["count"] = 2,
							["amount"] = 2148,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 438,
									["min"] = 2,
									["count"] = 20,
									["amount"] = 3370,
								},
							},
							["count"] = 20,
							["amount"] = 3370,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.15,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Некроз"] = {
									["count"] = 1.76,
								},
							},
							["amount"] = 3.68,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Кровавая чума"] = {
									["count"] = 3.42,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Кровавый удар"] = {
									["count"] = 1.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.19,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.26,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.71,
								},
								["Некроз"] = {
									["count"] = 1.78,
								},
								["Бродячая чума"] = {
									["count"] = 0.47,
								},
								["Озноб"] = {
									["count"] = 4.09,
								},
								["Нечестивая порча"] = {
									["count"] = 6.18,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.19,
								},
								["Хватка смерти"] = {
									["count"] = 1.24,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 1.21,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.18,
								},
								["Лик смерти"] = {
									["count"] = 0.92,
								},
								["Удар Плети"] = {
									["count"] = 0.6599999999999999,
								},
							},
							["amount"] = 32.60000000000001,
						},
					},
					["DamageTaken"] = 2691,
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 36.28000000000001,
					["ElementTaken"] = {
						["Melee"] = 1111,
						["Physical"] = 1580,
					},
					["DOT_Time"] = 33,
					["Damage"] = 140181,
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
					},
					["HOT_Time"] = 60,
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.15,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Некроз"] = {
									["count"] = 1.76,
								},
							},
							["amount"] = 3.68,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Кровавая чума"] = {
									["count"] = 3.42,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Кровавый удар"] = {
									["count"] = 1.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.19,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.26,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.71,
								},
								["Некроз"] = {
									["count"] = 1.78,
								},
								["Бродячая чума"] = {
									["count"] = 0.47,
								},
								["Озноб"] = {
									["count"] = 4.09,
								},
								["Нечестивая порча"] = {
									["count"] = 6.18,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.19,
								},
								["Хватка смерти"] = {
									["count"] = 1.24,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 1.21,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.18,
								},
								["Лик смерти"] = {
									["count"] = 0.92,
								},
								["Удар Плети"] = {
									["count"] = 0.6599999999999999,
								},
							},
							["amount"] = 32.60000000000001,
						},
					},
					["Attacks"] = {
						["Кровавая чума"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 2459,
									["min"] = 1424,
									["count"] = 4,
									["amount"] = 7766,
								},
							},
							["count"] = 4,
							["amount"] = 7766,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 3790,
									["min"] = 3790,
									["count"] = 1,
									["amount"] = 3790,
								},
								["Hit"] = {
									["max"] = 2673,
									["min"] = 1850,
									["count"] = 2,
									["amount"] = 4523,
								},
							},
							["count"] = 4,
							["amount"] = 8313,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 3205,
									["min"] = 3205,
									["count"] = 1,
									["amount"] = 3205,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8314,
									["min"] = 5296,
									["count"] = 4,
									["amount"] = 28524,
								},
								["Hit"] = {
									["max"] = 4101,
									["min"] = 2970,
									["count"] = 5,
									["amount"] = 18468,
								},
							},
							["count"] = 11,
							["amount"] = 50197,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1821,
									["min"] = 1821,
									["count"] = 1,
									["amount"] = 1821,
								},
							},
							["count"] = 1,
							["amount"] = 1821,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 6795,
									["min"] = 6795,
									["count"] = 1,
									["amount"] = 6795,
								},
								["Hit"] = {
									["max"] = 1726,
									["min"] = 1726,
									["count"] = 1,
									["amount"] = 1726,
								},
							},
							["count"] = 2,
							["amount"] = 8521,
						},
						["Некроз"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1531,
									["min"] = 594,
									["count"] = 8,
									["amount"] = 7704,
								},
							},
							["count"] = 9,
							["amount"] = 7704,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2361,
									["min"] = 1138,
									["count"] = 4,
									["amount"] = 6819,
								},
							},
							["count"] = 4,
							["amount"] = 6819,
						},
						["Озноб"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 3,
									["amount"] = 150,
								},
							},
							["count"] = 3,
							["amount"] = 150,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2751,
									["min"] = 794,
									["count"] = 3,
									["amount"] = 4499,
								},
							},
							["count"] = 3,
							["amount"] = 4499,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4238,
									["min"] = 4238,
									["count"] = 1,
									["amount"] = 4238,
								},
								["Hit"] = {
									["max"] = 3071,
									["min"] = 3071,
									["count"] = 1,
									["amount"] = 3071,
								},
							},
							["count"] = 2,
							["amount"] = 7309,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 2064,
									["min"] = 1197,
									["count"] = 4,
									["amount"] = 6522,
								},
							},
							["count"] = 4,
							["amount"] = 6522,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 10442,
									["min"] = 10442,
									["count"] = 1,
									["amount"] = 10442,
								},
								["Hit"] = {
									["max"] = 5079,
									["min"] = 5079,
									["count"] = 1,
									["amount"] = 5079,
								},
							},
							["count"] = 2,
							["amount"] = 15521,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8246,
									["min"] = 8246,
									["count"] = 1,
									["amount"] = 8246,
								},
								["Hit"] = {
									["max"] = 3401,
									["min"] = 3392,
									["count"] = 2,
									["amount"] = 6793,
								},
							},
							["count"] = 4,
							["amount"] = 15039,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 25518,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1748,
								},
								["Удар Плети"] = {
									["count"] = 11647,
								},
								["Кровавый удар"] = {
									["count"] = 3790,
								},
								["Некроз"] = {
									["count"] = 4432,
								},
							},
							["amount"] = 47135,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 6819,
								},
								["Удар Плети"] = {
									["count"] = 3392,
								},
								["Ледяное прикосновение"] = {
									["count"] = 8521,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7766,
								},
								["Кровавый удар"] = {
									["count"] = 4523,
								},
								["Атака ближнего боя"] = {
									["count"] = 24679,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 150,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 2751,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 1821,
								},
								["Удар чумы"] = {
									["count"] = 7309,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6522,
								},
								["Лик смерти"] = {
									["count"] = 15521,
								},
								["Некроз"] = {
									["count"] = 3272,
								},
							},
							["amount"] = 93046,
						},
					},
					["ElementDone"] = {
						["Frost"] = 16287,
						["Shadow"] = 38537,
						["Melee"] = 50197,
						["Physical"] = 35160,
					},
					["HealingTaken"] = 1111,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 42,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
					},
					["TimeDamage"] = 36.28000000000001,
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1111,
								},
								["Колун всадника"] = {
									["count"] = 1580,
								},
							},
							["amount"] = 2691,
						},
					},
					["Overhealing"] = 5518,
					["WhoHealed"] = {
						["Slysweetelf"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 1111,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["LastFightData"] = {
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1074,
									["min"] = 1074,
									["count"] = 2,
									["amount"] = 2148,
								},
							},
							["count"] = 2,
							["amount"] = 2148,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 438,
									["min"] = 2,
									["count"] = 20,
									["amount"] = 3370,
								},
							},
							["count"] = 20,
							["amount"] = 3370,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.15,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Некроз"] = {
									["count"] = 1.76,
								},
							},
							["amount"] = 3.68,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Кровавая чума"] = {
									["count"] = 3.42,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Кровавый удар"] = {
									["count"] = 1.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.19,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.26,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.71,
								},
								["Некроз"] = {
									["count"] = 1.78,
								},
								["Бродячая чума"] = {
									["count"] = 0.47,
								},
								["Озноб"] = {
									["count"] = 4.09,
								},
								["Нечестивая порча"] = {
									["count"] = 6.18,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.19,
								},
								["Хватка смерти"] = {
									["count"] = 1.24,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 1.21,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.18,
								},
								["Лик смерти"] = {
									["count"] = 0.92,
								},
								["Удар Плети"] = {
									["count"] = 0.6599999999999999,
								},
							},
							["amount"] = 32.60000000000001,
						},
					},
					["DamageTaken"] = 2691,
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 36.28000000000001,
					["ElementTaken"] = {
						["Melee"] = 1111,
						["Physical"] = 1580,
					},
					["DOT_Time"] = 33,
					["Damage"] = 140181,
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
					},
					["HOT_Time"] = 60,
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.15,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Некроз"] = {
									["count"] = 1.76,
								},
							},
							["amount"] = 3.68,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Кровавая чума"] = {
									["count"] = 3.42,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Кровавый удар"] = {
									["count"] = 1.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.19,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.26,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.71,
								},
								["Некроз"] = {
									["count"] = 1.78,
								},
								["Бродячая чума"] = {
									["count"] = 0.47,
								},
								["Озноб"] = {
									["count"] = 4.09,
								},
								["Нечестивая порча"] = {
									["count"] = 6.18,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.19,
								},
								["Хватка смерти"] = {
									["count"] = 1.24,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 1.21,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.18,
								},
								["Лик смерти"] = {
									["count"] = 0.92,
								},
								["Удар Плети"] = {
									["count"] = 0.6599999999999999,
								},
							},
							["amount"] = 32.60000000000001,
						},
					},
					["Attacks"] = {
						["Кровавая чума"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 2459,
									["min"] = 1424,
									["count"] = 4,
									["amount"] = 7766,
								},
							},
							["count"] = 4,
							["amount"] = 7766,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 3790,
									["min"] = 3790,
									["count"] = 1,
									["amount"] = 3790,
								},
								["Hit"] = {
									["max"] = 2673,
									["min"] = 1850,
									["count"] = 2,
									["amount"] = 4523,
								},
							},
							["count"] = 4,
							["amount"] = 8313,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 3205,
									["min"] = 3205,
									["count"] = 1,
									["amount"] = 3205,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8314,
									["min"] = 5296,
									["count"] = 4,
									["amount"] = 28524,
								},
								["Hit"] = {
									["max"] = 4101,
									["min"] = 2970,
									["count"] = 5,
									["amount"] = 18468,
								},
							},
							["count"] = 11,
							["amount"] = 50197,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1821,
									["min"] = 1821,
									["count"] = 1,
									["amount"] = 1821,
								},
							},
							["count"] = 1,
							["amount"] = 1821,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 6795,
									["min"] = 6795,
									["count"] = 1,
									["amount"] = 6795,
								},
								["Hit"] = {
									["max"] = 1726,
									["min"] = 1726,
									["count"] = 1,
									["amount"] = 1726,
								},
							},
							["count"] = 2,
							["amount"] = 8521,
						},
						["Некроз"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1531,
									["min"] = 594,
									["count"] = 8,
									["amount"] = 7704,
								},
							},
							["count"] = 9,
							["amount"] = 7704,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2361,
									["min"] = 1138,
									["count"] = 4,
									["amount"] = 6819,
								},
							},
							["count"] = 4,
							["amount"] = 6819,
						},
						["Озноб"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 3,
									["amount"] = 150,
								},
							},
							["count"] = 3,
							["amount"] = 150,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2751,
									["min"] = 794,
									["count"] = 3,
									["amount"] = 4499,
								},
							},
							["count"] = 3,
							["amount"] = 4499,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4238,
									["min"] = 4238,
									["count"] = 1,
									["amount"] = 4238,
								},
								["Hit"] = {
									["max"] = 3071,
									["min"] = 3071,
									["count"] = 1,
									["amount"] = 3071,
								},
							},
							["count"] = 2,
							["amount"] = 7309,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 2064,
									["min"] = 1197,
									["count"] = 4,
									["amount"] = 6522,
								},
							},
							["count"] = 4,
							["amount"] = 6522,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 10442,
									["min"] = 10442,
									["count"] = 1,
									["amount"] = 10442,
								},
								["Hit"] = {
									["max"] = 5079,
									["min"] = 5079,
									["count"] = 1,
									["amount"] = 5079,
								},
							},
							["count"] = 2,
							["amount"] = 15521,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8246,
									["min"] = 8246,
									["count"] = 1,
									["amount"] = 8246,
								},
								["Hit"] = {
									["max"] = 3401,
									["min"] = 3392,
									["count"] = 2,
									["amount"] = 6793,
								},
							},
							["count"] = 4,
							["amount"] = 15039,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 25518,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1748,
								},
								["Удар Плети"] = {
									["count"] = 11647,
								},
								["Кровавый удар"] = {
									["count"] = 3790,
								},
								["Некроз"] = {
									["count"] = 4432,
								},
							},
							["amount"] = 47135,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 6819,
								},
								["Удар Плети"] = {
									["count"] = 3392,
								},
								["Ледяное прикосновение"] = {
									["count"] = 8521,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7766,
								},
								["Кровавый удар"] = {
									["count"] = 4523,
								},
								["Атака ближнего боя"] = {
									["count"] = 24679,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 150,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 2751,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 1821,
								},
								["Удар чумы"] = {
									["count"] = 7309,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6522,
								},
								["Лик смерти"] = {
									["count"] = 15521,
								},
								["Некроз"] = {
									["count"] = 3272,
								},
							},
							["amount"] = 93046,
						},
					},
					["ElementDone"] = {
						["Frost"] = 16287,
						["Shadow"] = 38537,
						["Melee"] = 50197,
						["Physical"] = 35160,
					},
					["HealingTaken"] = 1111,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 42,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
					},
					["TimeDamage"] = 36.28000000000001,
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1111,
								},
								["Колун всадника"] = {
									["count"] = 1580,
								},
							},
							["amount"] = 2691,
						},
					},
					["Overhealing"] = 5518,
					["WhoHealed"] = {
						["Slysweetelf"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 1111,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1074,
									["min"] = 1074,
									["count"] = 2,
									["amount"] = 2148,
								},
							},
							["count"] = 2,
							["amount"] = 2148,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 438,
									["min"] = 2,
									["count"] = 20,
									["amount"] = 3370,
								},
							},
							["count"] = 20,
							["amount"] = 3370,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.15,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Некроз"] = {
									["count"] = 1.76,
								},
							},
							["amount"] = 3.68,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Кровавая чума"] = {
									["count"] = 3.42,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Кровавый удар"] = {
									["count"] = 1.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.19,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.26,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.71,
								},
								["Некроз"] = {
									["count"] = 1.78,
								},
								["Бродячая чума"] = {
									["count"] = 0.47,
								},
								["Озноб"] = {
									["count"] = 4.09,
								},
								["Нечестивая порча"] = {
									["count"] = 6.18,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.19,
								},
								["Хватка смерти"] = {
									["count"] = 1.24,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 1.21,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.18,
								},
								["Лик смерти"] = {
									["count"] = 0.92,
								},
								["Удар Плети"] = {
									["count"] = 0.6599999999999999,
								},
							},
							["amount"] = 32.60000000000001,
						},
					},
					["DamageTaken"] = 2691,
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 36.28000000000001,
					["ElementTaken"] = {
						["Melee"] = 1111,
						["Physical"] = 1580,
					},
					["DOT_Time"] = 33,
					["Damage"] = 140181,
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
					},
					["HOT_Time"] = 60,
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.15,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.27,
								},
								["Некроз"] = {
									["count"] = 1.76,
								},
							},
							["amount"] = 3.68,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Кровавая чума"] = {
									["count"] = 3.42,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.27,
								},
								["Кровавый удар"] = {
									["count"] = 1.83,
								},
								["Атака ближнего боя"] = {
									["count"] = 5.19,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.26,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.71,
								},
								["Некроз"] = {
									["count"] = 1.78,
								},
								["Бродячая чума"] = {
									["count"] = 0.47,
								},
								["Озноб"] = {
									["count"] = 4.09,
								},
								["Нечестивая порча"] = {
									["count"] = 6.18,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.19,
								},
								["Хватка смерти"] = {
									["count"] = 1.24,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 1.21,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 2.18,
								},
								["Лик смерти"] = {
									["count"] = 0.92,
								},
								["Удар Плети"] = {
									["count"] = 0.6599999999999999,
								},
							},
							["amount"] = 32.60000000000001,
						},
					},
					["Attacks"] = {
						["Кровавая чума"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 2459,
									["min"] = 1424,
									["count"] = 4,
									["amount"] = 7766,
								},
							},
							["count"] = 4,
							["amount"] = 7766,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 3790,
									["min"] = 3790,
									["count"] = 1,
									["amount"] = 3790,
								},
								["Hit"] = {
									["max"] = 2673,
									["min"] = 1850,
									["count"] = 2,
									["amount"] = 4523,
								},
							},
							["count"] = 4,
							["amount"] = 8313,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 3205,
									["min"] = 3205,
									["count"] = 1,
									["amount"] = 3205,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8314,
									["min"] = 5296,
									["count"] = 4,
									["amount"] = 28524,
								},
								["Hit"] = {
									["max"] = 4101,
									["min"] = 2970,
									["count"] = 5,
									["amount"] = 18468,
								},
							},
							["count"] = 11,
							["amount"] = 50197,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1821,
									["min"] = 1821,
									["count"] = 1,
									["amount"] = 1821,
								},
							},
							["count"] = 1,
							["amount"] = 1821,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 6795,
									["min"] = 6795,
									["count"] = 1,
									["amount"] = 6795,
								},
								["Hit"] = {
									["max"] = 1726,
									["min"] = 1726,
									["count"] = 1,
									["amount"] = 1726,
								},
							},
							["count"] = 2,
							["amount"] = 8521,
						},
						["Некроз"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1531,
									["min"] = 594,
									["count"] = 8,
									["amount"] = 7704,
								},
							},
							["count"] = 9,
							["amount"] = 7704,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2361,
									["min"] = 1138,
									["count"] = 4,
									["amount"] = 6819,
								},
							},
							["count"] = 4,
							["amount"] = 6819,
						},
						["Озноб"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 3,
									["amount"] = 150,
								},
							},
							["count"] = 3,
							["amount"] = 150,
						},
						["Хватка смерти"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2751,
									["min"] = 794,
									["count"] = 3,
									["amount"] = 4499,
								},
							},
							["count"] = 3,
							["amount"] = 4499,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4238,
									["min"] = 4238,
									["count"] = 1,
									["amount"] = 4238,
								},
								["Hit"] = {
									["max"] = 3071,
									["min"] = 3071,
									["count"] = 1,
									["amount"] = 3071,
								},
							},
							["count"] = 2,
							["amount"] = 7309,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 2064,
									["min"] = 1197,
									["count"] = 4,
									["amount"] = 6522,
								},
							},
							["count"] = 4,
							["amount"] = 6522,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 10442,
									["min"] = 10442,
									["count"] = 1,
									["amount"] = 10442,
								},
								["Hit"] = {
									["max"] = 5079,
									["min"] = 5079,
									["count"] = 1,
									["amount"] = 5079,
								},
							},
							["count"] = 2,
							["amount"] = 15521,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8246,
									["min"] = 8246,
									["count"] = 1,
									["amount"] = 8246,
								},
								["Hit"] = {
									["max"] = 3401,
									["min"] = 3392,
									["count"] = 2,
									["amount"] = 6793,
								},
							},
							["count"] = 4,
							["amount"] = 15039,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 25518,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1748,
								},
								["Удар Плети"] = {
									["count"] = 11647,
								},
								["Кровавый удар"] = {
									["count"] = 3790,
								},
								["Некроз"] = {
									["count"] = 4432,
								},
							},
							["amount"] = 47135,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 6819,
								},
								["Удар Плети"] = {
									["count"] = 3392,
								},
								["Ледяное прикосновение"] = {
									["count"] = 8521,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7766,
								},
								["Кровавый удар"] = {
									["count"] = 4523,
								},
								["Атака ближнего боя"] = {
									["count"] = 24679,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 150,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 2751,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 1821,
								},
								["Удар чумы"] = {
									["count"] = 7309,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 6522,
								},
								["Лик смерти"] = {
									["count"] = 15521,
								},
								["Некроз"] = {
									["count"] = 3272,
								},
							},
							["amount"] = 93046,
						},
					},
					["ElementDone"] = {
						["Frost"] = 16287,
						["Shadow"] = 38537,
						["Melee"] = 50197,
						["Physical"] = 35160,
					},
					["HealingTaken"] = 1111,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 42,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
					},
					["TimeDamage"] = 36.28000000000001,
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1111,
								},
								["Колун всадника"] = {
									["count"] = 1580,
								},
							},
							["amount"] = 2691,
						},
					},
					["Overhealing"] = 5518,
					["WhoHealed"] = {
						["Slysweetelf"] = {
							["Details"] = {
								["Омоложение"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 1111,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 1698607152,
			["LastActive"] = 1699111079,
		},
		["Limbmasher <Mazdaqq>"] = {
			["GUID"] = "0xF1403A1848000001",
			["LastEventHealth"] = {
				"26932 (100%)", -- [1]
				"26932 (100%)", -- [2]
				"26932 (100%)", -- [3]
				"26932 (100%)", -- [4]
				"26932 (100%)", -- [5]
				"26932 (100%)", -- [6]
				"26932 (100%)", -- [7]
				"26932 (100%)", -- [8]
				"26932 (100%)", -- [9]
				"26932 (100%)", -- [10]
				"26932 (100%)", -- [11]
				"26932 (100%)", -- [12]
				"26932 (100%)", -- [13]
				"26932 (100%)", -- [14]
				"26932 (100%)", -- [15]
				"26932 (100%)", -- [16]
				"26932 (100%)", -- [17]
				"26932 (100%)", -- [18]
				"26932 (100%)", -- [19]
				"26932 (100%)", -- [20]
				"26932 (100%)", -- [21]
				"26932 (100%)", -- [22]
				"26932 (100%)", -- [23]
				"26932 (100%)", -- [24]
				"26932 (100%)", -- [25]
				"26932 (100%)", -- [26]
				"26932 (100%)", -- [27]
				"26932 (100%)", -- [28]
				"26932 (100%)", -- [29]
				"26932 (100%)", -- [30]
				"26932 (100%)", -- [31]
				"26932 (100%)", -- [32]
				"26932 (100%)", -- [33]
				"26932 (100%)", -- [34]
				"26932 (100%)", -- [35]
				"26932 (100%)", -- [36]
				"26932 (100%)", -- [37]
				"26932 (100%)", -- [38]
				"26932 (100%)", -- [39]
				"26932 (100%)", -- [40]
				"26932 (100%)", -- [41]
				"26932 (100%)", -- [42]
				"26932 (100%)", -- [43]
				"26932 (100%)", -- [44]
				"26932 (100%)", -- [45]
				"26932 (100%)", -- [46]
				"26932 (100%)", -- [47]
				"26932 (100%)", -- [48]
				"26932 (100%)", -- [49]
				"26932 (100%)", -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"HEAL", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"HEAL", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"HEAL", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"HEAL", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"HEAL", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"HEAL", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["Damage"] = {
					30224, -- [1]
				},
				["TimeDamage"] = {
					44.83, -- [1]
				},
				["ActiveTime"] = {
					44.83, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Limbmasher",
			["level"] = 1,
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				[24] = 6.627803356601812,
				[28] = 6.63151641170355,
				[33] = 6.80974305658696,
				[44] = 6.80974305658696,
				[16] = 6.627803356601812,
				[48] = 6.80974305658696,
				[2] = 6.80974305658696,
				[19] = 6.627803356601812,
				[10] = 6.627803356601812,
				[41] = 6.80974305658696,
				[11] = 6.627803356601812,
				[37] = 6.80974305658696,
			},
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["Owner"] = "Mazdaqq",
			["LastEventTimes"] = {
				12966.891, -- [1]
				12967.467, -- [2]
				12968.405, -- [3]
				12919.699, -- [4]
				12919.699, -- [5]
				12920.103, -- [6]
				12924.163, -- [7]
				12924.164, -- [8]
				12924.332, -- [9]
				12932.818, -- [10]
				12935.915, -- [11]
				12936.935, -- [12]
				12937.23, -- [13]
				12938.332, -- [14]
				12938.333, -- [15]
				12939.034, -- [16]
				12939.405, -- [17]
				12940.753, -- [18]
				12941.971, -- [19]
				12941.971, -- [20]
				12942.323, -- [21]
				12943.329, -- [22]
				12944.668, -- [23]
				12944.812, -- [24]
				12946.032, -- [25]
				12946.032, -- [26]
				12947.274, -- [27]
				12947.949, -- [28]
				12948.698, -- [29]
				12950.177, -- [30]
				12950.178, -- [31]
				12951.686, -- [32]
				12952.454, -- [33]
				12953.226, -- [34]
				12953.941, -- [35]
				12954.78, -- [36]
				12955.44, -- [37]
				12956.322, -- [38]
				12957.738, -- [39]
				12958.066, -- [40]
				12958.433, -- [41]
				12959.253, -- [42]
				12960.884, -- [43]
				12961.427, -- [44]
				12962.281, -- [45]
				12962.409, -- [46]
				12963.906, -- [47]
				12964.464, -- [48]
				12965.384, -- [49]
				12966.038, -- [50]
			},
			["NextEventNum"] = 4,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [1]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [2]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [3]
				"Limbmasher <Mazdaqq> Атака ближнего боя Тоскующий мертвец Crit -1810 (Physical)", -- [4]
				"Тоскующий мертвец Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [5]
				"Limbmasher <Mazdaqq> Цапнуть Тоскующий мертвец Crit -2698 (Physical)", -- [6]
				"Limbmasher <Mazdaqq> Атака ближнего боя Тоскующий мертвец Crit -1798 (Physical)", -- [7]
				"Тоскующий мертвец Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [8]
				"Limbmasher <Mazdaqq> Цапнуть Тоскующий мертвец Crit -2689 (Physical)", -- [9]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1785 (1785 избыт. лечение)", -- [10]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1785 (1785 избыт. лечение)", -- [11]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1318 (Physical)", -- [12]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -990 (Physical)", -- [13]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Crit -1924 (Physical)", -- [14]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -659 (Physical)", -- [15]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1785 (1785 избыт. лечение)", -- [16]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -636 (Physical)", -- [17]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -711 (Physical)", -- [18]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1785 (1785 избыт. лечение)", -- [19]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1422 (Physical)", -- [20]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [21]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [22]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [23]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1785 (1785 избыт. лечение)", -- [24]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [25]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [26]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [27]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1786 (1786 избыт. лечение)", -- [28]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [29]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -1118 (Physical)", -- [30]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -766 (Physical)", -- [31]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -732 (Physical)", -- [32]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [33]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1456 (Physical)", -- [34]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [35]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [36]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [37]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [38]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [39]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [40]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [41]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -700 (Physical)", -- [42]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1434 (Physical)", -- [43]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [44]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Crit -2104 (Physical)", -- [45]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -701 (Physical)", -- [46]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [47]
				"Slysweetelf Омоложение Limbmasher <Mazdaqq> Tick +1834 (1834 избыт. лечение)", -- [48]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [49]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [50]
			},
			["Name"] = "Limbmasher",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["TimeLast"] = {
				["Damage"] = 1698607187,
				["OVERALL"] = 1698607193,
				["TimeDamage"] = 1698607193,
				["ActiveTime"] = 1698607193,
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 0,
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.65,
								},
								["Цапнуть"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 34.97999999999999,
						},
					},
					["ElementDone"] = {
						["Melee"] = 10535,
						["Physical"] = 6136,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 12,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 23,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 711,
									["min"] = 711,
									["count"] = 1,
									["amount"] = 711,
								},
								["Immune"] = {
									["count"] = 12,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1456,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 5630,
								},
								["Hit"] = {
									["max"] = 766,
									["min"] = 636,
									["count"] = 6,
									["amount"] = 4194,
								},
							},
							["count"] = 23,
							["amount"] = 10535,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2104,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 4028,
								},
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Crit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1118,
									["min"] = 990,
									["count"] = 2,
									["amount"] = 2108,
								},
							},
							["count"] = 9,
							["amount"] = 6136,
						},
					},
					["TimeDamage"] = 34.97999999999999,
					["DamagedWho"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10535,
								},
								["Цапнуть"] = {
									["count"] = 6136,
								},
							},
							["amount"] = 16671,
						},
					},
					["ActiveTime"] = 34.97999999999999,
					["TimeDamaging"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.65,
								},
								["Цапнуть"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 34.97999999999999,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["Damage"] = 16671,
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 0,
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.65,
								},
								["Цапнуть"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 34.97999999999999,
						},
					},
					["ElementDone"] = {
						["Melee"] = 10535,
						["Physical"] = 6136,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 12,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 23,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 711,
									["min"] = 711,
									["count"] = 1,
									["amount"] = 711,
								},
								["Immune"] = {
									["count"] = 12,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1456,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 5630,
								},
								["Hit"] = {
									["max"] = 766,
									["min"] = 636,
									["count"] = 6,
									["amount"] = 4194,
								},
							},
							["count"] = 23,
							["amount"] = 10535,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2104,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 4028,
								},
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Crit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1118,
									["min"] = 990,
									["count"] = 2,
									["amount"] = 2108,
								},
							},
							["count"] = 9,
							["amount"] = 6136,
						},
					},
					["TimeDamage"] = 34.97999999999999,
					["DamagedWho"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10535,
								},
								["Цапнуть"] = {
									["count"] = 6136,
								},
							},
							["amount"] = 16671,
						},
					},
					["ActiveTime"] = 34.97999999999999,
					["TimeDamaging"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.65,
								},
								["Цапнуть"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 34.97999999999999,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["Damage"] = 16671,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 15,
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeSpent"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.1,
								},
								["Цапнуть"] = {
									["count"] = 0.7500000000000001,
								},
							},
							["amount"] = 9.85,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.65,
								},
								["Цапнуть"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 34.97999999999999,
						},
					},
					["ElementDone"] = {
						["Melee"] = 15935,
						["Physical"] = 14289,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 12,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 26,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 12,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 711,
									["min"] = 711,
									["count"] = 1,
									["amount"] = 711,
								},
								["Immune"] = {
									["count"] = 12,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1810,
									["min"] = 1318,
									["count"] = 7,
									["amount"] = 11030,
								},
								["Hit"] = {
									["max"] = 766,
									["min"] = 636,
									["count"] = 6,
									["amount"] = 4194,
								},
							},
							["count"] = 26,
							["amount"] = 15935,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2766,
									["min"] = 1924,
									["count"] = 4,
									["amount"] = 9492,
								},
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Crit (Блокировано)"] = {
									["max"] = 2689,
									["min"] = 2689,
									["count"] = 1,
									["amount"] = 2689,
								},
								["Hit"] = {
									["max"] = 1118,
									["min"] = 990,
									["count"] = 2,
									["amount"] = 2108,
								},
							},
							["count"] = 12,
							["amount"] = 14289,
						},
					},
					["TimeDamage"] = 44.83,
					["DamagedWho"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5400,
								},
								["Цапнуть"] = {
									["count"] = 8153,
								},
							},
							["amount"] = 13553,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 10535,
								},
								["Цапнуть"] = {
									["count"] = 6136,
								},
							},
							["amount"] = 16671,
						},
					},
					["ActiveTime"] = 44.83,
					["TimeDamaging"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.1,
								},
								["Цапнуть"] = {
									["count"] = 0.7500000000000001,
								},
							},
							["amount"] = 9.85,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.65,
								},
								["Цапнуть"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 34.97999999999999,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["Damage"] = 30224,
				},
			},
			["UnitLockout"] = 1698607142,
			["LastActive"] = 1698607193,
		},
		["Charli <Yodakompota>"] = {
			["GUID"] = "0xF14001CE76000002",
			["TimeLast"] = {
				["EnergyGain"] = 1698607183,
				["ActiveTime"] = 1698607194,
				["OVERALL"] = 1698607194,
				["TimeDamage"] = 1698607194,
				["Damage"] = 1698607188,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					200, -- [1]
				},
				["Damage"] = {
					2511, -- [1]
				},
				["TimeDamage"] = {
					23.39, -- [1]
				},
				["ActiveTime"] = {
					23.39, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Charli",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["Owner"] = "Yodakompota",
			["LastEventTimes"] = {
				12942.152, -- [1]
				12942.323, -- [2]
				12943.753, -- [3]
				12943.753, -- [4]
				12946.995, -- [5]
				12947.384, -- [6]
				12956.045, -- [7]
				12956.046, -- [8]
				12961.427, -- [9]
				12961.504, -- [10]
				12962.999, -- [11]
				12963.13, -- [12]
				12964.464, -- [13]
				12964.624, -- [14]
				12966.037, -- [15]
				12966.178, -- [16]
				12967.587, -- [17]
				12967.711, -- [18]
				12969.106, -- [19]
			},
			["NextEventNum"] = 20,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
			},
			["LastEvents"] = {
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Hit -338 (Physical)", -- [1]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [2]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [3]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [4]
				"Charli <Yodakompota> Атака ближнего боя Голова Всадника Hit -377 (Physical)", -- [5]
				"Charli <Yodakompota> Укус Голова Всадника Hit -463 (Physical)", -- [6]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [7]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [8]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Crit -530 (Physical)", -- [9]
				"Charli <Yodakompota> Укус Всадник без головы Hit -291 (Physical)", -- [10]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Hit -270 (Physical)", -- [11]
				"Charli <Yodakompota> Укус Всадник без головы Hit -242 (Physical)", -- [12]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [13]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [14]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [15]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [16]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [17]
				"Charli <Yodakompota> Укус Всадник без головы Immune (Physical)", -- [18]
				"Charli <Yodakompota> Атака ближнего боя Всадник без головы Immune", -- [19]
			},
			["Name"] = "Charli",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
			},
			["LastEventHealth"] = {
				"15644 (100%)", -- [1]
				"15644 (100%)", -- [2]
				"15644 (100%)", -- [3]
				"15644 (100%)", -- [4]
				"15644 (100%)", -- [5]
				"15644 (100%)", -- [6]
				"15644 (100%)", -- [7]
				"15644 (100%)", -- [8]
				"15644 (100%)", -- [9]
				"15644 (100%)", -- [10]
				"15644 (100%)", -- [11]
				"15644 (100%)", -- [12]
				"15644 (100%)", -- [13]
				"15644 (100%)", -- [14]
				"15644 (100%)", -- [15]
				"15644 (100%)", -- [16]
				"15644 (100%)", -- [17]
				"15644 (100%)", -- [18]
				"15644 (100%)", -- [19]
			},
			["Fights"] = {
				["Fight1"] = {
					["EnergyGained"] = {
						["Хватай за горло!"] = {
							["Details"] = {
								["Yodakompota"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.24,
								},
								["Укус"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 3.63,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 18.96,
								},
								["Укус"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 19.76,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 530,
									["min"] = 530,
									["count"] = 1,
									["amount"] = 530,
								},
								["Hit"] = {
									["max"] = 377,
									["min"] = 270,
									["count"] = 3,
									["amount"] = 985,
								},
							},
							["count"] = 10,
							["amount"] = 1515,
						},
						["Укус"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 463,
									["min"] = 242,
									["count"] = 3,
									["amount"] = 996,
								},
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 996,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1515,
						["Physical"] = 996,
					},
					["EnergyGain"] = 200,
					["TimeDamage"] = 23.39,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 377,
								},
								["Укус"] = {
									["count"] = 463,
								},
							},
							["amount"] = 840,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1138,
								},
								["Укус"] = {
									["count"] = 533,
								},
							},
							["amount"] = 1671,
						},
					},
					["ActiveTime"] = 23.39,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.24,
								},
								["Укус"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 3.63,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 18.96,
								},
								["Укус"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 19.76,
						},
					},
					["EnergyGainedFrom"] = {
						["Yodakompota"] = {
							["Details"] = {
								["Хватай за горло!"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
					},
					["Damage"] = 2511,
				},
				["LastFightData"] = {
					["EnergyGained"] = {
						["Хватай за горло!"] = {
							["Details"] = {
								["Yodakompota"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.24,
								},
								["Укус"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 3.63,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 18.96,
								},
								["Укус"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 19.76,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 530,
									["min"] = 530,
									["count"] = 1,
									["amount"] = 530,
								},
								["Hit"] = {
									["max"] = 377,
									["min"] = 270,
									["count"] = 3,
									["amount"] = 985,
								},
							},
							["count"] = 10,
							["amount"] = 1515,
						},
						["Укус"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 463,
									["min"] = 242,
									["count"] = 3,
									["amount"] = 996,
								},
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 996,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1515,
						["Physical"] = 996,
					},
					["EnergyGain"] = 200,
					["TimeDamage"] = 23.39,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 377,
								},
								["Укус"] = {
									["count"] = 463,
								},
							},
							["amount"] = 840,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1138,
								},
								["Укус"] = {
									["count"] = 533,
								},
							},
							["amount"] = 1671,
						},
					},
					["ActiveTime"] = 23.39,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.24,
								},
								["Укус"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 3.63,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 18.96,
								},
								["Укус"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 19.76,
						},
					},
					["EnergyGainedFrom"] = {
						["Yodakompota"] = {
							["Details"] = {
								["Хватай за горло!"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
					},
					["Damage"] = 2511,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["EnergyGained"] = {
						["Хватай за горло!"] = {
							["Details"] = {
								["Yodakompota"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.24,
								},
								["Укус"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 3.63,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 18.96,
								},
								["Укус"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 19.76,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 530,
									["min"] = 530,
									["count"] = 1,
									["amount"] = 530,
								},
								["Hit"] = {
									["max"] = 377,
									["min"] = 270,
									["count"] = 3,
									["amount"] = 985,
								},
							},
							["count"] = 10,
							["amount"] = 1515,
						},
						["Укус"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 463,
									["min"] = 242,
									["count"] = 3,
									["amount"] = 996,
								},
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 996,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1515,
						["Physical"] = 996,
					},
					["EnergyGain"] = 200,
					["TimeDamage"] = 23.39,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 377,
								},
								["Укус"] = {
									["count"] = 463,
								},
							},
							["amount"] = 840,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1138,
								},
								["Укус"] = {
									["count"] = 533,
								},
							},
							["amount"] = 1671,
						},
					},
					["ActiveTime"] = 23.39,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.24,
								},
								["Укус"] = {
									["count"] = 0.39,
								},
							},
							["amount"] = 3.63,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 18.96,
								},
								["Укус"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 19.76,
						},
					},
					["EnergyGainedFrom"] = {
						["Yodakompota"] = {
							["Details"] = {
								["Хватай за горло!"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
					},
					["Damage"] = 2511,
				},
			},
			["UnitLockout"] = 1698607167,
			["LastActive"] = 1698607194,
		},
		["Saluma"] = {
			["GUID"] = "0x0700000000724340",
			["TimeLast"] = {
				["RageGain"] = 1698607188,
				["Overhealing"] = 1698607187,
				["ActiveTime"] = 1698607194,
				["TimeDamage"] = 1698607194,
				["OVERALL"] = 1698607194,
				["DOT_Time"] = 1698607187,
				["Damage"] = 1698607188,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"HEAL", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"HEAL", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"HEAL", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"HEAL", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["RageGain"] = {
					51, -- [1]
				},
				["Overhealing"] = {
					2226, -- [1]
				},
				["ActiveTime"] = {
					42.02999999999999, -- [1]
				},
				["TimeDamage"] = {
					42.02999999999999, -- [1]
				},
				["DOT_Time"] = {
					3, -- [1]
				},
				["Damage"] = {
					115088, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "Saluma",
			["level"] = 80,
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				[47] = 5.180301399354145,
				[49] = 0.9983853606027987,
				[3] = 0.9983853606027987,
				[7] = 5.180301399354145,
				[31] = 5.180301399354145,
				[28] = 4.975780409041981,
				[37] = 5.180301399354145,
				[2] = 0.9983853606027987,
				[42] = 5.182992465016146,
				[22] = 4.975780409041981,
				[14] = 5.182992465016146,
			},
			["type"] = "Ungrouped",
			["FightsSaved"] = 1,
			["LastAbility"] = 91098.27,
			["Owner"] = false,
			["LastEventTimes"] = {
				12961.052, -- [1]
				12961.253, -- [2]
				12962.503, -- [3]
				12962.503, -- [4]
				12962.503, -- [5]
				12962.503, -- [6]
				12962.999, -- [7]
				12963.621, -- [8]
				12963.904, -- [9]
				12963.905, -- [10]
				12964.163, -- [11]
				12964.907, -- [12]
				12965.905, -- [13]
				12966.037, -- [14]
				12966.295, -- [15]
				12966.891, -- [16]
				12967.013, -- [17]
				12967.889, -- [18]
				12968.904, -- [19]
				12969.522, -- [20]
				12943.327, -- [21]
				12943.609, -- [22]
				12943.609, -- [23]
				12943.61, -- [24]
				12944.668, -- [25]
				12945.572, -- [26]
				12946.546, -- [27]
				12946.634, -- [28]
				12947.511, -- [29]
				12948.167, -- [30]
				12950.963, -- [31]
				12951.956, -- [32]
				12952.155, -- [33]
				12952.616, -- [34]
				12952.617, -- [35]
				12953.822, -- [36]
				12953.941, -- [37]
				12954.651, -- [38]
				12954.78, -- [39]
				12955.808, -- [40]
				12956.891, -- [41]
				12956.988, -- [42]
				12957.572, -- [43]
				12957.738, -- [44]
				12957.921, -- [45]
				12958.837, -- [46]
				12959.926, -- [47]
				12961.051, -- [48]
				12961.052, -- [49]
				12961.052, -- [50]
			},
			["NextEventNum"] = 21,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Saluma Атака ближнего боя Всадник без головы Crit -3831 (Physical)", -- [1]
				"Saluma Кровожадность Saluma Hit +371 (371 избыт. лечение)", -- [2]
				"Saluma Кровожадность Saluma Hit +371 (371 избыт. лечение)", -- [3]
				"Saluma Вихрь Всадник без головы Crit -9405 (Physical)", -- [4]
				"Saluma Вихрь Всадник без головы Crit -5120 (Physical)", -- [5]
				"Saluma Глубокие раны (УЗВ) Всадник без головы Tick -194 (Physical)", -- [6]
				"Slysweetelf Омоложение Saluma Tick +1925 (1925 избыт. лечение)", -- [7]
				"Saluma Удар героя Всадник без головы Crit -8983 (Physical)", -- [8]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [9]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [10]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [11]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [12]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [13]
				"Slysweetelf Омоложение Saluma Tick +1926 (1926 избыт. лечение)", -- [14]
				"Saluma Удар героя Всадник без головы Immune (Physical)", -- [15]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [16]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [17]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [18]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [19]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [20]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [21]
				"Slysweetelf Омоложение Saluma Tick +1849 (1849 избыт. лечение)", -- [22]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [23]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [24]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [25]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [26]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [27]
				"Slysweetelf Омоложение Saluma Tick +1849 (1849 избыт. лечение)", -- [28]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [29]
				"Saluma Атака ближнего боя Голова Всадника Crit -7341 (Physical)", -- [30]
				"Slysweetelf Омоложение Saluma Tick +1925 (1925 избыт. лечение)", -- [31]
				"Saluma Атака ближнего боя Всадник без головы Crit -4216 (Physical)", -- [32]
				"Saluma Удар героя Всадник без головы Hit -3979 (Physical)", -- [33]
				"Saluma Вихрь Всадник без головы Crit -9718 (Physical)", -- [34]
				"Saluma Вихрь Всадник без головы Crit -5575 (Physical)", -- [35]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [36]
				"Slysweetelf Омоложение Saluma Tick +1925 (1925 избыт. лечение)", -- [37]
				"Saluma Атака ближнего боя Всадник без головы Immune", -- [38]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [39]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [40]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [41]
				"Slysweetelf Омоложение Saluma Tick +1926 (1926 избыт. лечение)", -- [42]
				"Saluma Атака ближнего боя Голова Всадника Hit -2937 (Physical)", -- [43]
				"Saluma Атака ближнего боя Голова Всадника Hit -1987 (Physical)", -- [44]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [45]
				"Saluma Глубокие раны Всадник без головы Immune (Physical)", -- [46]
				"Slysweetelf Омоложение Saluma Tick +1925 (1925 избыт. лечение)", -- [47]
				"Saluma Кровожадность Всадник без головы Hit -4212 (Physical)", -- [48]
				"Saluma Кровожадность Saluma Hit +371 (371 избыт. лечение)", -- [49]
				"Saluma Удар героя Всадник без головы Hit -3448 (Physical)", -- [50]
			},
			["Name"] = "Saluma",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventHealth"] = {
				"37160 (100%)", -- [1]
				"37160 (100%)", -- [2]
				"37160 (100%)", -- [3]
				"37160 (100%)", -- [4]
				"37160 (100%)", -- [5]
				"37160 (100%)", -- [6]
				"37160 (100%)", -- [7]
				"37160 (100%)", -- [8]
				"37160 (100%)", -- [9]
				"37160 (100%)", -- [10]
				"37160 (100%)", -- [11]
				"37160 (100%)", -- [12]
				"37160 (100%)", -- [13]
				"37160 (100%)", -- [14]
				"37160 (100%)", -- [15]
				"37160 (100%)", -- [16]
				"37160 (100%)", -- [17]
				"37160 (100%)", -- [18]
				"37160 (100%)", -- [19]
				"37160 (100%)", -- [20]
				"37160 (100%)", -- [21]
				"37160 (100%)", -- [22]
				"37160 (100%)", -- [23]
				"37160 (100%)", -- [24]
				"37160 (100%)", -- [25]
				"37160 (100%)", -- [26]
				"37160 (100%)", -- [27]
				"37160 (100%)", -- [28]
				"37160 (100%)", -- [29]
				"37160 (100%)", -- [30]
				"37160 (100%)", -- [31]
				"37160 (100%)", -- [32]
				"37160 (100%)", -- [33]
				"37160 (100%)", -- [34]
				"37160 (100%)", -- [35]
				"37160 (100%)", -- [36]
				"37160 (100%)", -- [37]
				"37160 (100%)", -- [38]
				"37160 (100%)", -- [39]
				"37160 (100%)", -- [40]
				"37160 (100%)", -- [41]
				"37160 (100%)", -- [42]
				"37160 (100%)", -- [43]
				"37160 (100%)", -- [44]
				"37160 (100%)", -- [45]
				"37160 (100%)", -- [46]
				"37160 (100%)", -- [47]
				"37160 (100%)", -- [48]
				"37160 (100%)", -- [49]
				"37160 (100%)", -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 40,
					},
					["OverHeals"] = {
						["Кровожадность"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 371,
									["count"] = 6,
									["amount"] = 2226,
								},
							},
							["count"] = 6,
							["amount"] = 2226,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 1.51,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.939999999999998,
								},
								["Удар героя"] = {
									["count"] = 3.17,
								},
								["Вихрь"] = {
									["count"] = 3.24,
								},
								["Кровожадность"] = {
									["count"] = 3.93,
								},
								["Глубокие раны"] = {
									["count"] = 13.24,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 33.52,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RageGainedFrom"] = {
						["Saluma"] = {
							["Details"] = {
								["Необузданный гнев"] = {
									["count"] = 1,
								},
								["Кровавая ярость"] = {
									["count"] = 1,
								},
								["Символ удара героя"] = {
									["count"] = 20,
								},
							},
							["amount"] = 22,
						},
					},
					["Overhealing"] = 2226,
					["ActiveTime"] = 35.03,
					["RageGained"] = {
						["Необузданный гнев"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Кровавая ярость"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Символ удара героя"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["Damage"] = 98028,
					["DOTs"] = {
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDone"] = {
						["Melee"] = 24679,
						["Physical"] = 73349,
					},
					["RageGain"] = 22,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12265,
								},
							},
							["amount"] = 12265,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12414,
								},
								["Удар героя"] = {
									["count"] = 25029,
								},
								["Кровожадность"] = {
									["count"] = 8607,
								},
								["Вихрь"] = {
									["count"] = 39519,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 85763,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 35.03,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 1.51,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.939999999999998,
								},
								["Удар героя"] = {
									["count"] = 3.17,
								},
								["Вихрь"] = {
									["count"] = 3.24,
								},
								["Кровожадность"] = {
									["count"] = 3.93,
								},
								["Глубокие раны"] = {
									["count"] = 13.24,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 33.52,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DOT_Time"] = 3,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 22,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 34,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 2937,
									["min"] = 2937,
									["count"] = 1,
									["amount"] = 2937,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7341,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 19755,
								},
								["Hit"] = {
									["max"] = 1987,
									["min"] = 1987,
									["count"] = 1,
									["amount"] = 1987,
								},
							},
							["count"] = 14,
							["amount"] = 24679,
						},
						["Удар героя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8983,
									["min"] = 8619,
									["count"] = 2,
									["amount"] = 17602,
								},
								["Hit"] = {
									["max"] = 3979,
									["min"] = 3448,
									["count"] = 2,
									["amount"] = 7427,
								},
							},
							["count"] = 5,
							["amount"] = 25029,
						},
						["Вихрь"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 9718,
									["min"] = 5120,
									["count"] = 5,
									["amount"] = 39519,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 39519,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4395,
									["min"] = 4212,
									["count"] = 2,
									["amount"] = 8607,
								},
							},
							["count"] = 2,
							["amount"] = 8607,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 194,
									["min"] = 194,
									["count"] = 1,
									["amount"] = 194,
								},
							},
							["count"] = 1,
							["amount"] = 194,
						},
					},
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 40,
					},
					["OverHeals"] = {
						["Кровожадность"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 371,
									["count"] = 6,
									["amount"] = 2226,
								},
							},
							["count"] = 6,
							["amount"] = 2226,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 1.51,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.939999999999998,
								},
								["Удар героя"] = {
									["count"] = 3.17,
								},
								["Вихрь"] = {
									["count"] = 3.24,
								},
								["Кровожадность"] = {
									["count"] = 3.93,
								},
								["Глубокие раны"] = {
									["count"] = 13.24,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 33.52,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RageGainedFrom"] = {
						["Saluma"] = {
							["Details"] = {
								["Необузданный гнев"] = {
									["count"] = 1,
								},
								["Кровавая ярость"] = {
									["count"] = 1,
								},
								["Символ удара героя"] = {
									["count"] = 20,
								},
							},
							["amount"] = 22,
						},
					},
					["Overhealing"] = 2226,
					["ActiveTime"] = 35.03,
					["RageGained"] = {
						["Необузданный гнев"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Кровавая ярость"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Символ удара героя"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["Damage"] = 98028,
					["DOTs"] = {
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDone"] = {
						["Melee"] = 24679,
						["Physical"] = 73349,
					},
					["RageGain"] = 22,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12265,
								},
							},
							["amount"] = 12265,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12414,
								},
								["Удар героя"] = {
									["count"] = 25029,
								},
								["Кровожадность"] = {
									["count"] = 8607,
								},
								["Вихрь"] = {
									["count"] = 39519,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 85763,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 35.03,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 1.51,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.939999999999998,
								},
								["Удар героя"] = {
									["count"] = 3.17,
								},
								["Вихрь"] = {
									["count"] = 3.24,
								},
								["Кровожадность"] = {
									["count"] = 3.93,
								},
								["Глубокие раны"] = {
									["count"] = 13.24,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 33.52,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DOT_Time"] = 3,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 22,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 34,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 2937,
									["min"] = 2937,
									["count"] = 1,
									["amount"] = 2937,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7341,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 19755,
								},
								["Hit"] = {
									["max"] = 1987,
									["min"] = 1987,
									["count"] = 1,
									["amount"] = 1987,
								},
							},
							["count"] = 14,
							["amount"] = 24679,
						},
						["Удар героя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8983,
									["min"] = 8619,
									["count"] = 2,
									["amount"] = 17602,
								},
								["Hit"] = {
									["max"] = 3979,
									["min"] = 3448,
									["count"] = 2,
									["amount"] = 7427,
								},
							},
							["count"] = 5,
							["amount"] = 25029,
						},
						["Вихрь"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 9718,
									["min"] = 5120,
									["count"] = 5,
									["amount"] = 39519,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 39519,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4395,
									["min"] = 4212,
									["count"] = 2,
									["amount"] = 8607,
								},
							},
							["count"] = 2,
							["amount"] = 8607,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 194,
									["min"] = 194,
									["count"] = 1,
									["amount"] = 194,
								},
							},
							["count"] = 1,
							["amount"] = 194,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementTakenBlock"] = {
					},
					["RunicPowerGain"] = 0,
					["ElementTaken"] = {
					},
					["HOTs"] = {
					},
					["Damage"] = 0,
					["ElementDoneAbsorb"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["PartialBlock"] = {
					},
					["DamagedWho"] = {
					},
					["FAttacks"] = {
					},
					["HealingTaken"] = 0,
					["ElementDone"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementHitsDone"] = {
					},
					["ManaGainedFrom"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["Dispelled"] = 0,
					["WhoHealed"] = {
					},
					["HealedWho"] = {
					},
					["CCBreak"] = 0,
					["ElementTakenAbsorb"] = {
					},
					["FDamage"] = 0,
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["PartialAbsorb"] = {
					},
					["ActiveTime"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["ElementTakenResist"] = {
					},
					["Heals"] = {
					},
					["Interrupts"] = 0,
					["EnergyGained"] = {
					},
					["PartialResist"] = {
					},
					["Healing"] = 0,
					["RageGained"] = {
					},
					["OverHeals"] = {
					},
					["Attacks"] = {
					},
					["RageGain"] = 0,
					["FDamagedWho"] = {
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["DOT_Time"] = 0,
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 40,
					},
					["OverHeals"] = {
						["Кровожадность"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 371,
									["count"] = 6,
									["amount"] = 2226,
								},
							},
							["count"] = 6,
							["amount"] = 2226,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 1.51,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.939999999999998,
								},
								["Удар героя"] = {
									["count"] = 3.17,
								},
								["Вихрь"] = {
									["count"] = 3.24,
								},
								["Кровожадность"] = {
									["count"] = 3.93,
								},
								["Глубокие раны"] = {
									["count"] = 13.24,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 33.52,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["RageGainedFrom"] = {
						["Saluma"] = {
							["Details"] = {
								["Необузданный гнев"] = {
									["count"] = 1,
								},
								["Кровавая ярость"] = {
									["count"] = 30,
								},
								["Символ удара героя"] = {
									["count"] = 20,
								},
							},
							["amount"] = 51,
						},
					},
					["Overhealing"] = 2226,
					["ActiveTime"] = 42.02999999999999,
					["RageGained"] = {
						["Необузданный гнев"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Кровавая ярость"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["Символ удара героя"] = {
							["Details"] = {
								["Saluma"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["Damage"] = 115088,
					["DOTs"] = {
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDone"] = {
						["Melee"] = 41739,
						["Physical"] = 73349,
					},
					["RageGain"] = 51,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12265,
								},
							},
							["amount"] = 12265,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12414,
								},
								["Удар героя"] = {
									["count"] = 25029,
								},
								["Кровожадность"] = {
									["count"] = 8607,
								},
								["Вихрь"] = {
									["count"] = 39519,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 85763,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 17060,
								},
							},
							["amount"] = 17060,
						},
					},
					["TimeDamage"] = 42.02999999999999,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 1.51,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.939999999999998,
								},
								["Удар героя"] = {
									["count"] = 3.17,
								},
								["Вихрь"] = {
									["count"] = 3.24,
								},
								["Кровожадность"] = {
									["count"] = 3.93,
								},
								["Глубокие раны"] = {
									["count"] = 13.24,
								},
								["Глубокие раны (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 33.52,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["DOT_Time"] = 3,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 17,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 22,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 34,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 2937,
									["min"] = 2937,
									["count"] = 1,
									["amount"] = 2937,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7341,
									["min"] = 3831,
									["count"] = 7,
									["amount"] = 36815,
								},
								["Hit"] = {
									["max"] = 1987,
									["min"] = 1987,
									["count"] = 1,
									["amount"] = 1987,
								},
							},
							["count"] = 17,
							["amount"] = 41739,
						},
						["Удар героя"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 8983,
									["min"] = 8619,
									["count"] = 2,
									["amount"] = 17602,
								},
								["Hit"] = {
									["max"] = 3979,
									["min"] = 3448,
									["count"] = 2,
									["amount"] = 7427,
								},
							},
							["count"] = 5,
							["amount"] = 25029,
						},
						["Вихрь"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 9718,
									["min"] = 5120,
									["count"] = 5,
									["amount"] = 39519,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 39519,
						},
						["Кровожадность"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4395,
									["min"] = 4212,
									["count"] = 2,
									["amount"] = 8607,
								},
							},
							["count"] = 2,
							["amount"] = 8607,
						},
						["Глубокие раны"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["Глубокие раны (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 194,
									["min"] = 194,
									["count"] = 1,
									["amount"] = 194,
								},
							},
							["count"] = 1,
							["amount"] = 194,
						},
					},
				},
			},
			["UnitLockout"] = 1698607141,
			["LastActive"] = 1698607194,
		},
	},
	["FightNum"] = 1,
	["CombatTimes"] = {
		{
			1698607162, -- [1]
			1698607197, -- [2]
			"01:19:22", -- [3]
			"01:19:57", -- [4]
			"Всадник без головы", -- [5]
		}, -- [1]
	},
	["FoughtWho"] = {
		"Всадник без головы 01:19:22-01:19:57", -- [1]
	},
}
