
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["Firstsight"] = {
			["GUID"] = "0x07000000008FB35E",
			["LastEventHealth"] = {
				"22465 (70%)", -- [1]
				"20045 (62%)", -- [2]
				"20045 (62%)", -- [3]
				"20045 (62%)", -- [4]
				"25479 (80%)", -- [5]
				"25479 (80%)", -- [6]
				"25479 (80%)", -- [7]
				"25479 (80%)", -- [8]
				"25479 (80%)", -- [9]
				"25637 (80%)", -- [10]
				"25694 (80%)", -- [11]
				"25778 (80%)", -- [12]
				"25778 (80%)", -- [13]
				"25778 (80%)", -- [14]
				"25853 (81%)", -- [15]
				"25853 (81%)", -- [16]
				"25853 (81%)", -- [17]
				"27362 (85%)", -- [18]
				"27362 (85%)", -- [19]
				"27362 (85%)", -- [20]
				"27438 (86%)", -- [21]
				"27595 (86%)", -- [22]
				"27595 (86%)", -- [23]
				"27595 (86%)", -- [24]
				"26304 (82%)", -- [25]
				"26304 (82%)", -- [26]
				"26379 (82%)", -- [27]
				"23812 (74%)", -- [28]
				"23970 (75%)", -- [29]
				"23970 (75%)", -- [30]
				"23970 (75%)", -- [31]
				"23970 (75%)", -- [32]
				"21403 (67%)", -- [33]
				"21403 (67%)", -- [34]
				"21403 (67%)", -- [35]
				"16774 (52%)", -- [36]
				"22130 (69%)", -- [37]
				"22130 (69%)", -- [38]
				"22130 (69%)", -- [39]
				"22130 (69%)", -- [40]
				"22130 (69%)", -- [41]
				"22465 (70%)", -- [42]
				"22465 (70%)", -- [43]
				"22465 (70%)", -- [44]
				"22465 (70%)", -- [45]
				"22465 (70%)", -- [46]
				"22465 (70%)", -- [47]
				"22465 (70%)", -- [48]
				"22465 (70%)", -- [49]
				"22465 (70%)", -- [50]
			},
			["LastAttackedBy"] = "Порожденный чумой ужас",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"MISC", -- [3]
				"MISC", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"HEAL", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"HEAL", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"HEAL", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"HEAL", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					0, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["Dispels"] = {
					1, -- [1]
				},
				["Healing"] = {
					1780, -- [1]
				},
				["DamageTaken"] = {
					123275, -- [1]
				},
				["GuessedAbsorbs"] = {
					10945, -- [1]
				},
				["HealingTaken"] = {
					116219, -- [1]
				},
				["Overhealing"] = {
					746, -- [1]
				},
				["TimeDamage"] = {
					79.37000000000001, -- [1]
				},
				["ActiveTime"] = {
					79.37000000000001, -- [1]
				},
				["ManaGain"] = {
					24909, -- [1]
				},
				["DOT_Time"] = {
					369, -- [1]
				},
				["Damage"] = {
					246608, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = "Firstsight",
			["level"] = 80,
			["LastDamageAbility"] = "Пустулезная плоть (УЗВ)",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				[29] = 0.4961844047357347,
				[15] = 0.2355305718682285,
				[33] = 8.061426373143235,
				[17] = 3.887824639638225,
				[18] = 8.626699745626983,
				[37] = 16.82002323901643,
				[10] = 0.4961844047357347,
				[42] = 1.052036554344754,
				[2] = 7.599786452281506,
				[22] = 0.493043997110825,
				[11] = 0.1790032346198537,
				[12] = 0.2637942404924159,
				[36] = 14.53694689570706,
				[21] = 0.2386709794931382,
				[27] = 0.2355305718682285,
				[24] = 4.05426624375844,
				[28] = 8.061426373143235,
			},
			["type"] = "Grouped",
			["LastAbility"] = 1794786.963,
			["LastDamageTaken"] = 2420,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 1680862122,
				["Dispelled"] = 1680862155,
				["Dispels"] = 1680862155,
				["OVERALL"] = 1680862155,
				["DamageTaken"] = 1680862151,
				["Healing"] = 1680862122,
				["GuessedAbsorbs"] = 1680862102,
				["HealingTaken"] = 1680862122,
				["Overhealing"] = 1680862073,
				["TimeDamage"] = 1680862134,
				["ActiveTime"] = 1680862134,
				["ManaGain"] = 1680862134,
				["DOT_Time"] = 1680862113,
				["Damage"] = 1680862134,
			},
			["NextEventNum"] = 5,
			["LastEventHealthNum"] = {
				70.54925729359671, -- [1]
				62.9494708413152, -- [2]
				62.9494708413152, -- [3]
				62.9494708413152, -- [4]
				80.01444587507459, -- [5]
				80.01444587507459, -- [6]
				80.01444587507459, -- [7]
				80.01444587507459, -- [8]
				80.01444587507459, -- [9]
				80.51063027981031, -- [10]
				80.68963351443017, -- [11]
				80.95342775492259, -- [12]
				80.95342775492259, -- [13]
				80.95342775492259, -- [14]
				81.18895832679081, -- [15]
				81.18895832679081, -- [16]
				81.18895832679081, -- [17]
				85.92783343277958, -- [18]
				85.92783343277958, -- [19]
				85.92783343277958, -- [20]
				86.16650441227272, -- [21]
				86.65954840938353, -- [22]
				86.65954840938353, -- [23]
				86.65954840938353, -- [24]
				82.6052821656251, -- [25]
				82.6052821656251, -- [26]
				82.84081273749332, -- [27]
				74.77938636435009, -- [28]
				75.27557076908583, -- [29]
				75.27557076908583, -- [30]
				75.27557076908583, -- [31]
				75.27557076908583, -- [32]
				67.2141443959426, -- [33]
				67.2141443959426, -- [34]
				67.2141443959426, -- [35]
				52.67719750023553, -- [36]
				69.49722073925196, -- [37]
				69.49722073925196, -- [38]
				69.49722073925196, -- [39]
				69.49722073925196, -- [40]
				69.49722073925196, -- [41]
				70.54925729359671, -- [42]
				70.54925729359671, -- [43]
				70.54925729359671, -- [44]
				70.54925729359671, -- [45]
				70.54925729359671, -- [46]
				70.54925729359671, -- [47]
				70.54925729359671, -- [48]
				70.54925729359671, -- [49]
				70.54925729359671, -- [50]
			},
			["LastEvents"] = {
				"Firstsight Атака ближнего боя Порожденный чумой ужас Hit -524 (Physical)", -- [1]
				"Порожденный чумой ужас Пустулезная плоть (УЗВ) Firstsight Tick -2420 (Nature)", -- [2]
				"Firstsight dispels Firstsight Пустулезная плоть (Очищение)", -- [3]
				"Firstsight dispels Firstsight Пустулезная плоть (Очищение)", -- [4]
				"Firstsight Освящение (УЗВ) Порожденный чумой ужас Tick -331 (Holy)", -- [5]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -305 (Holy)", -- [6]
				"Firstsight Молот праведника Порожденный чумой ужас Hit -1921 (Holy)", -- [7]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -260 (Holy)", -- [8]
				"Firstsight Атака ближнего боя Порожденный чумой ужас Hit -575 (Physical)", -- [9]
				"Phelorna Объятия вампира Firstsight Tick +158", -- [10]
				"Phelorna Объятия вампира Firstsight Tick +57", -- [11]
				"Phelorna Объятия вампира Firstsight Tick +84", -- [12]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -285 (Holy)", -- [13]
				"Firstsight Щит праведности Порожденный чумой ужас Hit -2467 (Holy)", -- [14]
				"Phelorna Объятия вампира Firstsight Tick +75", -- [15]
				"Firstsight Аура воздаяния Порожденный чумой ужас Hit -165 (Holy)", -- [16]
				"Порожденный чумой ужас Атака ближнего боя Firstsight Hit -1238 (Physical)", -- [17]
				"Smellmywind Щит земли Firstsight Hit +2747", -- [18]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -278 (Holy)", -- [19]
				"Firstsight Атака ближнего боя Порожденный чумой ужас Hit -474 (Physical)", -- [20]
				"Phelorna Объятия вампира Firstsight Tick +76", -- [21]
				"Phelorna Объятия вампира Firstsight Tick +157", -- [22]
				"Firstsight Аура воздаяния Порожденный чумой ужас Hit -165 (Holy)", -- [23]
				"Порожденный чумой ужас Атака ближнего боя Firstsight Hit -1291 (Physical)", -- [24]
				"Firstsight Печать повиновения Порожденный чумой ужас Crit -630 (Holy)", -- [25]
				"Firstsight Атака ближнего боя Порожденный чумой ужас Hit -544 (Physical)", -- [26]
				"Phelorna Объятия вампира Firstsight Tick +75", -- [27]
				"Порожденный чумой ужас Токсичный выброс (УЗВ) Firstsight Tick -2567 (Nature)", -- [28]
				"Phelorna Объятия вампира Firstsight Tick +158", -- [29]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -295 (Holy)", -- [30]
				"Firstsight Атака ближнего боя Порожденный чумой ужас Crit -1050 (Physical)", -- [31]
				"Порожденный чумой ужас Атака ближнего боя Firstsight Miss", -- [32]
				"Порожденный чумой ужас Токсичный выброс (УЗВ) Firstsight Tick -2567 (Nature)", -- [33]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -307 (Holy)", -- [34]
				"Firstsight Молот праведника Порожденный чумой ужас Hit -1961 (Holy)", -- [35]
				"Порожденный чумой ужас Пустулезная плоть Firstsight Hit -4629 (Nature)", -- [36]
				"Smellmywind Щит земли Firstsight Crit +5356", -- [37]
				"Firstsight Печать повиновения Порожденный чумой ужас Crit -522 (Holy)", -- [38]
				"Firstsight Атака ближнего боя Порожденный чумой ужас Hit -548 (Physical)", -- [39]
				"Порожденный чумой ужас Атака ближнего боя Firstsight Dodge", -- [40]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -296 (Holy)", -- [41]
				"Firstsight Оберег Firstsight Hit +335", -- [42]
				"Firstsight Атака ближнего боя Порожденный чумой ужас Hit -538 (Physical)", -- [43]
				"Порожденный чумой ужас Атака ближнего боя Firstsight Parry", -- [44]
				"Firstsight Правосудие повиновения Порожденный чумой ужас Crit -1296 (Holy)", -- [45]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -323 (Holy)", -- [46]
				"Firstsight Печать повиновения Порожденный чумой ужас Crit -530 (Holy)", -- [47]
				"Firstsight Атака ближнего боя Порожденный чумой ужас Hit -488 (Physical)", -- [48]
				"Firstsight Молот гнева Порожденный чумой ужас Hit -2208 (Holy)", -- [49]
				"Firstsight Печать повиновения Порожденный чумой ужас Hit -296 (Holy)", -- [50]
			},
			["Name"] = "Firstsight",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				1794786.963, -- [1]
				1794804.471, -- [2]
				1794807.864, -- [3]
				1794807.864, -- [4]
				1794766.848, -- [5]
				1794766.849, -- [6]
				1794766.849, -- [7]
				1794767.407, -- [8]
				1794767.407, -- [9]
				1794767.489, -- [10]
				1794769.081, -- [11]
				1794769.085, -- [12]
				1794769.089, -- [13]
				1794769.089, -- [14]
				1794769.09, -- [15]
				1794769.097, -- [16]
				1794769.098, -- [17]
				1794769.098, -- [18]
				1794769.1, -- [19]
				1794769.1, -- [20]
				1794769.26, -- [21]
				1794770.247, -- [22]
				1794770.712, -- [23]
				1794770.712, -- [24]
				1794770.787, -- [25]
				1794770.787, -- [26]
				1794771.136, -- [27]
				1794771.3, -- [28]
				1794772.252, -- [29]
				1794772.488, -- [30]
				1794772.488, -- [31]
				1794772.817, -- [32]
				1794773.309, -- [33]
				1794773.966, -- [34]
				1794773.966, -- [35]
				1794774.2, -- [36]
				1794774.262, -- [37]
				1794774.278, -- [38]
				1794774.325, -- [39]
				1794774.779, -- [40]
				1794776.141, -- [41]
				1794776.142, -- [42]
				1794776.142, -- [43]
				1794776.732, -- [44]
				1794776.828, -- [45]
				1794777.138, -- [46]
				1794777.139, -- [47]
				1794777.139, -- [48]
				1794785.391, -- [49]
				1794786.962, -- [50]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
						["Освящение (УЗВ)"] = {
							["Details"] = {
								["Горгулья с каменным хребтом"] = {
									["count"] = 195,
								},
								["Порожденный чумой ужас"] = {
									["count"] = 174,
								},
							},
							["amount"] = 369,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 12,
								},
								["Miss"] = {
									["count"] = 5,
								},
								["Block"] = {
									["count"] = 20,
								},
								["Hit"] = {
									["count"] = 18,
								},
								["Parry"] = {
									["count"] = 8,
								},
							},
							["amount"] = 68,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 23,
						},
					},
					["WhoHealed"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 3381,
								},
								["Щит земли"] = {
									["count"] = 47930,
								},
								["Жизнь Земли"] = {
									["count"] = 4590,
								},
								["Пробуждение древних"] = {
									["count"] = 8412,
								},
								["Малая волна исцеления"] = {
									["count"] = 21285,
								},
								["Быстрина"] = {
									["count"] = 21341,
								},
							},
							["amount"] = 106939,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7500,
								},
							},
							["amount"] = 7500,
						},
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 1780,
								},
							},
							["amount"] = 1780,
						},
					},
					["GuessedAbsorbs"] = 10945,
					["Overhealing"] = 746,
					["ElementTaken"] = {
						["Physical"] = 0,
						["Melee"] = 19282,
						["Nature"] = 101210,
					},
					["DOT_Time"] = 369,
					["ElementTakenBlock"] = {
						["Melee"] = 28232,
					},
					["TimeHeal"] = 0,
					["ShieldedWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Священный щит"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["Dispels"] = 1,
					["ElementDone"] = {
						["Melee"] = 34092,
						["Holy"] = 212516,
					},
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 21873,
								},
								["Гнев небес"] = {
									["count"] = 5087,
								},
								["Аура воздаяния"] = {
									["count"] = 1218,
								},
								["Правосудие повиновения"] = {
									["count"] = 2125,
								},
								["Щит небес"] = {
									["count"] = 3250,
								},
								["Атака ближнего боя"] = {
									["count"] = 6304,
								},
								["Печать повиновения"] = {
									["count"] = 28459,
								},
								["Щит мстителя"] = {
									["count"] = 4047,
								},
								["Щит праведности"] = {
									["count"] = 2467,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 22557,
								},
							},
							["amount"] = 97387,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 23790,
								},
								["Молот гнева"] = {
									["count"] = 2208,
								},
								["Аура воздаяния"] = {
									["count"] = 1819,
								},
								["Правосудие повиновения"] = {
									["count"] = 4641,
								},
								["Щит небес"] = {
									["count"] = 4600,
								},
								["Атака ближнего боя"] = {
									["count"] = 27788,
								},
								["Печать повиновения"] = {
									["count"] = 30601,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 19923,
								},
								["Щит мстителя"] = {
									["count"] = 9352,
								},
								["Длань возмездия"] = {
									["count"] = 7230,
								},
								["Щит праведности"] = {
									["count"] = 17269,
								},
							},
							["amount"] = 149221,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12994,
								},
								["Пустулезная плоть"] = {
									["count"] = 9694,
								},
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 15181,
								},
								["Пустулезная плоть (УЗВ)"] = {
									["count"] = 2420,
								},
							},
							["amount"] = 40289,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6288,
								},
								["Удар горгульи"] = {
									["count"] = 73915,
								},
							},
							["amount"] = 80203,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneBlock"] = {
						["Melee"] = 80,
						["Holy"] = 320,
					},
					["TimeHealing"] = {
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
						["Оберег"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 375,
									["min"] = 371,
									["count"] = 2,
									["amount"] = 746,
								},
							},
							["count"] = 2,
							["amount"] = 746,
						},
					},
					["GuessedAbsorbed"] = {
						["Священный щит"] = {
							["Details"] = {
								["Firstsight"] = {
									["max"] = 2083,
									["min"] = 121,
									["count"] = 12,
									["amount"] = 10945,
								},
							},
							["count"] = 12,
							["amount"] = 10945,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 68,
									["amount"] = 0,
								},
							},
							["count"] = 68,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
						["Благословение неприкосновенности"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 4914,
								},
							},
							["amount"] = 4914,
						},
						["Волшебный поток"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 353,
								},
							},
							["amount"] = 353,
						},
						["Духовное созвучие"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 5428,
								},
							},
							["amount"] = 5428,
						},
						["Святая клятва"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 8820,
								},
							},
							["amount"] = 8820,
						},
						["Правосудие мудрости"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 5394,
								},
							},
							["amount"] = 5394,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Поглощено"] = {
									["max"] = 1291,
									["min"] = 121,
									["count"] = 8,
									["amount"] = 5557,
								},
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 60,
									["amount"] = 0,
								},
							},
							["count"] = 68,
							["amount"] = 5557,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Поглощено"] = {
									["max"] = 221,
									["min"] = 221,
									["count"] = 1,
									["amount"] = 221,
								},
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 221,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Поглощено"] = {
									["max"] = 2083,
									["min"] = 73,
									["count"] = 4,
									["amount"] = 5240,
								},
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 5240,
						},
					},
					["ActiveTime"] = 79.37000000000001,
					["ManaGainedFrom"] = {
						["Firstsight"] = {
							["Details"] = {
								["Благословение неприкосновенности"] = {
									["count"] = 4914,
								},
								["Волшебный поток"] = {
									["count"] = 353,
								},
								["Духовное созвучие"] = {
									["count"] = 5428,
								},
								["Святая клятва"] = {
									["count"] = 8820,
								},
								["Правосудие мудрости"] = {
									["count"] = 5394,
								},
							},
							["amount"] = 24909,
						},
					},
					["Dispelled"] = 2,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Firstsight"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["HealedWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 1780,
								},
							},
							["amount"] = 1780,
						},
					},
					["Heals"] = {
						["Оберег"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 369,
									["min"] = 335,
									["count"] = 5,
									["amount"] = 1780,
								},
							},
							["count"] = 5,
							["amount"] = 1780,
						},
					},
					["ShieldDamagedBy"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Священный щит"] = {
									["max"] = 1291,
									["min"] = 121,
									["count"] = 5,
									["amount"] = 2946,
								},
							},
							["count"] = 5,
							["amount"] = 2946,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Священный щит"] = {
									["max"] = 2083,
									["min"] = 239,
									["count"] = 7,
									["amount"] = 7999,
								},
							},
							["count"] = 7,
							["amount"] = 7999,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 5557,
						["Nature"] = 5461,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 1594,
									["min"] = 1026,
									["count"] = 22,
									["amount"] = 28232,
								},
							},
							["count"] = 22,
							["amount"] = 28232,
						},
					},
					["Healing"] = 1780,
					["TimeSpent"] = {
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Гнев небес"] = {
									["count"] = 0.02,
								},
								["Аура воздаяния"] = {
									["count"] = 0.79,
								},
								["Правосудие повиновения"] = {
									["count"] = 0.6900000000000001,
								},
								["Щит небес"] = {
									["count"] = 0.03,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Печать повиновения"] = {
									["count"] = 0.71,
								},
								["Щит мстителя"] = {
									["count"] = 0,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 2.29,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Молот гнева"] = {
									["count"] = 3.5,
								},
								["Аура воздаяния"] = {
									["count"] = 13.78,
								},
								["Правосудие повиновения"] = {
									["count"] = 2.78,
								},
								["Щит небес"] = {
									["count"] = 3.54,
								},
								["Атака ближнего боя"] = {
									["count"] = 0.05,
								},
								["Печать повиновения"] = {
									["count"] = 33.16999999999999,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 16.37,
								},
								["Щит мстителя"] = {
									["count"] = 0.06000000000000001,
								},
								["Длань возмездия"] = {
									["count"] = 3.83,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
							},
							["amount"] = 77.08,
						},
					},
					["DamageTaken"] = 120492,
					["Attacks"] = {
						["Молот праведника"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 1921,
									["min"] = 1921,
									["count"] = 1,
									["amount"] = 1921,
								},
								["Crit"] = {
									["max"] = 3922,
									["min"] = 3922,
									["count"] = 3,
									["amount"] = 11766,
								},
								["Hit"] = {
									["max"] = 2256,
									["min"] = 1961,
									["count"] = 16,
									["amount"] = 31976,
								},
							},
							["count"] = 20,
							["amount"] = 45663,
						},
						["Гнев небес"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2633,
									["min"] = 2454,
									["count"] = 2,
									["amount"] = 5087,
								},
							},
							["count"] = 2,
							["amount"] = 5087,
						},
						["Молот гнева"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2208,
									["min"] = 2208,
									["count"] = 1,
									["amount"] = 2208,
								},
							},
							["count"] = 1,
							["amount"] = 2208,
						},
						["Аура воздаяния"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 197,
									["min"] = 165,
									["count"] = 18,
									["amount"] = 3037,
								},
							},
							["count"] = 18,
							["amount"] = 3037,
						},
						["Правосудие повиновения"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1352,
									["min"] = 1296,
									["count"] = 3,
									["amount"] = 3992,
								},
								["Hit"] = {
									["max"] = 773,
									["min"] = 650,
									["count"] = 4,
									["amount"] = 2774,
								},
							},
							["count"] = 7,
							["amount"] = 6766,
						},
						["Щит небес"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 730,
									["min"] = 635,
									["count"] = 12,
									["amount"] = 7850,
								},
							},
							["count"] = 12,
							["amount"] = 7850,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 643,
									["min"] = 581,
									["count"] = 2,
									["amount"] = 1224,
								},
								["Crit"] = {
									["max"] = 1230,
									["min"] = 938,
									["count"] = 9,
									["amount"] = 9526,
								},
								["Hit"] = {
									["max"] = 700,
									["min"] = 459,
									["count"] = 42,
									["amount"] = 23342,
								},
							},
							["count"] = 53,
							["amount"] = 34092,
						},
						["Печать повиновения"] = {
							["Details"] = {
								["Crit (Блокировано)"] = {
									["max"] = 630,
									["min"] = 630,
									["count"] = 1,
									["amount"] = 630,
								},
								["Hit (Блокировано)"] = {
									["max"] = 335,
									["min"] = 250,
									["count"] = 6,
									["amount"] = 1702,
								},
								["Crit"] = {
									["max"] = 768,
									["min"] = 522,
									["count"] = 34,
									["amount"] = 20960,
								},
								["Hit"] = {
									["max"] = 384,
									["min"] = 260,
									["count"] = 118,
									["amount"] = 35768,
								},
							},
							["count"] = 159,
							["amount"] = 59060,
						},
						["Освящение (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 388,
									["min"] = 331,
									["count"] = 123,
									["amount"] = 42480,
								},
							},
							["count"] = 123,
							["amount"] = 42480,
						},
						["Щит мстителя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3866,
									["min"] = 3866,
									["count"] = 1,
									["amount"] = 3866,
								},
								["Hit"] = {
									["max"] = 2093,
									["min"] = 1743,
									["count"] = 5,
									["amount"] = 9533,
								},
							},
							["count"] = 6,
							["amount"] = 13399,
						},
						["Длань возмездия"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2954,
									["min"] = 2954,
									["count"] = 1,
									["amount"] = 2954,
								},
								["Hit"] = {
									["max"] = 2306,
									["min"] = 1970,
									["count"] = 2,
									["amount"] = 4276,
								},
							},
							["count"] = 3,
							["amount"] = 7230,
						},
						["Щит праведности"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4934,
									["min"] = 4934,
									["count"] = 1,
									["amount"] = 4934,
								},
								["Hit"] = {
									["max"] = 2467,
									["min"] = 2467,
									["count"] = 6,
									["amount"] = 14802,
								},
							},
							["count"] = 7,
							["amount"] = 19736,
						},
					},
					["HealingTaken"] = 116219,
					["Damage"] = 246608,
					["TimeDamage"] = 79.37000000000001,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Гнев небес"] = {
									["count"] = 0.02,
								},
								["Аура воздаяния"] = {
									["count"] = 0.79,
								},
								["Правосудие повиновения"] = {
									["count"] = 0.6900000000000001,
								},
								["Щит небес"] = {
									["count"] = 0.03,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Печать повиновения"] = {
									["count"] = 0.71,
								},
								["Щит мстителя"] = {
									["count"] = 0,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 2.29,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Молот гнева"] = {
									["count"] = 3.5,
								},
								["Аура воздаяния"] = {
									["count"] = 13.78,
								},
								["Правосудие повиновения"] = {
									["count"] = 2.78,
								},
								["Щит небес"] = {
									["count"] = 3.54,
								},
								["Атака ближнего боя"] = {
									["count"] = 0.05,
								},
								["Печать повиновения"] = {
									["count"] = 33.16999999999999,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 16.37,
								},
								["Щит мстителя"] = {
									["count"] = 0.06000000000000001,
								},
								["Длань возмездия"] = {
									["count"] = 3.83,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
							},
							["amount"] = 77.08,
						},
					},
					["ManaGain"] = 24909,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 44,
								},
							},
							["amount"] = 53,
						},
						["Holy"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 123,
								},
								["Crit"] = {
									["count"] = 46,
								},
								["Hit"] = {
									["count"] = 189,
								},
							},
							["amount"] = 358,
						},
					},
					["DispelledWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["Освящение (УЗВ)"] = {
							["Details"] = {
								["Горгулья с каменным хребтом"] = {
									["count"] = 195,
								},
								["Порожденный чумой ужас"] = {
									["count"] = 174,
								},
							},
							["amount"] = 369,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 12,
								},
								["Miss"] = {
									["count"] = 5,
								},
								["Block"] = {
									["count"] = 20,
								},
								["Hit"] = {
									["count"] = 18,
								},
								["Parry"] = {
									["count"] = 8,
								},
							},
							["amount"] = 68,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 23,
						},
					},
					["WhoHealed"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 3381,
								},
								["Щит земли"] = {
									["count"] = 47930,
								},
								["Жизнь Земли"] = {
									["count"] = 4590,
								},
								["Пробуждение древних"] = {
									["count"] = 8412,
								},
								["Малая волна исцеления"] = {
									["count"] = 21285,
								},
								["Быстрина"] = {
									["count"] = 21341,
								},
							},
							["amount"] = 106939,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7500,
								},
							},
							["amount"] = 7500,
						},
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 1780,
								},
							},
							["amount"] = 1780,
						},
					},
					["GuessedAbsorbs"] = 10945,
					["Overhealing"] = 746,
					["ElementTaken"] = {
						["Physical"] = 2783,
						["Melee"] = 19282,
						["Nature"] = 101210,
					},
					["DOT_Time"] = 369,
					["ElementTakenBlock"] = {
						["Melee"] = 28232,
					},
					["TimeHeal"] = 0,
					["ShieldedWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Священный щит"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["Dispels"] = 1,
					["ElementDone"] = {
						["Melee"] = 34092,
						["Holy"] = 212516,
					},
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 21873,
								},
								["Гнев небес"] = {
									["count"] = 5087,
								},
								["Аура воздаяния"] = {
									["count"] = 1218,
								},
								["Правосудие повиновения"] = {
									["count"] = 2125,
								},
								["Щит небес"] = {
									["count"] = 3250,
								},
								["Атака ближнего боя"] = {
									["count"] = 6304,
								},
								["Печать повиновения"] = {
									["count"] = 28459,
								},
								["Щит мстителя"] = {
									["count"] = 4047,
								},
								["Щит праведности"] = {
									["count"] = 2467,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 22557,
								},
							},
							["amount"] = 97387,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 23790,
								},
								["Молот гнева"] = {
									["count"] = 2208,
								},
								["Аура воздаяния"] = {
									["count"] = 1819,
								},
								["Правосудие повиновения"] = {
									["count"] = 4641,
								},
								["Щит небес"] = {
									["count"] = 4600,
								},
								["Атака ближнего боя"] = {
									["count"] = 27788,
								},
								["Печать повиновения"] = {
									["count"] = 30601,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 19923,
								},
								["Щит мстителя"] = {
									["count"] = 9352,
								},
								["Длань возмездия"] = {
									["count"] = 7230,
								},
								["Щит праведности"] = {
									["count"] = 17269,
								},
							},
							["amount"] = 149221,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12994,
								},
								["Пустулезная плоть"] = {
									["count"] = 9694,
								},
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 15181,
								},
								["Пустулезная плоть (УЗВ)"] = {
									["count"] = 2420,
								},
							},
							["amount"] = 40289,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6288,
								},
								["Удар горгульи"] = {
									["count"] = 73915,
								},
							},
							["amount"] = 80203,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2783,
								},
							},
							["amount"] = 2783,
						},
					},
					["ElementDoneBlock"] = {
						["Melee"] = 80,
						["Holy"] = 320,
					},
					["TimeHealing"] = {
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
						["Оберег"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 375,
									["min"] = 371,
									["count"] = 2,
									["amount"] = 746,
								},
							},
							["count"] = 2,
							["amount"] = 746,
						},
					},
					["GuessedAbsorbed"] = {
						["Священный щит"] = {
							["Details"] = {
								["Firstsight"] = {
									["max"] = 2083,
									["min"] = 121,
									["count"] = 12,
									["amount"] = 10945,
								},
							},
							["count"] = 12,
							["amount"] = 10945,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 68,
									["amount"] = 0,
								},
							},
							["count"] = 68,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
						["Благословение неприкосновенности"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 4914,
								},
							},
							["amount"] = 4914,
						},
						["Волшебный поток"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 353,
								},
							},
							["amount"] = 353,
						},
						["Духовное созвучие"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 5428,
								},
							},
							["amount"] = 5428,
						},
						["Святая клятва"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 8820,
								},
							},
							["amount"] = 8820,
						},
						["Правосудие мудрости"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 5394,
								},
							},
							["amount"] = 5394,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Поглощено"] = {
									["max"] = 1291,
									["min"] = 121,
									["count"] = 8,
									["amount"] = 5557,
								},
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 60,
									["amount"] = 0,
								},
							},
							["count"] = 68,
							["amount"] = 5557,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Поглощено"] = {
									["max"] = 221,
									["min"] = 221,
									["count"] = 1,
									["amount"] = 221,
								},
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 221,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Поглощено"] = {
									["max"] = 2083,
									["min"] = 73,
									["count"] = 4,
									["amount"] = 5240,
								},
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 5240,
						},
					},
					["ActiveTime"] = 79.37000000000001,
					["ManaGainedFrom"] = {
						["Firstsight"] = {
							["Details"] = {
								["Благословение неприкосновенности"] = {
									["count"] = 4914,
								},
								["Волшебный поток"] = {
									["count"] = 353,
								},
								["Духовное созвучие"] = {
									["count"] = 5428,
								},
								["Святая клятва"] = {
									["count"] = 8820,
								},
								["Правосудие мудрости"] = {
									["count"] = 5394,
								},
							},
							["amount"] = 24909,
						},
					},
					["Dispelled"] = 2,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Firstsight"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["HealedWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 1780,
								},
							},
							["amount"] = 1780,
						},
					},
					["Heals"] = {
						["Оберег"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 369,
									["min"] = 335,
									["count"] = 5,
									["amount"] = 1780,
								},
							},
							["count"] = 5,
							["amount"] = 1780,
						},
					},
					["ShieldDamagedBy"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Священный щит"] = {
									["max"] = 1291,
									["min"] = 121,
									["count"] = 5,
									["amount"] = 2946,
								},
							},
							["count"] = 5,
							["amount"] = 2946,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Священный щит"] = {
									["max"] = 2083,
									["min"] = 239,
									["count"] = 7,
									["amount"] = 7999,
								},
							},
							["count"] = 7,
							["amount"] = 7999,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 5557,
						["Nature"] = 5461,
					},
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 1594,
									["min"] = 1026,
									["count"] = 22,
									["amount"] = 28232,
								},
							},
							["count"] = 22,
							["amount"] = 28232,
						},
					},
					["Healing"] = 1780,
					["TimeSpent"] = {
						["Firstsight"] = {
							["Details"] = {
								["Оберег"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Гнев небес"] = {
									["count"] = 0.02,
								},
								["Аура воздаяния"] = {
									["count"] = 0.79,
								},
								["Правосудие повиновения"] = {
									["count"] = 0.6900000000000001,
								},
								["Щит небес"] = {
									["count"] = 0.03,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Печать повиновения"] = {
									["count"] = 0.71,
								},
								["Щит мстителя"] = {
									["count"] = 0,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 2.29,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Молот гнева"] = {
									["count"] = 3.5,
								},
								["Аура воздаяния"] = {
									["count"] = 13.78,
								},
								["Правосудие повиновения"] = {
									["count"] = 2.78,
								},
								["Щит небес"] = {
									["count"] = 3.54,
								},
								["Атака ближнего боя"] = {
									["count"] = 0.05,
								},
								["Печать повиновения"] = {
									["count"] = 33.16999999999999,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 16.37,
								},
								["Щит мстителя"] = {
									["count"] = 0.06000000000000001,
								},
								["Длань возмездия"] = {
									["count"] = 3.83,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
							},
							["amount"] = 77.08,
						},
					},
					["DamageTaken"] = 123275,
					["Attacks"] = {
						["Молот праведника"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 1921,
									["min"] = 1921,
									["count"] = 1,
									["amount"] = 1921,
								},
								["Crit"] = {
									["max"] = 3922,
									["min"] = 3922,
									["count"] = 3,
									["amount"] = 11766,
								},
								["Hit"] = {
									["max"] = 2256,
									["min"] = 1961,
									["count"] = 16,
									["amount"] = 31976,
								},
							},
							["count"] = 20,
							["amount"] = 45663,
						},
						["Гнев небес"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2633,
									["min"] = 2454,
									["count"] = 2,
									["amount"] = 5087,
								},
							},
							["count"] = 2,
							["amount"] = 5087,
						},
						["Молот гнева"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2208,
									["min"] = 2208,
									["count"] = 1,
									["amount"] = 2208,
								},
							},
							["count"] = 1,
							["amount"] = 2208,
						},
						["Аура воздаяния"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 197,
									["min"] = 165,
									["count"] = 18,
									["amount"] = 3037,
								},
							},
							["count"] = 18,
							["amount"] = 3037,
						},
						["Правосудие повиновения"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1352,
									["min"] = 1296,
									["count"] = 3,
									["amount"] = 3992,
								},
								["Hit"] = {
									["max"] = 773,
									["min"] = 650,
									["count"] = 4,
									["amount"] = 2774,
								},
							},
							["count"] = 7,
							["amount"] = 6766,
						},
						["Щит небес"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 730,
									["min"] = 635,
									["count"] = 12,
									["amount"] = 7850,
								},
							},
							["count"] = 12,
							["amount"] = 7850,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 643,
									["min"] = 581,
									["count"] = 2,
									["amount"] = 1224,
								},
								["Crit"] = {
									["max"] = 1230,
									["min"] = 938,
									["count"] = 9,
									["amount"] = 9526,
								},
								["Hit"] = {
									["max"] = 700,
									["min"] = 459,
									["count"] = 42,
									["amount"] = 23342,
								},
							},
							["count"] = 53,
							["amount"] = 34092,
						},
						["Печать повиновения"] = {
							["Details"] = {
								["Crit (Блокировано)"] = {
									["max"] = 630,
									["min"] = 630,
									["count"] = 1,
									["amount"] = 630,
								},
								["Hit (Блокировано)"] = {
									["max"] = 335,
									["min"] = 250,
									["count"] = 6,
									["amount"] = 1702,
								},
								["Crit"] = {
									["max"] = 768,
									["min"] = 522,
									["count"] = 34,
									["amount"] = 20960,
								},
								["Hit"] = {
									["max"] = 384,
									["min"] = 260,
									["count"] = 118,
									["amount"] = 35768,
								},
							},
							["count"] = 159,
							["amount"] = 59060,
						},
						["Освящение (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 388,
									["min"] = 331,
									["count"] = 123,
									["amount"] = 42480,
								},
							},
							["count"] = 123,
							["amount"] = 42480,
						},
						["Щит мстителя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3866,
									["min"] = 3866,
									["count"] = 1,
									["amount"] = 3866,
								},
								["Hit"] = {
									["max"] = 2093,
									["min"] = 1743,
									["count"] = 5,
									["amount"] = 9533,
								},
							},
							["count"] = 6,
							["amount"] = 13399,
						},
						["Длань возмездия"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2954,
									["min"] = 2954,
									["count"] = 1,
									["amount"] = 2954,
								},
								["Hit"] = {
									["max"] = 2306,
									["min"] = 1970,
									["count"] = 2,
									["amount"] = 4276,
								},
							},
							["count"] = 3,
							["amount"] = 7230,
						},
						["Щит праведности"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4934,
									["min"] = 4934,
									["count"] = 1,
									["amount"] = 4934,
								},
								["Hit"] = {
									["max"] = 2467,
									["min"] = 2467,
									["count"] = 6,
									["amount"] = 14802,
								},
							},
							["count"] = 7,
							["amount"] = 19736,
						},
					},
					["HealingTaken"] = 116219,
					["Damage"] = 246608,
					["TimeDamage"] = 79.37000000000001,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Гнев небес"] = {
									["count"] = 0.02,
								},
								["Аура воздаяния"] = {
									["count"] = 0.79,
								},
								["Правосудие повиновения"] = {
									["count"] = 0.6900000000000001,
								},
								["Щит небес"] = {
									["count"] = 0.03,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Печать повиновения"] = {
									["count"] = 0.71,
								},
								["Щит мстителя"] = {
									["count"] = 0,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 2.29,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Молот праведника"] = {
									["count"] = 0,
								},
								["Молот гнева"] = {
									["count"] = 3.5,
								},
								["Аура воздаяния"] = {
									["count"] = 13.78,
								},
								["Правосудие повиновения"] = {
									["count"] = 2.78,
								},
								["Щит небес"] = {
									["count"] = 3.54,
								},
								["Атака ближнего боя"] = {
									["count"] = 0.05,
								},
								["Печать повиновения"] = {
									["count"] = 33.16999999999999,
								},
								["Освящение (УЗВ)"] = {
									["count"] = 16.37,
								},
								["Щит мстителя"] = {
									["count"] = 0.06000000000000001,
								},
								["Длань возмездия"] = {
									["count"] = 3.83,
								},
								["Щит праведности"] = {
									["count"] = 0,
								},
							},
							["amount"] = 77.08,
						},
					},
					["ManaGain"] = 24909,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 44,
								},
							},
							["amount"] = 53,
						},
						["Holy"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 123,
								},
								["Crit"] = {
									["count"] = 46,
								},
								["Hit"] = {
									["count"] = 189,
								},
							},
							["amount"] = 358,
						},
					},
					["DispelledWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 1680861999,
			["LastActive"] = 1680862155,
		},
		["Phelorna"] = {
			["GUID"] = "0x07000000008AD2E3",
			["LastEventHealth"] = {
				"19908 (100%)", -- [1]
				"19908 (100%)", -- [2]
				"19908 (100%)", -- [3]
				"19908 (100%)", -- [4]
				"19908 (100%)", -- [5]
				"19908 (100%)", -- [6]
				"19908 (100%)", -- [7]
				"19908 (100%)", -- [8]
				"19908 (100%)", -- [9]
				"19908 (100%)", -- [10]
				"19908 (100%)", -- [11]
				"19908 (100%)", -- [12]
				"19908 (100%)", -- [13]
				"19908 (100%)", -- [14]
				"19908 (100%)", -- [15]
				"19908 (100%)", -- [16]
				"19908 (100%)", -- [17]
				"19908 (100%)", -- [18]
				"19908 (100%)", -- [19]
				"19908 (100%)", -- [20]
				"19908 (100%)", -- [21]
				"19908 (100%)", -- [22]
				"19908 (100%)", -- [23]
				"19908 (100%)", -- [24]
				"19908 (100%)", -- [25]
				"19908 (100%)", -- [26]
				"19908 (100%)", -- [27]
				"19908 (100%)", -- [28]
				"19908 (100%)", -- [29]
				"19908 (100%)", -- [30]
				"19908 (100%)", -- [31]
				"19908 (100%)", -- [32]
				"19908 (100%)", -- [33]
				"19908 (100%)", -- [34]
				"19908 (100%)", -- [35]
				"19908 (100%)", -- [36]
				"19908 (100%)", -- [37]
				"19908 (100%)", -- [38]
				"19908 (100%)", -- [39]
				"19908 (100%)", -- [40]
				"19908 (100%)", -- [41]
				"19908 (100%)", -- [42]
				"19908 (100%)", -- [43]
				"19908 (100%)", -- [44]
				"19908 (100%)", -- [45]
				"19908 (100%)", -- [46]
				"19908 (100%)", -- [47]
				"19908 (100%)", -- [48]
				"19908 (100%)", -- [49]
				"19908 (100%)", -- [50]
			},
			["LastAttackedBy"] = "Порожденный чумой ужас",
			["LastEventType"] = {
				"HEAL", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"HEAL", -- [4]
				"HEAL", -- [5]
				"HEAL", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"HEAL", -- [12]
				"HEAL", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"HEAL", -- [16]
				"HEAL", -- [17]
				"HEAL", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"HEAL", -- [21]
				"HEAL", -- [22]
				"HEAL", -- [23]
				"HEAL", -- [24]
				"HEAL", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"HEAL", -- [29]
				"HEAL", -- [30]
				"HEAL", -- [31]
				"HEAL", -- [32]
				"DAMAGE", -- [33]
				"HEAL", -- [34]
				"HEAL", -- [35]
				"HEAL", -- [36]
				"HEAL", -- [37]
				"HEAL", -- [38]
				"DAMAGE", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"HEAL", -- [43]
				"HEAL", -- [44]
				"HEAL", -- [45]
				"DAMAGE", -- [46]
				"HEAL", -- [47]
				"HEAL", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					49.17999999999999, -- [1]
				},
				["Healing"] = {
					39533, -- [1]
				},
				["DamageTaken"] = {
					25733, -- [1]
				},
				["HOT_Time"] = {
					1305, -- [1]
				},
				["HealingTaken"] = {
					25273, -- [1]
				},
				["Overhealing"] = {
					45475, -- [1]
				},
				["ActiveTime"] = {
					55, -- [1]
				},
				["TimeDamage"] = {
					5.819999999999999, -- [1]
				},
				["ManaGain"] = {
					1001, -- [1]
				},
				["DOT_Time"] = {
					153, -- [1]
				},
				["Damage"] = {
					182792, -- [1]
				},
			},
			["enClass"] = "PRIEST",
			["unit"] = "Phelorna",
			["level"] = 80,
			["LastDamageAbility"] = "Токсичный выброс (УЗВ)",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				[12] = 4.149085794655415,
				[6] = 1.994173196704842,
				[40] = 0.9041591320072333,
				[44] = 2.215189873417721,
				[31] = 4.154108900944344,
				[18] = 1.984126984126984,
				[37] = 1.506931886678722,
				[24] = 4.154108900944344,
				[50] = 1.984126984126984,
			},
			["type"] = "Self",
			["LastAbility"] = 1794772.255,
			["LastDamageTaken"] = 1691,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 1680862118,
				["OVERALL"] = 1680862118,
				["DamageTaken"] = 1680862088,
				["TimeDamage"] = 1680862118,
				["Overhealing"] = 1680862118,
				["HealingTaken"] = 1680862088,
				["HOT_Time"] = 1680862118,
				["ActiveTime"] = 1680862118,
				["Healing"] = 1680862118,
				["ManaGain"] = 1680862109,
				["DOT_Time"] = 1680862115,
				["Damage"] = 1680862118,
			},
			["NextEventNum"] = 27,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Phelorna Объятия вампира Smellmywind Tick +79 (79 избыт. лечение)", -- [1]
				"Phelorna Пытка разума Порожденный чумой ужас Hit -1421 (Shadow)", -- [2]
				"Phelorna Объятия вампира Lilladra Tick +80", -- [3]
				"Phelorna Объятия вампира Covardy Tick +79", -- [4]
				"Phelorna Объятия вампира Firstsight Tick +76", -- [5]
				"Phelorna Объятия вампира Phelorna Tick +397 (397 избыт. лечение)", -- [6]
				"Phelorna Объятия вампира Smellmywind Tick +75 (75 избыт. лечение)", -- [7]
				"Phelorna Пытка разума Порожденный чумой ужас Hit -1422 (Shadow)", -- [8]
				"Phelorna Объятия вампира Lilladra Tick +166", -- [9]
				"Phelorna Объятия вампира Covardy Tick +166", -- [10]
				"Phelorna Объятия вампира Firstsight Tick +157", -- [11]
				"Phelorna Объятия вампира Phelorna Tick +826 (826 избыт. лечение)", -- [12]
				"Phelorna Объятия вампира Smellmywind Tick +156 (156 избыт. лечение)", -- [13]
				"Phelorna Пытка разума Порожденный чумой ужас Crit -2970 (Shadow)", -- [14]
				"Phelorna Объятия вампира Lilladra Tick +79", -- [15]
				"Phelorna Объятия вампира Covardy Tick +79", -- [16]
				"Phelorna Объятия вампира Firstsight Tick +75", -- [17]
				"Phelorna Объятия вампира Phelorna Tick +395 (395 избыт. лечение)", -- [18]
				"Phelorna Объятия вампира Smellmywind Tick +74 (74 избыт. лечение)", -- [19]
				"Phelorna Пытка разума Порожденный чумой ужас Hit -1421 (Shadow)", -- [20]
				"Phelorna Объятия вампира Lilladra Tick +165", -- [21]
				"Phelorna Объятия вампира Covardy Tick +166", -- [22]
				"Phelorna Объятия вампира Firstsight Tick +158", -- [23]
				"Phelorna Объятия вампира Phelorna Tick +827 (827 избыт. лечение)", -- [24]
				"Phelorna Объятия вампира Smellmywind Tick +156 (156 избыт. лечение)", -- [25]
				"Phelorna Пытка разума Порожденный чумой ужас Crit -2970 (Shadow)", -- [26]
				"Phelorna Прикосновение вампира (УЗВ) Порожденный чумой ужас Crit -3309 (Shadow)", -- [27]
				"Phelorna Объятия вампира Lilladra Tick +165", -- [28]
				"Phelorna Объятия вампира Covardy Tick +166", -- [29]
				"Phelorna Объятия вампира Firstsight Tick +158", -- [30]
				"Phelorna Объятия вампира Phelorna Tick +827 (827 избыт. лечение)", -- [31]
				"Phelorna Объятия вампира Smellmywind Tick +165 (165 избыт. лечение)", -- [32]
				"Phelorna Пытка разума Порожденный чумой ужас Crit -2970 (Shadow)", -- [33]
				"Phelorna Объятия вампира Lilladra Tick +60", -- [34]
				"Phelorna Объятия вампира Covardy Tick +60", -- [35]
				"Phelorna Объятия вампира Firstsight Tick +57", -- [36]
				"Phelorna Объятия вампира Phelorna Tick +300 (300 избыт. лечение)", -- [37]
				"Phelorna Объятия вампира Smellmywind Tick +61 (61 избыт. лечение)", -- [38]
				"Phelorna Всепожирающая чума (УЗВ) Порожденный чумой ужас Tick -1081 (Shadow)", -- [39]
				"Phelorna Всепожирающая чума Phelorna Hit +180 (180 избыт. лечение)", -- [40]
				"Phelorna Объятия вампира Lilladra Tick +88", -- [41]
				"Phelorna Объятия вампира Covardy Tick +88", -- [42]
				"Phelorna Объятия вампира Firstsight Tick +84", -- [43]
				"Phelorna Объятия вампира Phelorna Tick +441 (441 избыт. лечение)", -- [44]
				"Phelorna Объятия вампира Smellmywind Tick +88 (88 избыт. лечение)", -- [45]
				"Phelorna Прикосновение вампира (УЗВ) Порожденный чумой ужас Tick -1583 (Shadow)", -- [46]
				"Phelorna Объятия вампира Lilladra Tick +79", -- [47]
				"Phelorna Объятия вампира Covardy Tick +79", -- [48]
				"Phelorna Объятия вампира Firstsight Tick +75", -- [49]
				"Phelorna Объятия вампира Phelorna Tick +395 (395 избыт. лечение)", -- [50]
			},
			["Name"] = "Phelorna",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				1794769.091, -- [1]
				1794769.091, -- [2]
				1794769.26, -- [3]
				1794769.26, -- [4]
				1794769.26, -- [5]
				1794769.261, -- [6]
				1794769.261, -- [7]
				1794769.261, -- [8]
				1794770.247, -- [9]
				1794770.247, -- [10]
				1794770.247, -- [11]
				1794770.247, -- [12]
				1794770.248, -- [13]
				1794770.248, -- [14]
				1794771.135, -- [15]
				1794771.136, -- [16]
				1794771.136, -- [17]
				1794771.136, -- [18]
				1794771.136, -- [19]
				1794771.136, -- [20]
				1794772.249, -- [21]
				1794772.251, -- [22]
				1794772.252, -- [23]
				1794772.253, -- [24]
				1794772.254, -- [25]
				1794772.255, -- [26]
				1794765.81, -- [27]
				1794767.488, -- [28]
				1794767.489, -- [29]
				1794767.489, -- [30]
				1794767.49, -- [31]
				1794767.49, -- [32]
				1794767.49, -- [33]
				1794769.081, -- [34]
				1794769.081, -- [35]
				1794769.081, -- [36]
				1794769.081, -- [37]
				1794769.082, -- [38]
				1794769.082, -- [39]
				1794769.082, -- [40]
				1794769.084, -- [41]
				1794769.085, -- [42]
				1794769.085, -- [43]
				1794769.086, -- [44]
				1794769.087, -- [45]
				1794769.087, -- [46]
				1794769.09, -- [47]
				1794769.09, -- [48]
				1794769.09, -- [49]
				1794769.09, -- [50]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["TimeHealing"] = {
						["Firstsight"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 20.39,
								},
							},
							["amount"] = 20.39,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.979999999999999,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3.979999999999999,
						},
						["Lilladra"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 13.27,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 8.09,
								},
							},
							["amount"] = 8.09,
						},
						["Covardy"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.45,
								},
							},
							["amount"] = 3.45,
						},
					},
					["OverHeals"] = {
						["Объятия вампира"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1047,
									["min"] = 16,
									["count"] = 169,
									["amount"] = 41356,
								},
							},
							["count"] = 169,
							["amount"] = 41356,
						},
						["Беспощадная всепожирающая чума"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 489,
									["min"] = 489,
									["count"] = 1,
									["amount"] = 489,
								},
								["Hit"] = {
									["max"] = 326,
									["min"] = 326,
									["count"] = 1,
									["amount"] = 326,
								},
							},
							["count"] = 2,
							["amount"] = 815,
						},
						["Всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 342,
									["min"] = 165,
									["count"] = 17,
									["amount"] = 3304,
								},
							},
							["count"] = 17,
							["amount"] = 3304,
						},
					},
					["ManaGainedFrom"] = {
						["Firstsight"] = {
							["Details"] = {
								["Правосудие мудрости"] = {
									["count"] = 1001,
								},
							},
							["amount"] = 1001,
						},
					},
					["DOTs"] = {
						["Прикосновение вампира (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
						["Всепожирающая чума (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 63,
								},
							},
							["amount"] = 63,
						},
						["Слово Тьмы: Боль (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoHealed"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 2161,
								},
								["Малая волна исцеления"] = {
									["count"] = 3081,
								},
								["Цепное исцеление"] = {
									["count"] = 4567,
								},
							},
							["amount"] = 9809,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13881,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 662,
								},
								["Всепожирающая чума"] = {
									["count"] = 921,
								},
							},
							["amount"] = 15464,
						},
					},
					["TimeSpent"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 8.09,
								},
							},
							["amount"] = 8.09,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.979999999999999,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3.979999999999999,
						},
						["Lilladra"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 13.27,
						},
						["Covardy"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.45,
								},
							},
							["amount"] = 3.45,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 5.71,
								},
							},
							["amount"] = 5.71,
						},
						["Firstsight"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 20.39,
								},
							},
							["amount"] = 20.39,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 0.1,
								},
								["Пытка разума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Слово Тьмы: Боль (УЗВ)"] = {
									["count"] = 0,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Прикосновение вампира (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0.11,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
						["Правосудие мудрости"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 1001,
								},
							},
							["amount"] = 1001,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 55,
					["DOT_Time"] = 153,
					["ElementTaken"] = {
						["Nature"] = 23188,
						["Physical"] = 0,
					},
					["HOTs"] = {
						["Объятия вампира"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 261,
								},
								["Phelorna"] = {
									["count"] = 261,
								},
								["Lilladra"] = {
									["count"] = 261,
								},
								["Firstsight"] = {
									["count"] = 261,
								},
								["Covardy"] = {
									["count"] = 261,
								},
							},
							["amount"] = 1305,
						},
					},
					["Damage"] = 182792,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 39,
								},
								["Crit"] = {
									["count"] = 24,
								},
								["Hit"] = {
									["count"] = 39,
								},
							},
							["amount"] = 102,
						},
					},
					["TimeHeal"] = 49.17999999999999,
					["HealedWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7500,
								},
							},
							["amount"] = 7500,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13881,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 662,
								},
								["Всепожирающая чума"] = {
									["count"] = 921,
								},
							},
							["amount"] = 15464,
						},
						["Lilladra"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7529,
								},
							},
							["amount"] = 7529,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 5055,
								},
							},
							["amount"] = 5055,
						},
						["Covardy"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3985,
								},
							},
							["amount"] = 3985,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 182792,
					},
					["Overhealing"] = 45475,
					["Healing"] = 39533,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 5.71,
								},
							},
							["amount"] = 5.71,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 0.1,
								},
								["Пытка разума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Слово Тьмы: Боль (УЗВ)"] = {
									["count"] = 0,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Прикосновение вампира (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0.11,
						},
					},
					["Heals"] = {
						["Объятия вампира"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1029,
									["min"] = 28,
									["count"] = 270,
									["amount"] = 37950,
								},
							},
							["count"] = 270,
							["amount"] = 37950,
						},
						["Беспощадная всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 339,
									["min"] = 323,
									["count"] = 2,
									["amount"] = 662,
								},
							},
							["count"] = 2,
							["amount"] = 662,
						},
						["Всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 346,
									["min"] = 34,
									["count"] = 6,
									["amount"] = 921,
								},
							},
							["count"] = 6,
							["amount"] = 921,
						},
					},
					["Attacks"] = {
						["Иссушение разума"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2176,
									["min"] = 2176,
									["count"] = 1,
									["amount"] = 2176,
								},
								["Hit"] = {
									["max"] = 1596,
									["min"] = 1354,
									["count"] = 14,
									["amount"] = 21174,
								},
							},
							["count"] = 15,
							["amount"] = 23350,
						},
						["Пытка разума"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3757,
									["min"] = 2781,
									["count"] = 11,
									["amount"] = 35869,
								},
								["Hit"] = {
									["max"] = 1874,
									["min"] = 1330,
									["count"] = 21,
									["amount"] = 32516,
								},
							},
							["count"] = 32,
							["amount"] = 68385,
						},
						["Всепожирающая чума (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2260,
									["min"] = 2078,
									["count"] = 3,
									["amount"] = 6597,
								},
								["Tick"] = {
									["max"] = 1127,
									["min"] = 994,
									["count"] = 18,
									["amount"] = 19075,
								},
							},
							["count"] = 21,
							["amount"] = 25672,
						},
						["Слово Тьмы: Боль (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2388,
									["min"] = 2171,
									["count"] = 4,
									["amount"] = 9081,
								},
								["Tick"] = {
									["max"] = 1184,
									["min"] = 985,
									["count"] = 11,
									["amount"] = 12430,
								},
							},
							["count"] = 15,
							["amount"] = 21511,
						},
						["Беспощадная всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2705,
									["min"] = 2386,
									["count"] = 4,
									["amount"] = 10281,
								},
							},
							["count"] = 4,
							["amount"] = 10281,
						},
						["Прикосновение вампира (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3519,
									["min"] = 3309,
									["count"] = 5,
									["amount"] = 17175,
								},
								["Tick"] = {
									["max"] = 1767,
									["min"] = 1583,
									["count"] = 10,
									["amount"] = 16418,
								},
							},
							["count"] = 15,
							["amount"] = 33593,
						},
					},
					["HealingTaken"] = 25273,
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 20511,
								},
							},
							["amount"] = 20511,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 2839,
								},
								["Пытка разума"] = {
									["count"] = 68385,
								},
								["Всепожирающая чума (УЗВ)"] = {
									["count"] = 25672,
								},
								["Слово Тьмы: Боль (УЗВ)"] = {
									["count"] = 21511,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 10281,
								},
								["Прикосновение вампира (УЗВ)"] = {
									["count"] = 33593,
								},
							},
							["amount"] = 162281,
						},
					},
					["TimeDamage"] = 5.819999999999999,
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 15219,
								},
							},
							["amount"] = 15219,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 7969,
								},
							},
							["amount"] = 7969,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 1001,
					["HOT_Time"] = 1305,
					["DamageTaken"] = 23188,
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["Firstsight"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 20.39,
								},
							},
							["amount"] = 20.39,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.979999999999999,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3.979999999999999,
						},
						["Lilladra"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 13.27,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 8.09,
								},
							},
							["amount"] = 8.09,
						},
						["Covardy"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.45,
								},
							},
							["amount"] = 3.45,
						},
					},
					["OverHeals"] = {
						["Объятия вампира"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1047,
									["min"] = 16,
									["count"] = 169,
									["amount"] = 41356,
								},
							},
							["count"] = 169,
							["amount"] = 41356,
						},
						["Беспощадная всепожирающая чума"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 489,
									["min"] = 489,
									["count"] = 1,
									["amount"] = 489,
								},
								["Hit"] = {
									["max"] = 326,
									["min"] = 326,
									["count"] = 1,
									["amount"] = 326,
								},
							},
							["count"] = 2,
							["amount"] = 815,
						},
						["Всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 342,
									["min"] = 165,
									["count"] = 17,
									["amount"] = 3304,
								},
							},
							["count"] = 17,
							["amount"] = 3304,
						},
					},
					["ManaGainedFrom"] = {
						["Firstsight"] = {
							["Details"] = {
								["Правосудие мудрости"] = {
									["count"] = 1001,
								},
							},
							["amount"] = 1001,
						},
					},
					["DOTs"] = {
						["Прикосновение вампира (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
						["Всепожирающая чума (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 63,
								},
							},
							["amount"] = 63,
						},
						["Слово Тьмы: Боль (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoHealed"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 2161,
								},
								["Малая волна исцеления"] = {
									["count"] = 3081,
								},
								["Цепное исцеление"] = {
									["count"] = 4567,
								},
							},
							["amount"] = 9809,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13881,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 662,
								},
								["Всепожирающая чума"] = {
									["count"] = 921,
								},
							},
							["amount"] = 15464,
						},
					},
					["TimeSpent"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 8.09,
								},
							},
							["amount"] = 8.09,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.979999999999999,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3.979999999999999,
						},
						["Lilladra"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13.27,
								},
							},
							["amount"] = 13.27,
						},
						["Covardy"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3.45,
								},
							},
							["amount"] = 3.45,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 5.71,
								},
							},
							["amount"] = 5.71,
						},
						["Firstsight"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 20.39,
								},
							},
							["amount"] = 20.39,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 0.1,
								},
								["Пытка разума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Слово Тьмы: Боль (УЗВ)"] = {
									["count"] = 0,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Прикосновение вампира (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0.11,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
						["Правосудие мудрости"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 1001,
								},
							},
							["amount"] = 1001,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 55,
					["DOT_Time"] = 153,
					["ElementTaken"] = {
						["Nature"] = 23188,
						["Physical"] = 2545,
					},
					["HOTs"] = {
						["Объятия вампира"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 261,
								},
								["Phelorna"] = {
									["count"] = 261,
								},
								["Lilladra"] = {
									["count"] = 261,
								},
								["Firstsight"] = {
									["count"] = 261,
								},
								["Covardy"] = {
									["count"] = 261,
								},
							},
							["amount"] = 1305,
						},
					},
					["Damage"] = 182792,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 39,
								},
								["Crit"] = {
									["count"] = 24,
								},
								["Hit"] = {
									["count"] = 39,
								},
							},
							["amount"] = 102,
						},
					},
					["TimeHeal"] = 49.17999999999999,
					["HealedWho"] = {
						["Firstsight"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7500,
								},
							},
							["amount"] = 7500,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 13881,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 662,
								},
								["Всепожирающая чума"] = {
									["count"] = 921,
								},
							},
							["amount"] = 15464,
						},
						["Lilladra"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7529,
								},
							},
							["amount"] = 7529,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 5055,
								},
							},
							["amount"] = 5055,
						},
						["Covardy"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3985,
								},
							},
							["amount"] = 3985,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 182792,
					},
					["Overhealing"] = 45475,
					["Healing"] = 39533,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 5.71,
								},
							},
							["amount"] = 5.71,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 0.1,
								},
								["Пытка разума"] = {
									["count"] = 0,
								},
								["Всепожирающая чума (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Слово Тьмы: Боль (УЗВ)"] = {
									["count"] = 0,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 0,
								},
								["Прикосновение вампира (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0.11,
						},
					},
					["Heals"] = {
						["Объятия вампира"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1029,
									["min"] = 28,
									["count"] = 270,
									["amount"] = 37950,
								},
							},
							["count"] = 270,
							["amount"] = 37950,
						},
						["Беспощадная всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 339,
									["min"] = 323,
									["count"] = 2,
									["amount"] = 662,
								},
							},
							["count"] = 2,
							["amount"] = 662,
						},
						["Всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 346,
									["min"] = 34,
									["count"] = 6,
									["amount"] = 921,
								},
							},
							["count"] = 6,
							["amount"] = 921,
						},
					},
					["Attacks"] = {
						["Иссушение разума"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2176,
									["min"] = 2176,
									["count"] = 1,
									["amount"] = 2176,
								},
								["Hit"] = {
									["max"] = 1596,
									["min"] = 1354,
									["count"] = 14,
									["amount"] = 21174,
								},
							},
							["count"] = 15,
							["amount"] = 23350,
						},
						["Пытка разума"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3757,
									["min"] = 2781,
									["count"] = 11,
									["amount"] = 35869,
								},
								["Hit"] = {
									["max"] = 1874,
									["min"] = 1330,
									["count"] = 21,
									["amount"] = 32516,
								},
							},
							["count"] = 32,
							["amount"] = 68385,
						},
						["Всепожирающая чума (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2260,
									["min"] = 2078,
									["count"] = 3,
									["amount"] = 6597,
								},
								["Tick"] = {
									["max"] = 1127,
									["min"] = 994,
									["count"] = 18,
									["amount"] = 19075,
								},
							},
							["count"] = 21,
							["amount"] = 25672,
						},
						["Слово Тьмы: Боль (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2388,
									["min"] = 2171,
									["count"] = 4,
									["amount"] = 9081,
								},
								["Tick"] = {
									["max"] = 1184,
									["min"] = 985,
									["count"] = 11,
									["amount"] = 12430,
								},
							},
							["count"] = 15,
							["amount"] = 21511,
						},
						["Беспощадная всепожирающая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2705,
									["min"] = 2386,
									["count"] = 4,
									["amount"] = 10281,
								},
							},
							["count"] = 4,
							["amount"] = 10281,
						},
						["Прикосновение вампира (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3519,
									["min"] = 3309,
									["count"] = 5,
									["amount"] = 17175,
								},
								["Tick"] = {
									["max"] = 1767,
									["min"] = 1583,
									["count"] = 10,
									["amount"] = 16418,
								},
							},
							["count"] = 15,
							["amount"] = 33593,
						},
					},
					["HealingTaken"] = 25273,
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 20511,
								},
							},
							["amount"] = 20511,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Иссушение разума"] = {
									["count"] = 2839,
								},
								["Пытка разума"] = {
									["count"] = 68385,
								},
								["Всепожирающая чума (УЗВ)"] = {
									["count"] = 25672,
								},
								["Слово Тьмы: Боль (УЗВ)"] = {
									["count"] = 21511,
								},
								["Беспощадная всепожирающая чума"] = {
									["count"] = 10281,
								},
								["Прикосновение вампира (УЗВ)"] = {
									["count"] = 33593,
								},
							},
							["amount"] = 162281,
						},
					},
					["TimeDamage"] = 5.819999999999999,
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 15219,
								},
							},
							["amount"] = 15219,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 7969,
								},
							},
							["amount"] = 7969,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2545,
								},
							},
							["amount"] = 2545,
						},
					},
					["ManaGain"] = 1001,
					["HOT_Time"] = 1305,
					["DamageTaken"] = 25733,
				},
			},
			["UnitLockout"] = 1680862005,
			["LastActive"] = 1680862118,
		},
		["Covardy"] = {
			["GUID"] = "0x07000000008A450A",
			["LastEventHealth"] = {
				"20495 (93%)", -- [1]
				"20495 (93%)", -- [2]
				"20574 (93%)", -- [3]
				"20574 (93%)", -- [4]
				"18377 (83%)", -- [5]
				"18377 (83%)", -- [6]
				"18543 (84%)", -- [7]
				"18543 (84%)", -- [8]
				"18543 (84%)", -- [9]
				"18543 (84%)", -- [10]
				"18543 (84%)", -- [11]
				"18543 (84%)", -- [12]
				"18543 (84%)", -- [13]
				"18543 (84%)", -- [14]
				"18543 (84%)", -- [15]
				"18543 (84%)", -- [16]
				"18543 (84%)", -- [17]
				"18543 (84%)", -- [18]
				"18543 (84%)", -- [19]
				"16346 (74%)", -- [20]
				"16346 (74%)", -- [21]
				"16346 (74%)", -- [22]
				"16346 (74%)", -- [23]
				"16346 (74%)", -- [24]
				"16346 (74%)", -- [25]
				"16346 (74%)", -- [26]
				"16346 (74%)", -- [27]
				"16346 (74%)", -- [28]
				"16346 (74%)", -- [29]
				"16346 (74%)", -- [30]
				"16346 (74%)", -- [31]
				"16346 (74%)", -- [32]
				"16346 (74%)", -- [33]
				"16346 (74%)", -- [34]
				"16346 (74%)", -- [35]
				"14149 (64%)", -- [36]
				"14149 (64%)", -- [37]
				"14149 (64%)", -- [38]
				"14149 (64%)", -- [39]
				"14149 (64%)", -- [40]
				"14149 (64%)", -- [41]
				"14149 (64%)", -- [42]
				"14149 (64%)", -- [43]
				"14149 (64%)", -- [44]
				"14149 (64%)", -- [45]
				"19413 (88%)", -- [46]
				"19413 (88%)", -- [47]
				"19413 (88%)", -- [48]
				"20329 (92%)", -- [49]
				"20495 (93%)", -- [50]
			},
			["LastAttackedBy"] = "Порожденный чумой ужас",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					300, -- [1]
				},
				["HealingTaken"] = {
					17894, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					86.5, -- [1]
				},
				["DamageTaken"] = {
					25715, -- [1]
				},
				["TimeDamage"] = {
					86.5, -- [1]
				},
				["DOT_Time"] = {
					126, -- [1]
				},
				["Damage"] = {
					214384, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "Covardy",
			["level"] = 80,
			["LastDamageAbility"] = "Токсичный выброс (УЗВ)",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				[49] = 4.169321802457898,
				[36] = 10,
				[3] = 0.3595812471552117,
				[50] = 0.755575785161584,
				[7] = 0.755575785161584,
				[20] = 10,
				[5] = 10,
			},
			["type"] = "Grouped",
			["LastDamageTaken"] = 2197,
			["TimeLast"] = {
				["Dispelled"] = 1680862101,
				["OVERALL"] = 1680862156,
				["DamageTaken"] = 1680862151,
				["EnergyGain"] = 1680862128,
				["HealingTaken"] = 1680862118,
				["TimeDamage"] = 1680862156,
				["ActiveTime"] = 1680862156,
				["DOT_Time"] = 1680862151,
				["Damage"] = 1680862156,
			},
			["Owner"] = false,
			["LastAbility"] = 1794809.543,
			["NextEventNum"] = 46,
			["LastEventHealthNum"] = {
				93.28629949931725, -- [1]
				93.28629949931725, -- [2]
				93.64588074647246, -- [3]
				93.64588074647246, -- [4]
				83.64588074647246, -- [5]
				83.64588074647246, -- [6]
				84.40145653163404, -- [7]
				84.40145653163404, -- [8]
				84.40145653163404, -- [9]
				84.40145653163404, -- [10]
				84.40145653163404, -- [11]
				84.40145653163404, -- [12]
				84.40145653163404, -- [13]
				84.40145653163404, -- [14]
				84.40145653163404, -- [15]
				84.40145653163404, -- [16]
				84.40145653163404, -- [17]
				84.40145653163404, -- [18]
				84.40145653163404, -- [19]
				74.40145653163404, -- [20]
				74.40145653163404, -- [21]
				74.40145653163404, -- [22]
				74.40145653163404, -- [23]
				74.40145653163404, -- [24]
				74.40145653163404, -- [25]
				74.40145653163404, -- [26]
				74.40145653163404, -- [27]
				74.40145653163404, -- [28]
				74.40145653163404, -- [29]
				74.40145653163404, -- [30]
				74.40145653163404, -- [31]
				74.40145653163404, -- [32]
				74.40145653163404, -- [33]
				74.40145653163404, -- [34]
				74.40145653163404, -- [35]
				64.40145653163404, -- [36]
				64.40145653163404, -- [37]
				64.40145653163404, -- [38]
				64.40145653163404, -- [39]
				64.40145653163404, -- [40]
				64.40145653163404, -- [41]
				64.40145653163404, -- [42]
				64.40145653163404, -- [43]
				64.40145653163404, -- [44]
				64.40145653163404, -- [45]
				88.36140191169777, -- [46]
				88.36140191169777, -- [47]
				88.36140191169777, -- [48]
				92.53072371415567, -- [49]
				93.28629949931725, -- [50]
			},
			["LastEvents"] = {
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -738 (Physical)", -- [1]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -1029 (Physical)", -- [2]
				"Phelorna Объятия вампира Covardy Tick +79", -- [3]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -1284 (Physical)", -- [4]
				"Порожденный чумой ужас Токсичный выброс (УЗВ) Covardy Tick -2197 (Nature)", -- [5]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -334 (Physical)", -- [6]
				"Phelorna Объятия вампира Covardy Tick +166", -- [7]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -774 (Nature)", -- [8]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -579 (Physical)", -- [9]
				"Covardy Коварный удар Порожденный чумой ужас Hit -924 (Physical)", -- [10]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -852 (Physical)", -- [11]
				"Covardy Смертельный яд IX (УЗВ) Порожденный чумой ужас Tick -719 (Nature)", -- [12]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -823 (Nature)", -- [13]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -534 (Physical)", -- [14]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -792 (Physical)", -- [15]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -330 (Physical)", -- [16]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -757 (Nature)", -- [17]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -543 (Physical)", -- [18]
				"Covardy Коварный удар Порожденный чумой ужас Hit -924 (Physical)", -- [19]
				"Порожденный чумой ужас Токсичный выброс (УЗВ) Covardy Tick -2197 (Nature)", -- [20]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -319 (Physical)", -- [21]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -601 (Physical)", -- [22]
				"Covardy Смертельный яд IX (УЗВ) Порожденный чумой ужас Tick -767 (Nature)", -- [23]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -325 (Physical)", -- [24]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -737 (Nature)", -- [25]
				"Covardy Коварный удар Порожденный чумой ужас Hit -1035 (Physical)", -- [26]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -1476 (Physical)", -- [27]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -370 (Physical)", -- [28]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -816 (Physical)", -- [29]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -715 (Nature)", -- [30]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -602 (Physical)", -- [31]
				"Covardy Потрошение Порожденный чумой ужас Hit -1969 (Physical)", -- [32]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -366 (Physical)", -- [33]
				"Covardy Смертельный яд IX (УЗВ) Порожденный чумой ужас Tick -959 (Nature)", -- [34]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -613 (Physical)", -- [35]
				"Порожденный чумой ужас Токсичный выброс (УЗВ) Covardy Tick -2197 (Nature)", -- [36]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Crit -1341 (Nature)", -- [37]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -315 (Physical)", -- [38]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -722 (Nature)", -- [39]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -518 (Physical)", -- [40]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -743 (Nature)", -- [41]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -686 (Physical)", -- [42]
				"Covardy Быстродействующий яд IX Порожденный чумой ужас Hit -748 (Nature)", -- [43]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -528 (Physical)", -- [44]
				"Covardy Атака ближнего боя Порожденный чумой ужас Hit -290 (Physical)", -- [45]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -861 (Physical)", -- [46]
				"Covardy Смертельный яд IX (УЗВ) Порожденный чумой ужас Tick -479 (Nature)", -- [47]
				"Covardy Атака ближнего боя Порожденный чумой ужас Crit -885 (Physical)", -- [48]
				"Smellmywind Быстрина Covardy Tick +916", -- [49]
				"Phelorna Объятия вампира Covardy Tick +166", -- [50]
			},
			["Name"] = "Covardy",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				1794770.611, -- [1]
				1794771.118, -- [2]
				1794771.136, -- [3]
				1794771.283, -- [4]
				1794771.3, -- [5]
				1794772.168, -- [6]
				1794772.251, -- [7]
				1794772.424, -- [8]
				1794772.424, -- [9]
				1794772.455, -- [10]
				1794772.816, -- [11]
				1794772.89, -- [12]
				1794773.888, -- [13]
				1794773.888, -- [14]
				1794773.889, -- [15]
				1794774.506, -- [16]
				1794774.778, -- [17]
				1794774.779, -- [18]
				1794775.097, -- [19]
				1794775.312, -- [20]
				1794775.357, -- [21]
				1794775.852, -- [22]
				1794775.951, -- [23]
				1794776.206, -- [24]
				1794776.581, -- [25]
				1794776.581, -- [26]
				1794776.917, -- [27]
				1794782.263, -- [28]
				1794782.617, -- [29]
				1794783.983, -- [30]
				1794783.984, -- [31]
				1794783.984, -- [32]
				1794787.163, -- [33]
				1794804.471, -- [34]
				1794804.471, -- [35]
				1794804.489, -- [36]
				1794807.425, -- [37]
				1794807.426, -- [38]
				1794807.866, -- [39]
				1794807.963, -- [40]
				1794807.964, -- [41]
				1794807.964, -- [42]
				1794809.542, -- [43]
				1794809.542, -- [44]
				1794809.543, -- [45]
				1794769.411, -- [46]
				1794770.005, -- [47]
				1794770.086, -- [48]
				1794770.165, -- [49]
				1794770.247, -- [50]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 40,
					},
					["DOTs"] = {
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 9,
								},
								["Горгулья с каменным хребтом"] = {
									["count"] = 21,
								},
							},
							["amount"] = 30,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Горгулья с каменным хребтом"] = {
									["count"] = 51,
								},
								["Порожденный чумой ужас"] = {
									["count"] = 45,
								},
							},
							["amount"] = 96,
						},
					},
					["TimeSpent"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12.73,
								},
								["Череда убийств"] = {
									["count"] = 0.02,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 10.39,
								},
								["Коварный удар"] = {
									["count"] = 1.84,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 1.7,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.34,
								},
								["Потрошение"] = {
									["count"] = 0.46,
								},
							},
							["amount"] = 27.48,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 31.83,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 4.95,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 17.14,
								},
								["Коварный удар"] = {
									["count"] = 5.090000000000001,
								},
								["Череда убийств"] = {
									["count"] = 0,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Потрошение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 59.02000000000002,
						},
					},
					["DamageTaken"] = 25715,
					["EnergyGain"] = 300,
					["PartialAbsorb"] = {
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 86.5,
					["ElementTaken"] = {
						["Nature"] = 25715,
					},
					["DOT_Time"] = 126,
					["Damage"] = 214384,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["EnergyGained"] = {
						["Боевой потенциал"] = {
							["Details"] = {
								["Covardy"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
					},
					["WhoHealed"] = {
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3985,
								},
							},
							["amount"] = 3985,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 1420,
								},
								["Малая волна исцеления"] = {
									["count"] = 4747,
								},
								["Быстрина"] = {
									["count"] = 7742,
								},
							},
							["amount"] = 13909,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 17576,
								},
								["Пустулезная плоть"] = {
									["count"] = 8139,
								},
							},
							["amount"] = 25715,
						},
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 9,
						},
					},
					["PartialResist"] = {
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Physical"] = 66876,
						["Melee"] = 86073,
						["Nature"] = 61435,
					},
					["HealingTaken"] = 17894,
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 39199,
								},
								["Череда убийств"] = {
									["count"] = 1828,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 16469,
								},
								["Коварный удар"] = {
									["count"] = 24060,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 8473,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 3546,
								},
								["Потрошение"] = {
									["count"] = 4906,
								},
							},
							["amount"] = 98481,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 46874,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 12317,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 24176,
								},
								["Коварный удар"] = {
									["count"] = 21992,
								},
								["Череда убийств"] = {
									["count"] = 3499,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 1383,
								},
								["Потрошение"] = {
									["count"] = 5662,
								},
							},
							["amount"] = 115903,
						},
					},
					["TimeDamage"] = 86.5,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12.73,
								},
								["Череда убийств"] = {
									["count"] = 0.02,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 10.39,
								},
								["Коварный удар"] = {
									["count"] = 1.84,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 1.7,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.34,
								},
								["Потрошение"] = {
									["count"] = 0.46,
								},
							},
							["amount"] = 27.48,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 31.83,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 4.95,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 17.14,
								},
								["Коварный удар"] = {
									["count"] = 5.090000000000001,
								},
								["Череда убийств"] = {
									["count"] = 0,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Потрошение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 59.02000000000002,
						},
					},
					["EnergyGainedFrom"] = {
						["Covardy"] = {
							["Details"] = {
								["Боевой потенциал"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 8,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 296,
									["min"] = 296,
									["count"] = 1,
									["amount"] = 296,
								},
								["Crit"] = {
									["max"] = 1562,
									["min"] = 584,
									["count"] = 47,
									["amount"] = 45926,
								},
								["Hit"] = {
									["max"] = 738,
									["min"] = 249,
									["count"] = 99,
									["amount"] = 39851,
								},
							},
							["count"] = 155,
							["amount"] = 86073,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1198,
									["min"] = 192,
									["count"] = 32,
									["amount"] = 20790,
								},
							},
							["count"] = 32,
							["amount"] = 20790,
						},
						["Быстродействующий яд IX"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1676,
									["min"] = 1070,
									["count"] = 8,
									["amount"] = 10834,
								},
								["Hit"] = {
									["max"] = 968,
									["min"] = 715,
									["count"] = 38,
									["amount"] = 29811,
								},
							},
							["count"] = 46,
							["amount"] = 40645,
						},
						["Коварный удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2951,
									["min"] = 1683,
									["count"] = 12,
									["amount"] = 28048,
								},
								["Hit"] = {
									["max"] = 1035,
									["min"] = 755,
									["count"] = 21,
									["amount"] = 18004,
								},
							},
							["count"] = 33,
							["amount"] = 46052,
						},
						["Череда убийств"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 748,
									["min"] = 748,
									["count"] = 1,
									["amount"] = 748,
								},
								["Hit"] = {
									["max"] = 759,
									["min"] = 345,
									["count"] = 9,
									["amount"] = 4579,
								},
							},
							["count"] = 10,
							["amount"] = 5327,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1013,
									["min"] = 1013,
									["count"] = 1,
									["amount"] = 1013,
								},
								["Tick"] = {
									["max"] = 461,
									["min"] = 422,
									["count"] = 9,
									["amount"] = 3916,
								},
							},
							["count"] = 10,
							["amount"] = 4929,
						},
						["Потрошение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3693,
									["min"] = 3693,
									["count"] = 1,
									["amount"] = 3693,
								},
								["Hit"] = {
									["max"] = 2463,
									["min"] = 1969,
									["count"] = 3,
									["amount"] = 6875,
								},
							},
							["count"] = 4,
							["amount"] = 10568,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 15,
								},
								["Hit"] = {
									["count"] = 33,
								},
							},
							["amount"] = 57,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 47,
								},
								["Hit"] = {
									["count"] = 100,
								},
							},
							["amount"] = 155,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 32,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 38,
								},
							},
							["amount"] = 78,
						},
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 40,
					},
					["DOTs"] = {
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 9,
								},
								["Горгулья с каменным хребтом"] = {
									["count"] = 21,
								},
							},
							["amount"] = 30,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Горгулья с каменным хребтом"] = {
									["count"] = 51,
								},
								["Порожденный чумой ужас"] = {
									["count"] = 45,
								},
							},
							["amount"] = 96,
						},
					},
					["TimeSpent"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12.73,
								},
								["Череда убийств"] = {
									["count"] = 0.02,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 10.39,
								},
								["Коварный удар"] = {
									["count"] = 1.84,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 1.7,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.34,
								},
								["Потрошение"] = {
									["count"] = 0.46,
								},
							},
							["amount"] = 27.48,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 31.83,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 4.95,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 17.14,
								},
								["Коварный удар"] = {
									["count"] = 5.090000000000001,
								},
								["Череда убийств"] = {
									["count"] = 0,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Потрошение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 59.02000000000002,
						},
					},
					["DamageTaken"] = 25715,
					["EnergyGain"] = 300,
					["PartialAbsorb"] = {
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 86.5,
					["ElementTaken"] = {
						["Nature"] = 25715,
					},
					["DOT_Time"] = 126,
					["Damage"] = 214384,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["EnergyGained"] = {
						["Боевой потенциал"] = {
							["Details"] = {
								["Covardy"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
					},
					["WhoHealed"] = {
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 3985,
								},
							},
							["amount"] = 3985,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 1420,
								},
								["Малая волна исцеления"] = {
									["count"] = 4747,
								},
								["Быстрина"] = {
									["count"] = 7742,
								},
							},
							["amount"] = 13909,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 17576,
								},
								["Пустулезная плоть"] = {
									["count"] = 8139,
								},
							},
							["amount"] = 25715,
						},
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 9,
						},
					},
					["PartialResist"] = {
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Physical"] = 66876,
						["Melee"] = 86073,
						["Nature"] = 61435,
					},
					["HealingTaken"] = 17894,
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 39199,
								},
								["Череда убийств"] = {
									["count"] = 1828,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 16469,
								},
								["Коварный удар"] = {
									["count"] = 24060,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 8473,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 3546,
								},
								["Потрошение"] = {
									["count"] = 4906,
								},
							},
							["amount"] = 98481,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 46874,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 12317,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 24176,
								},
								["Коварный удар"] = {
									["count"] = 21992,
								},
								["Череда убийств"] = {
									["count"] = 3499,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 1383,
								},
								["Потрошение"] = {
									["count"] = 5662,
								},
							},
							["amount"] = 115903,
						},
					},
					["TimeDamage"] = 86.5,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12.73,
								},
								["Череда убийств"] = {
									["count"] = 0.02,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 10.39,
								},
								["Коварный удар"] = {
									["count"] = 1.84,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 1.7,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.34,
								},
								["Потрошение"] = {
									["count"] = 0.46,
								},
							},
							["amount"] = 27.48,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 31.83,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 4.95,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 17.14,
								},
								["Коварный удар"] = {
									["count"] = 5.090000000000001,
								},
								["Череда убийств"] = {
									["count"] = 0,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 0.01,
								},
								["Потрошение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 59.02000000000002,
						},
					},
					["EnergyGainedFrom"] = {
						["Covardy"] = {
							["Details"] = {
								["Боевой потенциал"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 8,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 296,
									["min"] = 296,
									["count"] = 1,
									["amount"] = 296,
								},
								["Crit"] = {
									["max"] = 1562,
									["min"] = 584,
									["count"] = 47,
									["amount"] = 45926,
								},
								["Hit"] = {
									["max"] = 738,
									["min"] = 249,
									["count"] = 99,
									["amount"] = 39851,
								},
							},
							["count"] = 155,
							["amount"] = 86073,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1198,
									["min"] = 192,
									["count"] = 32,
									["amount"] = 20790,
								},
							},
							["count"] = 32,
							["amount"] = 20790,
						},
						["Быстродействующий яд IX"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1676,
									["min"] = 1070,
									["count"] = 8,
									["amount"] = 10834,
								},
								["Hit"] = {
									["max"] = 968,
									["min"] = 715,
									["count"] = 38,
									["amount"] = 29811,
								},
							},
							["count"] = 46,
							["amount"] = 40645,
						},
						["Коварный удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2951,
									["min"] = 1683,
									["count"] = 12,
									["amount"] = 28048,
								},
								["Hit"] = {
									["max"] = 1035,
									["min"] = 755,
									["count"] = 21,
									["amount"] = 18004,
								},
							},
							["count"] = 33,
							["amount"] = 46052,
						},
						["Череда убийств"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 748,
									["min"] = 748,
									["count"] = 1,
									["amount"] = 748,
								},
								["Hit"] = {
									["max"] = 759,
									["min"] = 345,
									["count"] = 9,
									["amount"] = 4579,
								},
							},
							["count"] = 10,
							["amount"] = 5327,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1013,
									["min"] = 1013,
									["count"] = 1,
									["amount"] = 1013,
								},
								["Tick"] = {
									["max"] = 461,
									["min"] = 422,
									["count"] = 9,
									["amount"] = 3916,
								},
							},
							["count"] = 10,
							["amount"] = 4929,
						},
						["Потрошение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3693,
									["min"] = 3693,
									["count"] = 1,
									["amount"] = 3693,
								},
								["Hit"] = {
									["max"] = 2463,
									["min"] = 1969,
									["count"] = 3,
									["amount"] = 6875,
								},
							},
							["count"] = 4,
							["amount"] = 10568,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 15,
								},
								["Hit"] = {
									["count"] = 33,
								},
							},
							["amount"] = 57,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 47,
								},
								["Hit"] = {
									["count"] = 100,
								},
							},
							["amount"] = 155,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 32,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 38,
								},
							},
							["amount"] = 78,
						},
					},
				},
			},
			["UnitLockout"] = 1680862037,
			["LastActive"] = 1680862156,
		},
		["Smellmywind"] = {
			["GUID"] = "0x07000000006BDB43",
			["LastEventHealth"] = {
				"14894 (73%)", -- [1]
				"15810 (77%)", -- [2]
				"15887 (77%)", -- [3]
				"15887 (77%)", -- [4]
				"15887 (77%)", -- [5]
				"15947 (78%)", -- [6]
				"16035 (78%)", -- [7]
				"16035 (78%)", -- [8]
				"16711 (81%)", -- [9]
				"16866 (82%)", -- [10]
				"16947 (83%)", -- [11]
				"17862 (87%)", -- [12]
				"17940 (87%)", -- [13]
				"17940 (87%)", -- [14]
				"17940 (87%)", -- [15]
				"18000 (88%)", -- [16]
				"18088 (88%)", -- [17]
				"18169 (89%)", -- [18]
				"18169 (89%)", -- [19]
				"20391 (100%)", -- [20]
				"20391 (100%)", -- [21]
				"20391 (100%)", -- [22]
				"20391 (100%)", -- [23]
				"20391 (100%)", -- [24]
				"20391 (100%)", -- [25]
				"20391 (100%)", -- [26]
				"20391 (100%)", -- [27]
				"20391 (100%)", -- [28]
				"20391 (100%)", -- [29]
				"20391 (100%)", -- [30]
				"20391 (100%)", -- [31]
				"20391 (100%)", -- [32]
				"20391 (100%)", -- [33]
				"20391 (100%)", -- [34]
				"20391 (100%)", -- [35]
				"20391 (100%)", -- [36]
				"20391 (100%)", -- [37]
				"20391 (100%)", -- [38]
				"20391 (100%)", -- [39]
				"20391 (100%)", -- [40]
				"20391 (100%)", -- [41]
				"20391 (100%)", -- [42]
				"20391 (100%)", -- [43]
				"20391 (100%)", -- [44]
				"20391 (100%)", -- [45]
				"20391 (100%)", -- [46]
				"20391 (100%)", -- [47]
				"20391 (100%)", -- [48]
				"20391 (100%)", -- [49]
				"20391 (100%)", -- [50]
			},
			["LastAttackedBy"] = "Порожденный чумой ужас",
			["LastEventType"] = {
				"HEAL", -- [1]
				"HEAL", -- [2]
				"HEAL", -- [3]
				"MISC", -- [4]
				"MISC", -- [5]
				"HEAL", -- [6]
				"HEAL", -- [7]
				"HEAL", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"HEAL", -- [12]
				"HEAL", -- [13]
				"HEAL", -- [14]
				"HEAL", -- [15]
				"HEAL", -- [16]
				"HEAL", -- [17]
				"HEAL", -- [18]
				"HEAL", -- [19]
				"HEAL", -- [20]
				"HEAL", -- [21]
				"HEAL", -- [22]
				"HEAL", -- [23]
				"HEAL", -- [24]
				"HEAL", -- [25]
				"HEAL", -- [26]
				"HEAL", -- [27]
				"HEAL", -- [28]
				"HEAL", -- [29]
				"HEAL", -- [30]
				"HEAL", -- [31]
				"MISC", -- [32]
				"HEAL", -- [33]
				"HEAL", -- [34]
				"HEAL", -- [35]
				"HEAL", -- [36]
				"HEAL", -- [37]
				"HEAL", -- [38]
				"HEAL", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"HEAL", -- [43]
				"HEAL", -- [44]
				"HEAL", -- [45]
				"HEAL", -- [46]
				"HEAL", -- [47]
				"HEAL", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					41.52999999999999, -- [1]
				},
				["Dispelled"] = {
					4, -- [1]
				},
				["Dispels"] = {
					7, -- [1]
				},
				["Healing"] = {
					186640, -- [1]
				},
				["DamageTaken"] = {
					44481, -- [1]
				},
				["HOT_Time"] = {
					183, -- [1]
				},
				["HealingTaken"] = {
					44048, -- [1]
				},
				["Overhealing"] = {
					60095, -- [1]
				},
				["ActiveTime"] = {
					70.08, -- [1]
				},
				["TimeDamage"] = {
					28.55, -- [1]
				},
				["ManaGain"] = {
					5807, -- [1]
				},
				["DOT_Time"] = {
					72, -- [1]
				},
				["Damage"] = {
					14277, -- [1]
				},
			},
			["enClass"] = "SHAMAN",
			["unit"] = "Smellmywind",
			["LastAbility"] = 1794774.262,
			["level"] = 80,
			["LastDamageAbility"] = "Пустулезная плоть",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
				0.3629052032759551, -- [1]
				4.492177921632092, -- [2]
				0.3629052032759551, -- [3]
				nil, -- [4]
				nil, -- [5]
				0.2942474621156392, -- [6]
				0.4315629444362709, -- [7]
				nil, -- [8]
				3.315188073169536, -- [9]
				0.7601392771320681, -- [10]
				0.382521700750331, -- [11]
				4.487273797263499, -- [12]
				0.382521700750331, -- [13]
				nil, -- [14]
				nil, -- [15]
				0.2942474621156392, -- [16]
				0.4315629444362709, -- [17]
				0.382521700750331, -- [18]
				nil, -- [19]
				33.9316365063018, -- [20]
				nil, -- [21]
				0.382521700750331, -- [22]
				4.487273797263499, -- [23]
				0.382521700750331, -- [24]
				0.2942474621156392, -- [25]
				0.4364670688048649, -- [26]
				0.804276396449414, -- [27]
				[30] = 3.315188073169536,
				[31] = 0.382521700750331,
				[33] = 0.804276396449414,
				[34] = 0.2942474621156392,
				[35] = 0.9023588838212937,
				[37] = 3.310283948800942,
				[38] = 0.809180520818008,
				[39] = 0.2991515864842332,
				[40] = 0.4315629444362709,
				[41] = 0.387425825118925,
				[43] = 0.367809327644549,
				[45] = 0.7650434015006621,
				[46] = 3.128831347162964,
				[47] = 0.3629052032759551,
				[48] = 0.7650434015006621,
				[49] = 3.310283948800942,
			},
			["type"] = "Grouped",
			["TimeLast"] = {
				["TimeHeal"] = 1680862120,
				["Dispelled"] = 1680862104,
				["Dispels"] = 1680862112,
				["OVERALL"] = 1680862120,
				["DamageTaken"] = 1680862101,
				["HOT_Time"] = 1680862120,
				["ActiveTime"] = 1680862120,
				["HealingTaken"] = 1680862109,
				["Overhealing"] = 1680862120,
				["TimeDamage"] = 1680862102,
				["Healing"] = 1680862120,
				["ManaGain"] = 1680862101,
				["DOT_Time"] = 1680862102,
				["Damage"] = 1680862102,
			},
			["GuardianReverseGUIDs"] = {
				["Mana Spring Totem VIII"] = {
					["LatestGuardian"] = 2,
					["GUIDs"] = {
						"0xF1300079D60001DF", -- [1]
						"0xF1300079D60001E7", -- [2]
						[0] = "0xF1300079D60001DA",
					},
				},
				["Тотем оков земли"] = {
					["LatestGuardian"] = 2,
					["GUIDs"] = {
						"0xF130000A460001E1", -- [1]
						"0xF130000A460001E2", -- [2]
						[0] = "0xF130000A460001DC",
					},
				},
				["Stoneskin Totem X"] = {
					["LatestGuardian"] = 2,
					["GUIDs"] = {
						"0xF1300079C80001DE", -- [1]
						"0xF1300079C80001E6", -- [2]
						[0] = "0xF1300079C80001D9",
					},
				},
				["Flametongue Totem VIII"] = {
					["LatestGuardian"] = 2,
					["GUIDs"] = {
						"0xF13000799D0001DD", -- [1]
						"0xF13000799D0001E5", -- [2]
						[0] = "0xF13000799D0001D8",
					},
				},
				["Тотем гнева воздуха"] = {
					["LatestGuardian"] = 2,
					["GUIDs"] = {
						"0xF130003C570001E0", -- [1]
						"0xF130003C570001E8", -- [2]
						[0] = "0xF130003C570001DB",
					},
				},
			},
			["LastDamageTaken"] = 6537,
			["Owner"] = false,
			["Pet"] = {
				"Flametongue Totem VIII <Smellmywind>", -- [1]
				"Stoneskin Totem X <Smellmywind>", -- [2]
				"Mana Spring Totem VIII <Smellmywind>", -- [3]
				"Тотем гнева воздуха <Smellmywind>", -- [4]
				"Тотем оков земли <Smellmywind>", -- [5]
			},
			["NextEventNum"] = 1,
			["LastEventHealthNum"] = {
				73.04202834583884, -- [1]
				77.53420626747095, -- [2]
				77.91182384385267, -- [3]
				77.91182384385267, -- [4]
				77.91182384385267, -- [5]
				78.20607130596832, -- [6]
				78.63763425040459, -- [7]
				78.63763425040459, -- [8]
				81.95282232357413, -- [9]
				82.71296160070619, -- [10]
				83.11019567456231, -- [11]
				87.5974694718258, -- [12]
				87.97999117257614, -- [13]
				87.97999117257614, -- [14]
				87.97999117257614, -- [15]
				88.27423863469177, -- [16]
				88.70580157912805, -- [17]
				89.10303565298416, -- [18]
				89.10303565298416, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				100, -- [31]
				100, -- [32]
				100, -- [33]
				100, -- [34]
				100, -- [35]
				100, -- [36]
				100, -- [37]
				100, -- [38]
				100, -- [39]
				100, -- [40]
				100, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Phelorna Объятия вампира Smellmywind Tick +74", -- [1]
				"Smellmywind Быстрина Smellmywind Tick +916", -- [2]
				"Phelorna Объятия вампира Smellmywind Tick +74", -- [3]
				"Smellmywind dispels Smellmywind Пустулезная плоть (Очищение духа)", -- [4]
				"Smellmywind dispels Smellmywind Пустулезная плоть (Очищение духа)", -- [5]
				"Phelorna Объятия вампира Smellmywind Tick +60", -- [6]
				"Phelorna Объятия вампира Smellmywind Tick +88", -- [7]
				"Smellmywind Быстрина Covardy Tick +916", -- [8]
				"Smellmywind Жизнь Земли Smellmywind Tick +676", -- [9]
				"Phelorna Объятия вампира Smellmywind Tick +155", -- [10]
				"Phelorna Объятия вампира Smellmywind Tick +78", -- [11]
				"Smellmywind Быстрина Smellmywind Tick +915", -- [12]
				"Phelorna Объятия вампира Smellmywind Tick +78", -- [13]
				"Smellmywind Щит земли Firstsight Hit +2747", -- [14]
				"Smellmywind Малая волна исцеления Covardy Hit +4747", -- [15]
				"Phelorna Объятия вампира Smellmywind Tick +60", -- [16]
				"Phelorna Объятия вампира Smellmywind Tick +88", -- [17]
				"Phelorna Объятия вампира Smellmywind Tick +78", -- [18]
				"Smellmywind Быстрина Covardy Tick +916", -- [19]
				"Smellmywind Малая волна исцеления Smellmywind Crit +6919 (4697 избыт. лечение)", -- [20]
				"Smellmywind Пробуждение древних Lilladra Hit +2287", -- [21]
				"Phelorna Объятия вампира Smellmywind Tick +78 (78 избыт. лечение)", -- [22]
				"Smellmywind Быстрина Smellmywind Tick +915 (915 избыт. лечение)", -- [23]
				"Phelorna Объятия вампира Smellmywind Tick +78 (78 избыт. лечение)", -- [24]
				"Phelorna Объятия вампира Smellmywind Tick +60 (60 избыт. лечение)", -- [25]
				"Phelorna Объятия вампира Smellmywind Tick +89 (89 избыт. лечение)", -- [26]
				"Phelorna Объятия вампира Smellmywind Tick +164 (164 избыт. лечение)", -- [27]
				"Smellmywind Быстрина Covardy Tick +915", -- [28]
				"Smellmywind Щит земли Firstsight Hit +2747", -- [29]
				"Smellmywind Жизнь Земли Smellmywind Tick +676 (676 избыт. лечение)", -- [30]
				"Phelorna Объятия вампира Smellmywind Tick +78 (78 избыт. лечение)", -- [31]
				"Smellmywind dispels Firstsight Пустулезная плоть (Очищение духа)", -- [32]
				"Phelorna Объятия вампира Smellmywind Tick +164 (164 избыт. лечение)", -- [33]
				"Phelorna Объятия вампира Smellmywind Tick +60 (60 избыт. лечение)", -- [34]
				"Phelorna Объятия вампира Smellmywind Tick +184 (184 избыт. лечение)", -- [35]
				"Smellmywind Быстрина Covardy Tick +915", -- [36]
				"Smellmywind Жизнь Земли Smellmywind Tick +675 (675 избыт. лечение)", -- [37]
				"Phelorna Объятия вампира Smellmywind Tick +165 (165 избыт. лечение)", -- [38]
				"Phelorna Объятия вампира Smellmywind Tick +61 (61 избыт. лечение)", -- [39]
				"Phelorna Объятия вампира Smellmywind Tick +88 (88 избыт. лечение)", -- [40]
				"Phelorna Объятия вампира Smellmywind Tick +79 (79 избыт. лечение)", -- [41]
				"Smellmywind Щит земли Firstsight Hit +2747", -- [42]
				"Phelorna Объятия вампира Smellmywind Tick +75 (75 избыт. лечение)", -- [43]
				"Smellmywind Быстрина Covardy Tick +916", -- [44]
				"Phelorna Объятия вампира Smellmywind Tick +156 (156 избыт. лечение)", -- [45]
				"Smellmywind Жизнь Земли Smellmywind Tick +638 (638 избыт. лечение)", -- [46]
				"Phelorna Объятия вампира Smellmywind Tick +74 (74 избыт. лечение)", -- [47]
				"Phelorna Объятия вампира Smellmywind Tick +156 (156 избыт. лечение)", -- [48]
				"Smellmywind Жизнь Земли Smellmywind Tick +675 (675 избыт. лечение)", -- [49]
				"Smellmywind Щит земли Firstsight Crit +5356", -- [50]
			},
			["Name"] = "Smellmywind",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				1794757.378, -- [1]
				1794757.383, -- [2]
				1794757.391, -- [3]
				1794757.397, -- [4]
				1794757.397, -- [5]
				1794758.928, -- [6]
				1794758.934, -- [7]
				1794758.936, -- [8]
				1794758.952, -- [9]
				1794758.955, -- [10]
				1794759.32, -- [11]
				1794759.398, -- [12]
				1794762.977, -- [13]
				1794762.978, -- [14]
				1794762.981, -- [15]
				1794762.982, -- [16]
				1794762.984, -- [17]
				1794762.987, -- [18]
				1794762.988, -- [19]
				1794762.99, -- [20]
				1794762.99, -- [21]
				1794762.995, -- [22]
				1794763.015, -- [23]
				1794763.033, -- [24]
				1794763.117, -- [25]
				1794763.26, -- [26]
				1794763.778, -- [27]
				1794764.111, -- [28]
				1794764.221, -- [29]
				1794764.436, -- [30]
				1794764.685, -- [31]
				1794765.357, -- [32]
				1794765.569, -- [33]
				1794765.645, -- [34]
				1794765.81, -- [35]
				1794767.126, -- [36]
				1794767.407, -- [37]
				1794767.49, -- [38]
				1794769.082, -- [39]
				1794769.087, -- [40]
				1794769.091, -- [41]
				1794769.098, -- [42]
				1794769.261, -- [43]
				1794770.165, -- [44]
				1794770.248, -- [45]
				1794770.611, -- [46]
				1794771.136, -- [47]
				1794772.254, -- [48]
				1794773.868, -- [49]
				1794774.262, -- [50]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
						["Огненный шок (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 72,
								},
							},
							["amount"] = 72,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
					},
					["HealedWho"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 2027,
								},
								["Пробуждение древних"] = {
									["count"] = 4327,
								},
								["Малая волна исцеления"] = {
									["count"] = 21323,
								},
								["Быстрина"] = {
									["count"] = 11316,
								},
							},
							["amount"] = 38993,
						},
						["Phelorna"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 2161,
								},
								["Малая волна исцеления"] = {
									["count"] = 3081,
								},
								["Цепное исцеление"] = {
									["count"] = 4567,
								},
							},
							["amount"] = 9809,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 7029,
								},
								["Цепное исцеление"] = {
									["count"] = 3913,
								},
								["Быстрина"] = {
									["count"] = 6048,
								},
							},
							["amount"] = 16990,
						},
						["Firstsight"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 3381,
								},
								["Щит земли"] = {
									["count"] = 47930,
								},
								["Жизнь Земли"] = {
									["count"] = 4590,
								},
								["Пробуждение древних"] = {
									["count"] = 8412,
								},
								["Малая волна исцеления"] = {
									["count"] = 21285,
								},
								["Быстрина"] = {
									["count"] = 21341,
								},
							},
							["amount"] = 106939,
						},
						["Covardy"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 1420,
								},
								["Малая волна исцеления"] = {
									["count"] = 4747,
								},
								["Быстрина"] = {
									["count"] = 7742,
								},
							},
							["amount"] = 13909,
						},
					},
					["ElementTakenResist"] = {
						["Nature"] = 4153,
					},
					["Overhealing"] = 60095,
					["ElementTaken"] = {
						["Physical"] = 0,
						["Melee"] = 5871,
						["Nature"] = 36333,
					},
					["DOT_Time"] = 72,
					["Damage"] = 14277,
					["TimeHeal"] = 41.52999999999999,
					["Dispels"] = 7,
					["ElementDone"] = {
						["Holy"] = 496,
						["Fire"] = 13781,
					},
					["DamagedWho"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Огненный шок"] = {
									["count"] = 3964,
								},
								["Огненный шок (УЗВ)"] = {
									["count"] = 9817,
								},
								["Аура воздаяния"] = {
									["count"] = 496,
								},
							},
							["amount"] = 14277,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5871,
								},
								["Пустулезная плоть"] = {
									["count"] = 27004,
								},
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 1428,
								},
							},
							["amount"] = 34303,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 7901,
								},
							},
							["amount"] = 7901,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeHealing"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 0.05,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 4.23,
								},
								["Быстрина"] = {
									["count"] = 4.97,
								},
							},
							["amount"] = 9.249999999999998,
						},
						["Phelorna"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0.49,
								},
							},
							["amount"] = 0.49,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 0.24,
						},
						["Firstsight"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Щит земли"] = {
									["count"] = 11.59,
								},
								["Жизнь Земли"] = {
									["count"] = 2.7,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 2.05,
								},
								["Быстрина"] = {
									["count"] = 8.559999999999999,
								},
							},
							["amount"] = 24.9,
						},
						["Covardy"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 6.65,
								},
							},
							["amount"] = 6.65,
						},
					},
					["OverHeals"] = {
						["Цепное исцеление"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1843,
									["min"] = 1843,
									["count"] = 1,
									["amount"] = 1843,
								},
							},
							["count"] = 1,
							["amount"] = 1843,
						},
						["Малая волна исцеления"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7956,
									["min"] = 1005,
									["count"] = 5,
									["amount"] = 22975,
								},
								["Hit"] = {
									["max"] = 1804,
									["min"] = 1804,
									["count"] = 1,
									["amount"] = 1804,
								},
							},
							["count"] = 6,
							["amount"] = 24779,
						},
						["Жизнь Земли"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 706,
									["min"] = 638,
									["count"] = 9,
									["amount"] = 6079,
								},
							},
							["count"] = 9,
							["amount"] = 6079,
						},
						["Пробуждение древних"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 658,
									["min"] = 658,
									["count"] = 1,
									["amount"] = 658,
								},
							},
							["count"] = 1,
							["amount"] = 658,
						},
						["Щит земли"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2722,
									["min"] = 90,
									["count"] = 3,
									["amount"] = 3850,
								},
							},
							["count"] = 3,
							["amount"] = 3850,
						},
						["Быстрина"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1097,
									["min"] = 1097,
									["count"] = 1,
									["amount"] = 1097,
								},
								["Crit"] = {
									["max"] = 4593,
									["min"] = 4593,
									["count"] = 1,
									["amount"] = 4593,
								},
								["Tick"] = {
									["max"] = 947,
									["min"] = 580,
									["count"] = 19,
									["amount"] = 17196,
								},
							},
							["count"] = 21,
							["amount"] = 22886,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 1239,
									["min"] = 700,
									["count"] = 3,
									["amount"] = 2665,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 2665,
						},
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["50%Сопротив."] = {
									["max"] = 611,
									["min"] = 611,
									["count"] = 1,
									["amount"] = 611,
								},
							},
							["count"] = 1,
							["amount"] = 611,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 877,
									["min"] = 877,
									["count"] = 1,
									["amount"] = 877,
								},
							},
							["count"] = 1,
							["amount"] = 877,
						},
					},
					["ManaGained"] = {
						["Водный щит"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 5412,
								},
							},
							["amount"] = 5412,
						},
						["Возвращение тотемов"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 395,
								},
							},
							["amount"] = 395,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 70.08,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["Dispelled"] = 4,
					["Heals"] = {
						["Цепное исцеление"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3381,
									["min"] = 3381,
									["count"] = 1,
									["amount"] = 3381,
								},
								["Hit"] = {
									["max"] = 4567,
									["min"] = 1420,
									["count"] = 3,
									["amount"] = 9900,
								},
							},
							["count"] = 4,
							["amount"] = 13281,
						},
						["Малая волна исцеления"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7860,
									["min"] = 543,
									["count"] = 8,
									["amount"] = 37251,
								},
								["Hit"] = {
									["max"] = 5357,
									["min"] = 3081,
									["count"] = 3,
									["amount"] = 13185,
								},
							},
							["count"] = 11,
							["amount"] = 50436,
						},
						["Жизнь Земли"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 676,
									["min"] = 643,
									["count"] = 10,
									["amount"] = 6617,
								},
							},
							["count"] = 10,
							["amount"] = 6617,
						},
						["Пробуждение древних"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2809,
									["min"] = 1510,
									["count"] = 10,
									["amount"] = 21929,
								},
							},
							["count"] = 10,
							["amount"] = 21929,
						},
						["Щит земли"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5356,
									["min"] = 5356,
									["count"] = 3,
									["amount"] = 16068,
								},
								["Hit"] = {
									["max"] = 2748,
									["min"] = 25,
									["count"] = 13,
									["amount"] = 31862,
								},
							},
							["count"] = 16,
							["amount"] = 47930,
						},
						["Быстрина"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 916,
									["min"] = 335,
									["count"] = 24,
									["amount"] = 20868,
								},
								["Crit"] = {
									["max"] = 4797,
									["min"] = 4797,
									["count"] = 1,
									["amount"] = 4797,
								},
								["Hit"] = {
									["max"] = 3230,
									["min"] = 2143,
									["count"] = 7,
									["amount"] = 20782,
								},
							},
							["count"] = 32,
							["amount"] = 46447,
						},
					},
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 18,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 28,
						},
					},
					["ManaGainedFrom"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Водный щит"] = {
									["count"] = 5412,
								},
								["Возвращение тотемов"] = {
									["count"] = 395,
								},
							},
							["amount"] = 5807,
						},
					},
					["HOTs"] = {
						["Жизнь Земли"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 24,
								},
								["Smellmywind"] = {
									["count"] = 33,
								},
							},
							["amount"] = 57,
						},
						["Быстрина"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 45,
								},
								["Covardy"] = {
									["count"] = 15,
								},
								["Firstsight"] = {
									["count"] = 51,
								},
								["Lilladra"] = {
									["count"] = 15,
								},
							},
							["amount"] = 126,
						},
					},
					["Healing"] = 186640,
					["HOT_Time"] = 183,
					["TimeSpent"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 0.05,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 4.23,
								},
								["Быстрина"] = {
									["count"] = 4.97,
								},
							},
							["amount"] = 9.249999999999998,
						},
						["Phelorna"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0.49,
								},
							},
							["amount"] = 0.49,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 0.24,
						},
						["Covardy"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 6.65,
								},
							},
							["amount"] = 6.65,
						},
						["Firstsight"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Щит земли"] = {
									["count"] = 11.59,
								},
								["Жизнь Земли"] = {
									["count"] = 2.7,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 2.05,
								},
								["Быстрина"] = {
									["count"] = 8.559999999999999,
								},
							},
							["amount"] = 24.9,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Огненный шок"] = {
									["count"] = 7.17,
								},
								["Огненный шок (УЗВ)"] = {
									["count"] = 20.73,
								},
								["Аура воздаяния"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 28.55,
						},
					},
					["Attacks"] = {
						["Огненный шок"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 999,
									["min"] = 967,
									["count"] = 4,
									["amount"] = 3964,
								},
							},
							["count"] = 4,
							["amount"] = 3964,
						},
						["Огненный шок (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 551,
									["min"] = 528,
									["count"] = 6,
									["amount"] = 3283,
								},
								["Tick"] = {
									["max"] = 368,
									["min"] = 352,
									["count"] = 18,
									["amount"] = 6534,
								},
							},
							["count"] = 24,
							["amount"] = 9817,
						},
						["Аура воздаяния"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 166,
									["min"] = 165,
									["count"] = 3,
									["amount"] = 496,
								},
							},
							["count"] = 3,
							["amount"] = 496,
						},
					},
					["HealingTaken"] = 44048,
					["DamageTaken"] = 42204,
					["TimeDamage"] = 28.55,
					["TimeDamaging"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Огненный шок"] = {
									["count"] = 7.17,
								},
								["Огненный шок (УЗВ)"] = {
									["count"] = 20.73,
								},
								["Аура воздаяния"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 28.55,
						},
					},
					["ManaGain"] = 5807,
					["WhoHealed"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 2027,
								},
								["Пробуждение древних"] = {
									["count"] = 4327,
								},
								["Малая волна исцеления"] = {
									["count"] = 21323,
								},
								["Быстрина"] = {
									["count"] = 11316,
								},
							},
							["amount"] = 38993,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 5055,
								},
							},
							["amount"] = 5055,
						},
					},
					["DispelledWho"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Firstsight"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Covardy"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["Огненный шок (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 72,
								},
							},
							["amount"] = 72,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
					},
					["HealedWho"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 2027,
								},
								["Пробуждение древних"] = {
									["count"] = 4327,
								},
								["Малая волна исцеления"] = {
									["count"] = 21323,
								},
								["Быстрина"] = {
									["count"] = 11316,
								},
							},
							["amount"] = 38993,
						},
						["Phelorna"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 2161,
								},
								["Малая волна исцеления"] = {
									["count"] = 3081,
								},
								["Цепное исцеление"] = {
									["count"] = 4567,
								},
							},
							["amount"] = 9809,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 7029,
								},
								["Цепное исцеление"] = {
									["count"] = 3913,
								},
								["Быстрина"] = {
									["count"] = 6048,
								},
							},
							["amount"] = 16990,
						},
						["Firstsight"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 3381,
								},
								["Щит земли"] = {
									["count"] = 47930,
								},
								["Жизнь Земли"] = {
									["count"] = 4590,
								},
								["Пробуждение древних"] = {
									["count"] = 8412,
								},
								["Малая волна исцеления"] = {
									["count"] = 21285,
								},
								["Быстрина"] = {
									["count"] = 21341,
								},
							},
							["amount"] = 106939,
						},
						["Covardy"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 1420,
								},
								["Малая волна исцеления"] = {
									["count"] = 4747,
								},
								["Быстрина"] = {
									["count"] = 7742,
								},
							},
							["amount"] = 13909,
						},
					},
					["ElementTakenResist"] = {
						["Nature"] = 4153,
					},
					["Overhealing"] = 60095,
					["ElementTaken"] = {
						["Physical"] = 2277,
						["Melee"] = 5871,
						["Nature"] = 36333,
					},
					["DOT_Time"] = 72,
					["Damage"] = 14277,
					["TimeHeal"] = 41.52999999999999,
					["Dispels"] = 7,
					["ElementDone"] = {
						["Holy"] = 496,
						["Fire"] = 13781,
					},
					["DamagedWho"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Огненный шок"] = {
									["count"] = 3964,
								},
								["Огненный шок (УЗВ)"] = {
									["count"] = 9817,
								},
								["Аура воздаяния"] = {
									["count"] = 496,
								},
							},
							["amount"] = 14277,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5871,
								},
								["Пустулезная плоть"] = {
									["count"] = 27004,
								},
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 1428,
								},
							},
							["amount"] = 34303,
						},
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 7901,
								},
							},
							["amount"] = 7901,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2277,
								},
							},
							["amount"] = 2277,
						},
					},
					["TimeHealing"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 0.05,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 4.23,
								},
								["Быстрина"] = {
									["count"] = 4.97,
								},
							},
							["amount"] = 9.249999999999998,
						},
						["Phelorna"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0.49,
								},
							},
							["amount"] = 0.49,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 0.24,
						},
						["Firstsight"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Щит земли"] = {
									["count"] = 11.59,
								},
								["Жизнь Земли"] = {
									["count"] = 2.7,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 2.05,
								},
								["Быстрина"] = {
									["count"] = 8.559999999999999,
								},
							},
							["amount"] = 24.9,
						},
						["Covardy"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 6.65,
								},
							},
							["amount"] = 6.65,
						},
					},
					["OverHeals"] = {
						["Цепное исцеление"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1843,
									["min"] = 1843,
									["count"] = 1,
									["amount"] = 1843,
								},
							},
							["count"] = 1,
							["amount"] = 1843,
						},
						["Малая волна исцеления"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7956,
									["min"] = 1005,
									["count"] = 5,
									["amount"] = 22975,
								},
								["Hit"] = {
									["max"] = 1804,
									["min"] = 1804,
									["count"] = 1,
									["amount"] = 1804,
								},
							},
							["count"] = 6,
							["amount"] = 24779,
						},
						["Жизнь Земли"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 706,
									["min"] = 638,
									["count"] = 9,
									["amount"] = 6079,
								},
							},
							["count"] = 9,
							["amount"] = 6079,
						},
						["Пробуждение древних"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 658,
									["min"] = 658,
									["count"] = 1,
									["amount"] = 658,
								},
							},
							["count"] = 1,
							["amount"] = 658,
						},
						["Щит земли"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2722,
									["min"] = 90,
									["count"] = 3,
									["amount"] = 3850,
								},
							},
							["count"] = 3,
							["amount"] = 3850,
						},
						["Быстрина"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1097,
									["min"] = 1097,
									["count"] = 1,
									["amount"] = 1097,
								},
								["Crit"] = {
									["max"] = 4593,
									["min"] = 4593,
									["count"] = 1,
									["amount"] = 4593,
								},
								["Tick"] = {
									["max"] = 947,
									["min"] = 580,
									["count"] = 19,
									["amount"] = 17196,
								},
							},
							["count"] = 21,
							["amount"] = 22886,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 1239,
									["min"] = 700,
									["count"] = 3,
									["amount"] = 2665,
								},
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 2665,
						},
						["Falling"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["50%Сопротив."] = {
									["max"] = 611,
									["min"] = 611,
									["count"] = 1,
									["amount"] = 611,
								},
							},
							["count"] = 1,
							["amount"] = 611,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["25%Сопротив."] = {
									["max"] = 877,
									["min"] = 877,
									["count"] = 1,
									["amount"] = 877,
								},
							},
							["count"] = 1,
							["amount"] = 877,
						},
					},
					["ManaGained"] = {
						["Водный щит"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 5412,
								},
							},
							["amount"] = 5412,
						},
						["Возвращение тотемов"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 395,
								},
							},
							["amount"] = 395,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 70.08,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["Dispelled"] = 4,
					["Heals"] = {
						["Цепное исцеление"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3381,
									["min"] = 3381,
									["count"] = 1,
									["amount"] = 3381,
								},
								["Hit"] = {
									["max"] = 4567,
									["min"] = 1420,
									["count"] = 3,
									["amount"] = 9900,
								},
							},
							["count"] = 4,
							["amount"] = 13281,
						},
						["Малая волна исцеления"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7860,
									["min"] = 543,
									["count"] = 8,
									["amount"] = 37251,
								},
								["Hit"] = {
									["max"] = 5357,
									["min"] = 3081,
									["count"] = 3,
									["amount"] = 13185,
								},
							},
							["count"] = 11,
							["amount"] = 50436,
						},
						["Жизнь Земли"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 676,
									["min"] = 643,
									["count"] = 10,
									["amount"] = 6617,
								},
							},
							["count"] = 10,
							["amount"] = 6617,
						},
						["Пробуждение древних"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2809,
									["min"] = 1510,
									["count"] = 10,
									["amount"] = 21929,
								},
							},
							["count"] = 10,
							["amount"] = 21929,
						},
						["Щит земли"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5356,
									["min"] = 5356,
									["count"] = 3,
									["amount"] = 16068,
								},
								["Hit"] = {
									["max"] = 2748,
									["min"] = 25,
									["count"] = 13,
									["amount"] = 31862,
								},
							},
							["count"] = 16,
							["amount"] = 47930,
						},
						["Быстрина"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 916,
									["min"] = 335,
									["count"] = 24,
									["amount"] = 20868,
								},
								["Crit"] = {
									["max"] = 4797,
									["min"] = 4797,
									["count"] = 1,
									["amount"] = 4797,
								},
								["Hit"] = {
									["max"] = 3230,
									["min"] = 2143,
									["count"] = 7,
									["amount"] = 20782,
								},
							},
							["count"] = 32,
							["amount"] = 46447,
						},
					},
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 18,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 28,
						},
					},
					["ManaGainedFrom"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Водный щит"] = {
									["count"] = 5412,
								},
								["Возвращение тотемов"] = {
									["count"] = 395,
								},
							},
							["amount"] = 5807,
						},
					},
					["HOTs"] = {
						["Жизнь Земли"] = {
							["Details"] = {
								["Firstsight"] = {
									["count"] = 24,
								},
								["Smellmywind"] = {
									["count"] = 33,
								},
							},
							["amount"] = 57,
						},
						["Быстрина"] = {
							["Details"] = {
								["Smellmywind"] = {
									["count"] = 45,
								},
								["Covardy"] = {
									["count"] = 15,
								},
								["Firstsight"] = {
									["count"] = 51,
								},
								["Lilladra"] = {
									["count"] = 15,
								},
							},
							["amount"] = 126,
						},
					},
					["Healing"] = 186640,
					["HOT_Time"] = 183,
					["TimeSpent"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 0.05,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 4.23,
								},
								["Быстрина"] = {
									["count"] = 4.97,
								},
							},
							["amount"] = 9.249999999999998,
						},
						["Phelorna"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0.49,
								},
							},
							["amount"] = 0.49,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 0.24,
						},
						["Covardy"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 0,
								},
								["Быстрина"] = {
									["count"] = 6.65,
								},
							},
							["amount"] = 6.65,
						},
						["Firstsight"] = {
							["Details"] = {
								["Цепное исцеление"] = {
									["count"] = 0,
								},
								["Щит земли"] = {
									["count"] = 11.59,
								},
								["Жизнь Земли"] = {
									["count"] = 2.7,
								},
								["Пробуждение древних"] = {
									["count"] = 0,
								},
								["Малая волна исцеления"] = {
									["count"] = 2.05,
								},
								["Быстрина"] = {
									["count"] = 8.559999999999999,
								},
							},
							["amount"] = 24.9,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Огненный шок"] = {
									["count"] = 7.17,
								},
								["Огненный шок (УЗВ)"] = {
									["count"] = 20.73,
								},
								["Аура воздаяния"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 28.55,
						},
					},
					["Attacks"] = {
						["Огненный шок"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 999,
									["min"] = 967,
									["count"] = 4,
									["amount"] = 3964,
								},
							},
							["count"] = 4,
							["amount"] = 3964,
						},
						["Огненный шок (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 551,
									["min"] = 528,
									["count"] = 6,
									["amount"] = 3283,
								},
								["Tick"] = {
									["max"] = 368,
									["min"] = 352,
									["count"] = 18,
									["amount"] = 6534,
								},
							},
							["count"] = 24,
							["amount"] = 9817,
						},
						["Аура воздаяния"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 166,
									["min"] = 165,
									["count"] = 3,
									["amount"] = 496,
								},
							},
							["count"] = 3,
							["amount"] = 496,
						},
					},
					["HealingTaken"] = 44048,
					["DamageTaken"] = 44481,
					["TimeDamage"] = 28.55,
					["TimeDamaging"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Огненный шок"] = {
									["count"] = 7.17,
								},
								["Огненный шок (УЗВ)"] = {
									["count"] = 20.73,
								},
								["Аура воздаяния"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 28.55,
						},
					},
					["ManaGain"] = 5807,
					["WhoHealed"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Жизнь Земли"] = {
									["count"] = 2027,
								},
								["Пробуждение древних"] = {
									["count"] = 4327,
								},
								["Малая волна исцеления"] = {
									["count"] = 21323,
								},
								["Быстрина"] = {
									["count"] = 11316,
								},
							},
							["amount"] = 38993,
						},
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 5055,
								},
							},
							["amount"] = 5055,
						},
					},
					["DispelledWho"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Firstsight"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Covardy"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Lilladra"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 1680862003,
			["LastActive"] = 1680862120,
		},
		["Тотем гнева воздуха <Smellmywind>"] = {
			["GUID"] = "0xF130003C570001E8",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
			},
			["LastEventType"] = {
				"MISC", -- [1]
				"MISC", -- [2]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					2, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["DeathLogs"] = {
				{
					["MessageTimes"] = {
						-2.769000000087544, -- [1]
						0, -- [2]
					},
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
					},
					["Messages"] = {
						"Тотем гнева воздуха <Smellmywind> умирает.", -- [1]
						"Тотем гнева воздуха <Smellmywind> умирает.", -- [2]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["DeathAt"] = 1680862079,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
					},
					["MessageType"] = {
						"MISC", -- [1]
						"MISC", -- [2]
					},
				}, -- [1]
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Тотем гнева воздуха <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862076,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [2]
			},
			["LastFlags"] = 4370,
			["Owner"] = "Smellmywind",
			["NextEventNum"] = 3,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
			},
			["LastEvents"] = {
				"Тотем гнева воздуха <Smellmywind> умирает.", -- [1]
				"Тотем гнева воздуха <Smellmywind> умирает.", -- [2]
			},
			["Name"] = "Тотем гнева воздуха",
			["TimeLast"] = {
				["OVERALL"] = 1680862077,
				["DeathCount"] = 1680862077,
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
			},
			["LastEventTimes"] = {
				1794727.625, -- [1]
				1794730.394, -- [2]
			},
			["UnitLockout"] = 1680862077,
			["Fights"] = {
				["CurrentFightData"] = {
					["DeathCount"] = 2,
				},
				["OverallData"] = {
					["DeathCount"] = 2,
				},
			},
		},
		["Flametongue Totem VIII <Smellmywind>"] = {
			["GUID"] = "0xF13000799D0001E5",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
			},
			["LastEventType"] = {
				"MISC", -- [1]
				"MISC", -- [2]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					2, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["DeathLogs"] = {
				{
					["MessageTimes"] = {
						-2.78899999987334, -- [1]
						0, -- [2]
					},
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
					},
					["Messages"] = {
						"Flametongue Totem VIII <Smellmywind> умирает.", -- [1]
						"Flametongue Totem VIII <Smellmywind> умирает.", -- [2]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["DeathAt"] = 1680862079,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
					},
					["MessageType"] = {
						"MISC", -- [1]
						"MISC", -- [2]
					},
				}, -- [1]
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Flametongue Totem VIII <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862076,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [2]
			},
			["LastFlags"] = 4370,
			["Owner"] = "Smellmywind",
			["NextEventNum"] = 3,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
			},
			["LastEvents"] = {
				"Flametongue Totem VIII <Smellmywind> умирает.", -- [1]
				"Flametongue Totem VIII <Smellmywind> умирает.", -- [2]
			},
			["Name"] = "Flametongue Totem VIII",
			["TimeLast"] = {
				["OVERALL"] = 1680862077,
				["DeathCount"] = 1680862077,
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
			},
			["LastEventTimes"] = {
				1794727.604, -- [1]
				1794730.393, -- [2]
			},
			["UnitLockout"] = 1680862077,
			["Fights"] = {
				["CurrentFightData"] = {
					["DeathCount"] = 2,
				},
				["OverallData"] = {
					["DeathCount"] = 2,
				},
			},
		},
		["Lilladra"] = {
			["GUID"] = "0x07000000008D19C3",
			["LastEventHealth"] = {
				"20452 (79%)", -- [1]
				"20452 (79%)", -- [2]
				"20452 (79%)", -- [3]
				"20452 (79%)", -- [4]
				"20452 (79%)", -- [5]
				"20452 (79%)", -- [6]
				"20452 (79%)", -- [7]
				"20452 (79%)", -- [8]
				"20452 (79%)", -- [9]
				"20452 (79%)", -- [10]
				"20452 (79%)", -- [11]
				"20452 (79%)", -- [12]
				"20452 (79%)", -- [13]
				"20452 (79%)", -- [14]
				"20452 (79%)", -- [15]
				"20452 (79%)", -- [16]
				"20452 (79%)", -- [17]
				"20452 (79%)", -- [18]
				"20452 (79%)", -- [19]
				"20452 (79%)", -- [20]
				"20452 (79%)", -- [21]
				"20452 (79%)", -- [22]
				"20452 (79%)", -- [23]
				"20452 (79%)", -- [24]
				"20452 (79%)", -- [25]
				"20452 (79%)", -- [26]
				"20452 (79%)", -- [27]
				"20452 (79%)", -- [28]
				"20452 (79%)", -- [29]
				"20452 (79%)", -- [30]
				"20452 (79%)", -- [31]
				"20452 (79%)", -- [32]
				"20452 (79%)", -- [33]
				"20452 (79%)", -- [34]
				"20452 (79%)", -- [35]
				"20452 (79%)", -- [36]
				"20452 (79%)", -- [37]
				"20452 (79%)", -- [38]
				"20452 (79%)", -- [39]
				"20452 (79%)", -- [40]
				"20452 (79%)", -- [41]
				"20452 (79%)", -- [42]
				"20452 (79%)", -- [43]
				"20452 (79%)", -- [44]
				"20452 (79%)", -- [45]
				"20452 (79%)", -- [46]
				"20452 (79%)", -- [47]
				"20452 (79%)", -- [48]
				"20452 (79%)", -- [49]
				"20452 (79%)", -- [50]
			},
			["LastAttackedBy"] = "Порожденный чумой ужас",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					265, -- [1]
				},
				["HealingTaken"] = {
					24519, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					89.56, -- [1]
				},
				["DamageTaken"] = {
					29726, -- [1]
				},
				["TimeDamage"] = {
					89.56, -- [1]
				},
				["DOT_Time"] = {
					132, -- [1]
				},
				["Damage"] = {
					477599, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "Lilladra",
			["level"] = 80,
			["LastDamageAbility"] = "Токсичный выброс (УЗВ)",
			["LastFightIn"] = 0,
			["LastEventNum"] = {
			},
			["type"] = "Grouped",
			["LastDamageTaken"] = 2560,
			["TimeLast"] = {
				["Dispelled"] = 1680862061,
				["OVERALL"] = 1680862156,
				["DamageTaken"] = 1680862117,
				["EnergyGain"] = 1680862156,
				["HealingTaken"] = 1680862118,
				["TimeDamage"] = 1680862156,
				["ActiveTime"] = 1680862156,
				["DOT_Time"] = 1680862151,
				["Damage"] = 1680862156,
			},
			["Owner"] = false,
			["LastAbility"] = 1794809.543,
			["NextEventNum"] = 20,
			["LastEventHealthNum"] = {
				79.88126391438503, -- [1]
				79.88126391438503, -- [2]
				79.88126391438503, -- [3]
				79.88126391438503, -- [4]
				79.88126391438503, -- [5]
				79.88126391438503, -- [6]
				79.88126391438503, -- [7]
				79.88126391438503, -- [8]
				79.88126391438503, -- [9]
				79.88126391438503, -- [10]
				79.88126391438503, -- [11]
				79.88126391438503, -- [12]
				79.88126391438503, -- [13]
				79.88126391438503, -- [14]
				79.88126391438503, -- [15]
				79.88126391438503, -- [16]
				79.88126391438503, -- [17]
				79.88126391438503, -- [18]
				79.88126391438503, -- [19]
				79.88126391438503, -- [20]
				79.88126391438503, -- [21]
				79.88126391438503, -- [22]
				79.88126391438503, -- [23]
				79.88126391438503, -- [24]
				79.88126391438503, -- [25]
				79.88126391438503, -- [26]
				79.88126391438503, -- [27]
				79.88126391438503, -- [28]
				79.88126391438503, -- [29]
				79.88126391438503, -- [30]
				79.88126391438503, -- [31]
				79.88126391438503, -- [32]
				79.88126391438503, -- [33]
				79.88126391438503, -- [34]
				79.88126391438503, -- [35]
				79.88126391438503, -- [36]
				79.88126391438503, -- [37]
				79.88126391438503, -- [38]
				79.88126391438503, -- [39]
				79.88126391438503, -- [40]
				79.88126391438503, -- [41]
				79.88126391438503, -- [42]
				79.88126391438503, -- [43]
				79.88126391438503, -- [44]
				79.88126391438503, -- [45]
				79.88126391438503, -- [46]
				79.88126391438503, -- [47]
				79.88126391438503, -- [48]
				79.88126391438503, -- [49]
				79.88126391438503, -- [50]
			},
			["LastEvents"] = {
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -966 (Physical)", -- [1]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1218 (Nature)", -- [2]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -1828 (Physical)", -- [3]
				"Lilladra Рваная рана (УЗВ) Порожденный чумой ужас Crit -784 (Physical)", -- [4]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1219 (Nature)", -- [5]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -463 (Physical)", -- [6]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1165 (Nature)", -- [7]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -504 (Physical)", -- [8]
				"Lilladra Смертельный яд IX (УЗВ) Порожденный чумой ужас Tick -1546 (Nature)", -- [9]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -1814 (Physical)", -- [10]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1240 (Nature)", -- [11]
				"Lilladra Отравление Порожденный чумой ужас Hit -3855 (Nature)", -- [12]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1217 (Nature)", -- [13]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -441 (Physical)", -- [14]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1226 (Nature)", -- [15]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -1680 (Physical)", -- [16]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1244 (Nature)", -- [17]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -992 (Physical)", -- [18]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -1812 (Physical)", -- [19]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -903 (Physical)", -- [20]
				"Lilladra Отравление Порожденный чумой ужас Hit -3855 (Nature)", -- [21]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Crit -1789 (Nature)", -- [22]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -1048 (Physical)", -- [23]
				"Lilladra Рваная рана (УЗВ) Порожденный чумой ужас Tick -392 (Physical)", -- [24]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1161 (Nature)", -- [25]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -834 (Physical)", -- [26]
				"Lilladra Смертельный яд IX (УЗВ) Порожденный чумой ужас Tick -1547 (Nature)", -- [27]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1137 (Nature)", -- [28]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -472 (Physical)", -- [29]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1197 (Nature)", -- [30]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -1880 (Physical)", -- [31]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Crit -1836 (Nature)", -- [32]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -922 (Physical)", -- [33]
				"Lilladra Рваная рана (УЗВ) Порожденный чумой ужас Crit -783 (Physical)", -- [34]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Miss", -- [35]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Miss", -- [36]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1197 (Nature)", -- [37]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -956 (Physical)", -- [38]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1227 (Nature)", -- [39]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -777 (Physical)", -- [40]
				"Lilladra Смертельный яд IX (УЗВ) Порожденный чумой ужас Tick -1546 (Nature)", -- [41]
				"Lilladra Рваная рана (УЗВ) Порожденный чумой ужас Crit -784 (Physical)", -- [42]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1116 (Nature)", -- [43]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Crit -970 (Physical)", -- [44]
				"Lilladra Расправа Порожденный чумой ужас Crit -3652 (Physical)", -- [45]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1214 (Nature)", -- [46]
				"Lilladra Расправа Порожденный чумой ужас Crit -2599 (Physical)", -- [47]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1230 (Nature)", -- [48]
				"Lilladra Атака ближнего боя Порожденный чумой ужас Hit -836 (Physical)", -- [49]
				"Lilladra Быстродействующий яд IX Порожденный чумой ужас Hit -1131 (Nature)", -- [50]
			},
			["Name"] = "Lilladra",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				1794782.608, -- [1]
				1794785.391, -- [2]
				1794785.391, -- [3]
				1794786.931, -- [4]
				1794786.964, -- [5]
				1794786.965, -- [6]
				1794804.489, -- [7]
				1794804.489, -- [8]
				1794804.49, -- [9]
				1794804.49, -- [10]
				1794807.863, -- [11]
				1794807.863, -- [12]
				1794807.865, -- [13]
				1794807.865, -- [14]
				1794807.996, -- [15]
				1794807.996, -- [16]
				1794808.164, -- [17]
				1794808.164, -- [18]
				1794809.543, -- [19]
				1794772.333, -- [20]
				1794772.64, -- [21]
				1794772.642, -- [22]
				1794772.642, -- [23]
				1794772.816, -- [24]
				1794773.037, -- [25]
				1794773.037, -- [26]
				1794773.869, -- [27]
				1794773.869, -- [28]
				1794773.87, -- [29]
				1794774.091, -- [30]
				1794774.091, -- [31]
				1794774.404, -- [32]
				1794774.405, -- [33]
				1794774.779, -- [34]
				1794775.217, -- [35]
				1794775.537, -- [36]
				1794776.143, -- [37]
				1794776.143, -- [38]
				1794776.285, -- [39]
				1794776.285, -- [40]
				1794776.581, -- [41]
				1794776.73, -- [42]
				1794776.899, -- [43]
				1794776.899, -- [44]
				1794782.333, -- [45]
				1794782.333, -- [46]
				1794782.333, -- [47]
				1794782.334, -- [48]
				1794782.334, -- [49]
				1794782.608, -- [50]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 120,
						["Physical"] = 40,
					},
					["DOTs"] = {
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Горгулья с каменным хребтом"] = {
									["count"] = 48,
								},
								["Порожденный чумой ужас"] = {
									["count"] = 48,
								},
							},
							["amount"] = 96,
						},
						["Гаррота (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
					},
					["TimeSpent"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 13.64,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 0.77,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 8.790000000000001,
								},
								["Расправа"] = {
									["count"] = 1.17,
								},
								["Отравление"] = {
									["count"] = 2.73,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
							},
							["amount"] = 27.10000000000001,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 27.28999999999999,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 2.74,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2.34,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 22.93,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
								["Расправа"] = {
									["count"] = 5.14,
								},
								["Отравление"] = {
									["count"] = 2.02,
								},
								["Гаррота (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 62.45999999999999,
						},
					},
					["DamageTaken"] = 29726,
					["EnergyGain"] = 265,
					["PartialAbsorb"] = {
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 89.56,
					["ElementTaken"] = {
						["Nature"] = 29726,
					},
					["DOT_Time"] = 132,
					["Damage"] = 477599,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["EnergyGained"] = {
						["Целенаправленные атаки"] = {
							["Details"] = {
								["Lilladra"] = {
									["count"] = 250,
								},
							},
							["amount"] = 250,
						},
						["Маленькие хитрости"] = {
							["Details"] = {
								["Lilladra"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["WhoHealed"] = {
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7529,
								},
							},
							["amount"] = 7529,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 7029,
								},
								["Цепное исцеление"] = {
									["count"] = 3913,
								},
								["Быстрина"] = {
									["count"] = 6048,
								},
							},
							["amount"] = 16990,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Пустулезная плоть (УЗВ)"] = {
									["count"] = 3000,
								},
								["Пустулезная плоть"] = {
									["count"] = 13926,
								},
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 12800,
								},
							},
							["amount"] = 29726,
						},
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
					},
					["PartialResist"] = {
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Physical"] = 78762,
						["Melee"] = 173946,
						["Nature"] = 224891,
					},
					["HealingTaken"] = 24519,
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 62673,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 16389,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 42136,
								},
								["Расправа"] = {
									["count"] = 20700,
								},
								["Отравление"] = {
									["count"] = 16381,
								},
								["Веер клинков"] = {
									["count"] = 4176,
								},
							},
							["amount"] = 162455,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 111273,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 23283,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 3919,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 83532,
								},
								["Веер клинков"] = {
									["count"] = 2073,
								},
								["Расправа"] = {
									["count"] = 43978,
								},
								["Отравление"] = {
									["count"] = 43170,
								},
								["Гаррота (УЗВ)"] = {
									["count"] = 3916,
								},
							},
							["amount"] = 315144,
						},
					},
					["TimeDamage"] = 89.56,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 13.64,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 0.77,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 8.790000000000001,
								},
								["Расправа"] = {
									["count"] = 1.17,
								},
								["Отравление"] = {
									["count"] = 2.73,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
							},
							["amount"] = 27.10000000000001,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 27.28999999999999,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 2.74,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2.34,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 22.93,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
								["Расправа"] = {
									["count"] = 5.14,
								},
								["Отравление"] = {
									["count"] = 2.02,
								},
								["Гаррота (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 62.45999999999999,
						},
					},
					["EnergyGainedFrom"] = {
						["Lilladra"] = {
							["Details"] = {
								["Целенаправленные атаки"] = {
									["count"] = 250,
								},
								["Маленькие хитрости"] = {
									["count"] = 15,
								},
							},
							["amount"] = 265,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 836,
									["min"] = 451,
									["count"] = 3,
									["amount"] = 2064,
								},
								["Miss"] = {
									["count"] = 12,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1956,
									["min"] = 802,
									["count"] = 100,
									["amount"] = 130822,
								},
								["Hit"] = {
									["max"] = 973,
									["min"] = 416,
									["count"] = 64,
									["amount"] = 41060,
								},
							},
							["count"] = 179,
							["amount"] = 173946,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1648,
									["min"] = 309,
									["count"] = 32,
									["amount"] = 39672,
								},
							},
							["count"] = 32,
							["amount"] = 39672,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 784,
									["min"] = 783,
									["count"] = 4,
									["amount"] = 3135,
								},
								["Tick"] = {
									["max"] = 392,
									["min"] = 392,
									["count"] = 2,
									["amount"] = 784,
								},
							},
							["count"] = 6,
							["amount"] = 3919,
						},
						["Быстродействующий яд IX"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1940,
									["min"] = 1549,
									["count"] = 23,
									["amount"] = 40153,
								},
								["Hit"] = {
									["max"] = 1316,
									["min"] = 1061,
									["count"] = 72,
									["amount"] = 85515,
								},
							},
							["count"] = 95,
							["amount"] = 125668,
						},
						["Веер клинков"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2220,
									["min"] = 954,
									["count"] = 2,
									["amount"] = 3174,
								},
								["Hit"] = {
									["max"] = 1119,
									["min"] = 407,
									["count"] = 4,
									["amount"] = 3075,
								},
							},
							["count"] = 6,
							["amount"] = 6249,
						},
						["Расправа"] = {
							["Details"] = {
								["Crit (Блокировано)"] = {
									["max"] = 2289,
									["min"] = 2289,
									["count"] = 1,
									["amount"] = 2289,
								},
								["Crit"] = {
									["max"] = 3652,
									["min"] = 2325,
									["count"] = 17,
									["amount"] = 49210,
								},
								["Hit"] = {
									["max"] = 1525,
									["min"] = 800,
									["count"] = 10,
									["amount"] = 13179,
								},
							},
							["count"] = 28,
							["amount"] = 64678,
						},
						["Отравление"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 8222,
									["min"] = 4170,
									["count"] = 6,
									["amount"] = 43168,
								},
								["Hit"] = {
									["max"] = 3855,
									["min"] = 2891,
									["count"] = 5,
									["amount"] = 16383,
								},
							},
							["count"] = 11,
							["amount"] = 59551,
						},
						["Гаррота (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 653,
									["min"] = 652,
									["count"] = 6,
									["amount"] = 3916,
								},
							},
							["count"] = 6,
							["amount"] = 3916,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 24,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 46,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 12,
								},
								["Crit"] = {
									["count"] = 100,
								},
								["Hit"] = {
									["count"] = 67,
								},
							},
							["amount"] = 179,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 32,
								},
								["Crit"] = {
									["count"] = 29,
								},
								["Hit"] = {
									["count"] = 77,
								},
							},
							["amount"] = 138,
						},
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 120,
						["Physical"] = 40,
					},
					["DOTs"] = {
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Горгулья с каменным хребтом"] = {
									["count"] = 48,
								},
								["Порожденный чумой ужас"] = {
									["count"] = 48,
								},
							},
							["amount"] = 96,
						},
						["Гаррота (УЗВ)"] = {
							["Details"] = {
								["Порожденный чумой ужас"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
					},
					["TimeSpent"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 13.64,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 0.77,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 8.790000000000001,
								},
								["Расправа"] = {
									["count"] = 1.17,
								},
								["Отравление"] = {
									["count"] = 2.73,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
							},
							["amount"] = 27.10000000000001,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 27.28999999999999,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 2.74,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2.34,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 22.93,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
								["Расправа"] = {
									["count"] = 5.14,
								},
								["Отравление"] = {
									["count"] = 2.02,
								},
								["Гаррота (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 62.45999999999999,
						},
					},
					["DamageTaken"] = 29726,
					["EnergyGain"] = 265,
					["PartialAbsorb"] = {
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 89.56,
					["ElementTaken"] = {
						["Nature"] = 29726,
					},
					["DOT_Time"] = 132,
					["Damage"] = 477599,
					["WhoDispelled"] = {
						["Smellmywind"] = {
							["Details"] = {
								["Пустулезная плоть (Очищение духа)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["EnergyGained"] = {
						["Целенаправленные атаки"] = {
							["Details"] = {
								["Lilladra"] = {
									["count"] = 250,
								},
							},
							["amount"] = 250,
						},
						["Маленькие хитрости"] = {
							["Details"] = {
								["Lilladra"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["WhoHealed"] = {
						["Phelorna"] = {
							["Details"] = {
								["Объятия вампира"] = {
									["count"] = 7529,
								},
							},
							["amount"] = 7529,
						},
						["Smellmywind"] = {
							["Details"] = {
								["Пробуждение древних"] = {
									["count"] = 7029,
								},
								["Цепное исцеление"] = {
									["count"] = 3913,
								},
								["Быстрина"] = {
									["count"] = 6048,
								},
							},
							["amount"] = 16990,
						},
					},
					["WhoDamaged"] = {
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Пустулезная плоть (УЗВ)"] = {
									["count"] = 3000,
								},
								["Пустулезная плоть"] = {
									["count"] = 13926,
								},
								["Токсичный выброс (УЗВ)"] = {
									["count"] = 12800,
								},
							},
							["amount"] = 29726,
						},
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
					},
					["PartialResist"] = {
						["Пустулезная плоть (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пустулезная плоть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Токсичный выброс (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Physical"] = 78762,
						["Melee"] = 173946,
						["Nature"] = 224891,
					},
					["HealingTaken"] = 24519,
					["DamagedWho"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 62673,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 16389,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 42136,
								},
								["Расправа"] = {
									["count"] = 20700,
								},
								["Отравление"] = {
									["count"] = 16381,
								},
								["Веер клинков"] = {
									["count"] = 4176,
								},
							},
							["amount"] = 162455,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 111273,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 23283,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 3919,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 83532,
								},
								["Веер клинков"] = {
									["count"] = 2073,
								},
								["Расправа"] = {
									["count"] = 43978,
								},
								["Отравление"] = {
									["count"] = 43170,
								},
								["Гаррота (УЗВ)"] = {
									["count"] = 3916,
								},
							},
							["amount"] = 315144,
						},
					},
					["TimeDamage"] = 89.56,
					["TimeDamaging"] = {
						["Горгулья с каменным хребтом"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 13.64,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 0.77,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 8.790000000000001,
								},
								["Расправа"] = {
									["count"] = 1.17,
								},
								["Отравление"] = {
									["count"] = 2.73,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
							},
							["amount"] = 27.10000000000001,
						},
						["Порожденный чумой ужас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 27.28999999999999,
								},
								["Смертельный яд IX (УЗВ)"] = {
									["count"] = 2.74,
								},
								["Рваная рана (УЗВ)"] = {
									["count"] = 2.34,
								},
								["Быстродействующий яд IX"] = {
									["count"] = 22.93,
								},
								["Веер клинков"] = {
									["count"] = 0,
								},
								["Расправа"] = {
									["count"] = 5.14,
								},
								["Отравление"] = {
									["count"] = 2.02,
								},
								["Гаррота (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 62.45999999999999,
						},
					},
					["EnergyGainedFrom"] = {
						["Lilladra"] = {
							["Details"] = {
								["Целенаправленные атаки"] = {
									["count"] = 250,
								},
								["Маленькие хитрости"] = {
									["count"] = 15,
								},
							},
							["amount"] = 265,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 836,
									["min"] = 451,
									["count"] = 3,
									["amount"] = 2064,
								},
								["Miss"] = {
									["count"] = 12,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1956,
									["min"] = 802,
									["count"] = 100,
									["amount"] = 130822,
								},
								["Hit"] = {
									["max"] = 973,
									["min"] = 416,
									["count"] = 64,
									["amount"] = 41060,
								},
							},
							["count"] = 179,
							["amount"] = 173946,
						},
						["Смертельный яд IX (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1648,
									["min"] = 309,
									["count"] = 32,
									["amount"] = 39672,
								},
							},
							["count"] = 32,
							["amount"] = 39672,
						},
						["Рваная рана (УЗВ)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 784,
									["min"] = 783,
									["count"] = 4,
									["amount"] = 3135,
								},
								["Tick"] = {
									["max"] = 392,
									["min"] = 392,
									["count"] = 2,
									["amount"] = 784,
								},
							},
							["count"] = 6,
							["amount"] = 3919,
						},
						["Быстродействующий яд IX"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1940,
									["min"] = 1549,
									["count"] = 23,
									["amount"] = 40153,
								},
								["Hit"] = {
									["max"] = 1316,
									["min"] = 1061,
									["count"] = 72,
									["amount"] = 85515,
								},
							},
							["count"] = 95,
							["amount"] = 125668,
						},
						["Веер клинков"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2220,
									["min"] = 954,
									["count"] = 2,
									["amount"] = 3174,
								},
								["Hit"] = {
									["max"] = 1119,
									["min"] = 407,
									["count"] = 4,
									["amount"] = 3075,
								},
							},
							["count"] = 6,
							["amount"] = 6249,
						},
						["Расправа"] = {
							["Details"] = {
								["Crit (Блокировано)"] = {
									["max"] = 2289,
									["min"] = 2289,
									["count"] = 1,
									["amount"] = 2289,
								},
								["Crit"] = {
									["max"] = 3652,
									["min"] = 2325,
									["count"] = 17,
									["amount"] = 49210,
								},
								["Hit"] = {
									["max"] = 1525,
									["min"] = 800,
									["count"] = 10,
									["amount"] = 13179,
								},
							},
							["count"] = 28,
							["amount"] = 64678,
						},
						["Отравление"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 8222,
									["min"] = 4170,
									["count"] = 6,
									["amount"] = 43168,
								},
								["Hit"] = {
									["max"] = 3855,
									["min"] = 2891,
									["count"] = 5,
									["amount"] = 16383,
								},
							},
							["count"] = 11,
							["amount"] = 59551,
						},
						["Гаррота (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 653,
									["min"] = 652,
									["count"] = 6,
									["amount"] = 3916,
								},
							},
							["count"] = 6,
							["amount"] = 3916,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 24,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 46,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 12,
								},
								["Crit"] = {
									["count"] = 100,
								},
								["Hit"] = {
									["count"] = 67,
								},
							},
							["amount"] = 179,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 32,
								},
								["Crit"] = {
									["count"] = 29,
								},
								["Hit"] = {
									["count"] = 77,
								},
							},
							["amount"] = 138,
						},
					},
				},
			},
			["UnitLockout"] = 1680862031,
			["LastActive"] = 1680862156,
		},
		["Stoneskin Totem X <Smellmywind>"] = {
			["GUID"] = "0xF1300079C80001E6",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
			},
			["LastEventType"] = {
				"MISC", -- [1]
				"MISC", -- [2]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					2, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["LastFlags"] = 4370,
			["DeathLogs"] = {
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Stoneskin Totem X <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862079,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [1]
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Stoneskin Totem X <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862063,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [2]
			},
			["Owner"] = "Smellmywind",
			["NextEventNum"] = 3,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
			},
			["LastEvents"] = {
				"Stoneskin Totem X <Smellmywind> умирает.", -- [1]
				"Stoneskin Totem X <Smellmywind> умирает.", -- [2]
			},
			["Name"] = "Stoneskin Totem X",
			["TimeLast"] = {
				["OVERALL"] = 1680862077,
				["DeathCount"] = 1680862077,
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
			},
			["LastEventTimes"] = {
				1794714.432, -- [1]
				1794730.394, -- [2]
			},
			["UnitLockout"] = 1680862077,
			["Fights"] = {
				["CurrentFightData"] = {
					["DeathCount"] = 2,
				},
				["OverallData"] = {
					["DeathCount"] = 2,
				},
			},
		},
		["Тотем оков земли <Smellmywind>"] = {
			["GUID"] = "0xF130000A460001E2",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
			},
			["LastEventType"] = {
				"MISC", -- [1]
				"MISC", -- [2]
				"MISC", -- [3]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					3, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["LastFlags"] = 4370,
			["DeathLogs"] = {
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Тотем оков земли <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862117,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [1]
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Тотем оков земли <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862095,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [2]
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Тотем оков земли <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862076,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [3]
			},
			["Owner"] = "Smellmywind",
			["NextEventNum"] = 4,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
			},
			["LastEvents"] = {
				"Тотем оков земли <Smellmywind> умирает.", -- [1]
				"Тотем оков земли <Smellmywind> умирает.", -- [2]
				"Тотем оков земли <Smellmywind> умирает.", -- [3]
			},
			["Name"] = "Тотем оков земли",
			["TimeLast"] = {
				["OVERALL"] = 1680862115,
				["DeathCount"] = 1680862115,
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
			},
			["LastEventTimes"] = {
				1794727.605, -- [1]
				1794746.332, -- [2]
				1794769.095, -- [3]
			},
			["UnitLockout"] = 1680862115,
			["Fights"] = {
				["CurrentFightData"] = {
					["DeathCount"] = 3,
				},
				["OverallData"] = {
					["DeathCount"] = 3,
				},
			},
		},
		["Mana Spring Totem VIII <Smellmywind>"] = {
			["GUID"] = "0xF1300079D60001E7",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
			},
			["LastEventType"] = {
				"MISC", -- [1]
				"MISC", -- [2]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					2, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["DeathLogs"] = {
				{
					["MessageTimes"] = {
						-2.787000000011176, -- [1]
						0, -- [2]
					},
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
					},
					["Messages"] = {
						"Mana Spring Totem VIII <Smellmywind> умирает.", -- [1]
						"Mana Spring Totem VIII <Smellmywind> умирает.", -- [2]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["DeathAt"] = 1680862079,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
					},
					["MessageType"] = {
						"MISC", -- [1]
						"MISC", -- [2]
					},
				}, -- [1]
				{
					["MessageTimes"] = {
						0, -- [1]
					},
					["MessageIncoming"] = {
						true, -- [1]
					},
					["Messages"] = {
						"Mana Spring Totem VIII <Smellmywind> умирает.", -- [1]
					},
					["EventNum"] = {
						0, -- [1]
					},
					["DeathAt"] = 1680862076,
					["HealthNum"] = {
						0, -- [1]
					},
					["Health"] = {
						"???", -- [1]
					},
					["MessageType"] = {
						"MISC", -- [1]
					},
				}, -- [2]
			},
			["LastFlags"] = 4370,
			["Owner"] = "Smellmywind",
			["NextEventNum"] = 3,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
			},
			["LastEvents"] = {
				"Mana Spring Totem VIII <Smellmywind> умирает.", -- [1]
				"Mana Spring Totem VIII <Smellmywind> умирает.", -- [2]
			},
			["Name"] = "Mana Spring Totem VIII",
			["TimeLast"] = {
				["OVERALL"] = 1680862077,
				["DeathCount"] = 1680862077,
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
			},
			["LastEventTimes"] = {
				1794727.607, -- [1]
				1794730.394, -- [2]
			},
			["UnitLockout"] = 1680862077,
			["Fights"] = {
				["CurrentFightData"] = {
					["DeathCount"] = 2,
				},
				["OverallData"] = {
					["DeathCount"] = 2,
				},
			},
		},
	},
	["FightNum"] = 0,
	["CombatTimes"] = {
	},
	["FoughtWho"] = {
	},
}
