
AtlasLootCharDB = {
	["QuickLooks"] = {
	},
	["WishList"] = {
	},
	["AtlasLootVersion"] = "51104",
	["LastSearchedText"] = "штурм",
	["AutoQuery"] = false,
	["SearchResult"] = {
		{
			6, -- [1]
			"s44575", -- [2]
			"Spell_Holy_GreaterHeal", -- [3]
			"=ds=Чары для наручей - штурм II", -- [4]
			"Наложение чар: Чары для наручей", -- [5]
			"", -- [6]
			"", -- [7]
			"EnchantingBracer1|\"\"", -- [8]
		}, -- [1]
		{
			7, -- [1]
			"s34002", -- [2]
			"Spell_Holy_GreaterHeal", -- [3]
			"=ds=Чары для наручей - штурм I", -- [4]
			"Наложение чар: Чары для наручей", -- [5]
			"", -- [6]
			"", -- [7]
			"EnchantingBracer1|\"\"", -- [8]
		}, -- [2]
		{
			0, -- [1]
			32334, -- [2]
			"", -- [3]
			"=q4=Жилет горного штурма", -- [4]
			"Гуртогг Кипящая Кровь", -- [5]
			"", -- [6]
			"", -- [7]
			"BTBloodboil|\"\"", -- [8]
		}, -- [3]
		{
			23, -- [1]
			18532, -- [2]
			"", -- [3]
			"=q3=Одеяние мозгоштурма", -- [4]
			"DM North Tribute Chest", -- [5]
			"", -- [6]
			"", -- [7]
			"DMNTRIBUTERUN|\"\"", -- [8]
		}, -- [4]
		{
			17, -- [1]
			32901, -- [2]
			"", -- [3]
			"=q1=Шаттратский настой беспощадного штурма", -- [4]
			"Shattrath Flasks", -- [5]
			"", -- [6]
			"", -- [7]
			"ShattrathFlasks1|\"\"", -- [8]
		}, -- [5]
		{
			13, -- [1]
			47267, -- [2]
			"", -- [3]
			"=q4=Арбалет лобового штурма смерти", -- [4]
			"Лорд Джараксус", -- [5]
			"", -- [6]
			"", -- [7]
			"TrialoftheCrusaderLordJaraxxus25Man_H|\"\"", -- [8]
		}, -- [6]
		{
			30, -- [1]
			"s60655", -- [2]
			"43132", -- [3]
			"=q3=Капюшон ночного штурма", -- [4]
			"Кожевничество: Кольчужная броня", -- [5]
			"", -- [6]
			"", -- [7]
			"LeatherMailArmorWrath2|\"\"", -- [8]
		}, -- [7]
		{
			0, -- [1]
			"s60658", -- [2]
			"43133", -- [3]
			"=q3=Ремень ночного штурма", -- [4]
			"Кожевничество: Кольчужная броня", -- [5]
			"", -- [6]
			"", -- [7]
			"LeatherMailArmorWrath2|\"\"", -- [8]
		}, -- [8]
		{
			10, -- [1]
			37216, -- [2]
			"", -- [3]
			"=q3=Покрытый письменами штурмовой щит", -- [4]
			"Крик'Тир Хранитель Врат", -- [5]
			"", -- [6]
			"", -- [7]
			"AzjolNerubKrikthir|\"\"", -- [8]
		}, -- [9]
		{
			20, -- [1]
			37179, -- [2]
			"", -- [3]
			"=q3=Штурмовой клинок пехотинца", -- [4]
			"Принц Келесет", -- [5]
			"", -- [6]
			"", -- [7]
			"UtgardeKeepKeleseth|\"\"", -- [8]
		}, -- [10]
		{
			14, -- [1]
			47428, -- [2]
			"", -- [3]
			"=q4=Арбалет лобового штурма смерти", -- [4]
			"Лорд Джараксус", -- [5]
			"", -- [6]
			"", -- [7]
			"TrialoftheCrusaderLordJaraxxus25ManHEROIC_H|\"\"", -- [8]
		}, -- [11]
		{
			0, -- [1]
			"s44645", -- [2]
			"Spell_Holy_GreaterHeal", -- [3]
			"=ds=Чары для кольца - штурм I", -- [4]
			"Наложение чар: Чары для кольца", -- [5]
			"", -- [6]
			"", -- [7]
			"EnchantingRing1|\"\"", -- [8]
		}, -- [12]
		{
			26, -- [1]
			"s60763", -- [2]
			"Spell_Holy_GreaterHeal", -- [3]
			"=ds=Чары для обуви - штурм II", -- [4]
			"Наложение чар: Чары для обуви", -- [5]
			"", -- [6]
			"", -- [7]
			"EnchantingBoots1|\"\"", -- [8]
		}, -- [13]
		{
			27, -- [1]
			"s60606", -- [2]
			"Spell_Holy_GreaterHeal", -- [3]
			"=ds=Чары для обуви - штурм I", -- [4]
			"Наложение чар: Чары для обуви", -- [5]
			"", -- [6]
			"", -- [7]
			"EnchantingBoots1|\"\"", -- [8]
		}, -- [14]
		{
			2, -- [1]
			"s44513", -- [2]
			"Spell_Holy_GreaterHeal", -- [3]
			"=ds=Чары для перчаток - штурм II", -- [4]
			"Наложение чар: Чары для перчаток", -- [5]
			"", -- [6]
			"", -- [7]
			"EnchantingGloves1|\"\"", -- [8]
		}, -- [15]
		{
			3, -- [1]
			"s33996", -- [2]
			"Spell_Holy_GreaterHeal", -- [3]
			"=ds=Чары для перчаток - штурм I", -- [4]
			"Наложение чар: Чары для перчаток", -- [5]
			"", -- [6]
			"", -- [7]
			"EnchantingGloves1|\"\"", -- [8]
		}, -- [16]
	},
}
AtlasLootFilterDB = {
	["Relics"] = {
		["Idol"] = true,
		["Libram"] = true,
		["Sigils"] = true,
		["Totem"] = true,
	},
	["WeaponsRanged"] = {
		["Crossbow"] = true,
		["Thrown"] = true,
		["Gun"] = true,
		["Bow"] = true,
		["Wand"] = true,
	},
	["Armor"] = {
		["Leather"] = true,
		["Plate"] = true,
		["Mail"] = true,
		["Cloth"] = true,
	},
	["WeaponsMeeleTwoHand"] = {
		["Mace"] = true,
		["Sword"] = true,
		["Axe"] = true,
	},
	["Other"] = {
		["Neck"] = true,
		["Trinket"] = true,
		["Ring"] = true,
		["Back"] = true,
	},
	["WeaponsMeele"] = {
		["Axe"] = true,
		["Shield"] = true,
		["Held in Off-Hand"] = true,
		["Staff"] = true,
		["Dagger"] = true,
		["Mace"] = true,
		["Fist Weapon"] = true,
		["Polearm"] = true,
		["Sword"] = true,
	},
}
