
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["Всадник без головы"] = {
			["GUID"] = "0xF130005C8200008C",
			["LastEventHealth"] = {
				"8507 (6%)", -- [1]
				"7774 (6%)", -- [2]
				"7774 (6%)", -- [3]
				"5893 (4%)", -- [4]
				"1 (0%)", -- [5]
				"1 (0%)", -- [6]
				"1 (0%)", -- [7]
				"1 (0%)", -- [8]
				"5041 (4%)", -- [9]
				"5041 (4%)", -- [10]
				"5041 (4%)", -- [11]
				"5041 (4%)", -- [12]
				"5041 (4%)", -- [13]
				"10081 (8%)", -- [14]
				"10081 (8%)", -- [15]
				"10081 (8%)", -- [16]
				"10081 (8%)", -- [17]
				"10081 (8%)", -- [18]
				"15121 (12%)", -- [19]
				"15121 (12%)", -- [20]
				"20161 (16%)", -- [21]
				"20161 (16%)", -- [22]
				"20161 (16%)", -- [23]
				"???", -- [24]
				"???", -- [25]
				"???", -- [26]
				"39418 (31%)", -- [27]
				"38685 (30%)", -- [28]
				"38685 (30%)", -- [29]
				"38625 (30%)", -- [30]
				"30595 (24%)", -- [31]
				"30595 (24%)", -- [32]
				"29611 (23%)", -- [33]
				"29611 (23%)", -- [34]
				"27696 (21%)", -- [35]
				"26963 (21%)", -- [36]
				"19792 (15%)", -- [37]
				"19792 (15%)", -- [38]
				"19167 (15%)", -- [39]
				"18434 (14%)", -- [40]
				"17176 (13%)", -- [41]
				"15602 (12%)", -- [42]
				"15504 (12%)", -- [43]
				"14771 (11%)", -- [44]
				"14771 (11%)", -- [45]
				"14771 (11%)", -- [46]
				"14245 (11%)", -- [47]
				"10519 (8%)", -- [48]
				"9535 (7%)", -- [49]
				"9437 (7%)", -- [50]
			},
			["LastAttackedBy"] = "Mazdaqq",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					129.99, -- [1]
				},
				["Damage"] = {
					75559, -- [1]
				},
				["DamageTaken"] = {
					763378, -- [1]
				},
				["ActiveTime"] = {
					129.99, -- [1]
				},
			},
			["enClass"] = "MOB",
			["LastDamageTaken"] = 1881,
			["LastAbility"] = 93559.129,
			["level"] = -1,
			["LastDamageAbility"] = "Вскипание крови",
			["LastFightIn"] = 13,
			["LastEventNum"] = {
				0.7380952380952381, -- [1]
				0.5817460317460318, -- [2]
				5.033333333333333, -- [3]
				1.492857142857143, -- [4]
				nil, -- [5]
				nil, -- [6]
				nil, -- [7]
				nil, -- [8]
				nil, -- [9]
				nil, -- [10]
				nil, -- [11]
				nil, -- [12]
				nil, -- [13]
				nil, -- [14]
				nil, -- [15]
				nil, -- [16]
				nil, -- [17]
				nil, -- [18]
				nil, -- [19]
				nil, -- [20]
				nil, -- [21]
				nil, -- [22]
				nil, -- [23]
				nil, -- [24]
				nil, -- [25]
				nil, -- [26]
				0.9984126984126984, -- [27]
				0.5817460317460318, -- [28]
				0.4222222222222222, -- [29]
				0.04761904761904762, -- [30]
				5.950793650793651, -- [31]
				4.742857142857143, -- [32]
				0.780952380952381, -- [33]
				nil, -- [34]
				1.51984126984127, -- [35]
				0.5817460317460318, -- [36]
				0.9484126984126984, -- [37]
				0.4182539682539683, -- [38]
				0.07777777777777778, -- [39]
				0.5817460317460318, -- [40]
				0.9984126984126984, -- [41]
				1.249206349206349, -- [42]
				0.07777777777777778, -- [43]
				0.5817460317460318, -- [44]
				2.464285714285714, -- [45]
				0.4174603174603175, -- [46]
				nil, -- [47]
				0.4928571428571429, -- [48]
				0.780952380952381, -- [49]
				0.07777777777777778, -- [50]
			},
			["type"] = "Boss",
			["FightsSaved"] = 5,
			["GuardianReverseGUIDs"] = {
				["Пульсирующая тыква"] = {
					["LatestGuardian"] = 7,
					["GUIDs"] = {
						"0xF130005C8E00009A", -- [1]
						"0xF130005C8E00009B", -- [2]
						"0xF130005C8E00009C", -- [3]
						"0xF130005C8E00008F", -- [4]
						"0xF130005C8E000090", -- [5]
						"0xF130005C8E000091", -- [6]
						"0xF130005C8E000092", -- [7]
						[0] = "0xF130005C8E000099",
					},
				},
			},
			["TimeLast"] = {
				["ActiveTime"] = 1697820966,
				["TimeDamage"] = 1697820966,
				["OVERALL"] = 1697820966,
				["DamageTaken"] = 1697820958,
				["Damage"] = 1697820966,
			},
			["Owner"] = false,
			["Pet"] = {
				"Пульсирующая тыква <Всадник без головы>", -- [1]
			},
			["NextEventNum"] = 27,
			["LastEventHealthNum"] = {
				6.751587301587302, -- [1]
				6.16984126984127, -- [2]
				6.16984126984127, -- [3]
				4.676984126984127, -- [4]
				0.0007936507936507937, -- [5]
				0.0007936507936507937, -- [6]
				0.0007936507936507937, -- [7]
				0.0007936507936507937, -- [8]
				4.000793650793651, -- [9]
				4.000793650793651, -- [10]
				4.000793650793651, -- [11]
				4.000793650793651, -- [12]
				4.000793650793651, -- [13]
				8.000793650793652, -- [14]
				8.000793650793652, -- [15]
				8.000793650793652, -- [16]
				8.000793650793652, -- [17]
				8.000793650793652, -- [18]
				12.00079365079365, -- [19]
				12.00079365079365, -- [20]
				16.00079365079365, -- [21]
				16.00079365079365, -- [22]
				16.00079365079365, -- [23]
				0, -- [24]
				0, -- [25]
				0, -- [26]
				31.28412698412699, -- [27]
				30.70238095238095, -- [28]
				30.70238095238095, -- [29]
				30.65476190476191, -- [30]
				24.28174603174603, -- [31]
				24.28174603174603, -- [32]
				23.50079365079365, -- [33]
				23.50079365079365, -- [34]
				21.98095238095238, -- [35]
				21.39920634920635, -- [36]
				15.70793650793651, -- [37]
				15.70793650793651, -- [38]
				15.21190476190476, -- [39]
				14.63015873015873, -- [40]
				13.63174603174603, -- [41]
				12.38253968253968, -- [42]
				12.30476190476191, -- [43]
				11.72301587301587, -- [44]
				11.72301587301587, -- [45]
				11.72301587301587, -- [46]
				11.30555555555556, -- [47]
				8.348412698412698, -- [48]
				7.567460317460317, -- [49]
				7.48968253968254, -- [50]
			},
			["LastEvents"] = {
				"Mazdaqq Бродячая чума Всадник без головы Hit -930 (Shadow)", -- [1]
				"Mazdaqq Смерть и разложение Всадник без головы Hit -733 (Shadow)", -- [2]
				"Mazdaqq Атака ближнего боя Всадник без головы Crit -6342 (Physical)", -- [3]
				"Mazdaqq Вскипание крови Всадник без головы Hit -1881 (Shadow)", -- [4]
				"Mazdaqq Некроз Всадник без головы Immune (Shadow)", -- [5]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [6]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [7]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [8]
				"Mazdaqq Удар смерти Всадник без головы Immune (Physical)", -- [9]
				"Mazdaqq Озноб Всадник без головы Immune (Frost)", -- [10]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [11]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [12]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [13]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [14]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [15]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [16]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [17]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [18]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [19]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [20]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [21]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [22]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [23]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [24]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [25]
				"Всадник без головы Колун всадника Mazdaqq Hit -1786 (Physical)", -- [26]
				"Mazdaqq Озноб (УЗВ) Всадник без головы Tick -1258 (Frost)", -- [27]
				"Mazdaqq Смерть и разложение Всадник без головы Hit -733 (Shadow)", -- [28]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -532 (Physical)", -- [29]
				"Mazdaqq Нечестивая порча (УЗВ) Всадник без головы Tick -60 (Shadow)", -- [30]
				"Mazdaqq Лик смерти Всадник без головы Crit -7498 (Shadow)", -- [31]
				"Mazdaqq Атака ближнего боя Всадник без головы Crit -5976 (Physical)", -- [32]
				"Mazdaqq Кровавая чума (УЗВ) Всадник без головы Tick -984 (Shadow)", -- [33]
				"Всадник без головы Атака ближнего боя Mazdaqq Hit -924 (Physical)", -- [34]
				"Mazdaqq Удар закаленным в крови клинком Всадник без головы Hit -1915 (Physical)", -- [35]
				"Mazdaqq Смерть и разложение Всадник без головы Hit -733 (Shadow)", -- [36]
				"Mazdaqq Некроз Всадник без головы Hit -1195 (Shadow)", -- [37]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -527 (Physical)", -- [38]
				"Mazdaqq Нечестивая порча (УЗВ) Всадник без головы Tick -98 (Shadow)", -- [39]
				"Mazdaqq Смерть и разложение Всадник без головы Hit -733 (Shadow)", -- [40]
				"Mazdaqq Озноб (УЗВ) Всадник без головы Tick -1258 (Frost)", -- [41]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Crit -1574 (Physical)", -- [42]
				"Mazdaqq Нечестивая порча (УЗВ) Всадник без головы Tick -98 (Shadow)", -- [43]
				"Mazdaqq Смерть и разложение Всадник без головы Hit -733 (Shadow)", -- [44]
				"Mazdaqq Атака ближнего боя Всадник без головы Hit -3105 (Physical)", -- [45]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -526 (Physical)", -- [46]
				"Всадник без головы Атака ближнего боя Mazdaqq Parry", -- [47]
				"Mazdaqq Некроз Всадник без головы Hit -621 (Shadow)", -- [48]
				"Mazdaqq Кровавая чума (УЗВ) Всадник без головы Tick -984 (Shadow)", -- [49]
				"Mazdaqq Нечестивая порча (УЗВ) Всадник без головы Tick -98 (Shadow)", -- [50]
			},
			["Name"] = "Всадник без головы",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				93551.387, -- [1]
				93551.38800000001, -- [2]
				93551.48700000001, -- [3]
				93551.625, -- [4]
				93551.82400000001, -- [5]
				93551.82400000001, -- [6]
				93552.228, -- [7]
				93552.22900000001, -- [8]
				93552.73, -- [9]
				93552.731, -- [10]
				93553.099, -- [11]
				93553.232, -- [12]
				93553.232, -- [13]
				93553.97100000001, -- [14]
				93554.072, -- [15]
				93554.17200000001, -- [16]
				93554.17200000001, -- [17]
				93554.644, -- [18]
				93555.18000000001, -- [19]
				93555.181, -- [20]
				93556.016, -- [21]
				93556.084, -- [22]
				93556.15000000001, -- [23]
				93557.121, -- [24]
				93558.09, -- [25]
				93559.129, -- [26]
				93546.692, -- [27]
				93547.231, -- [28]
				93547.5, -- [29]
				93547.5, -- [30]
				93547.73300000001, -- [31]
				93548.268, -- [32]
				93548.268, -- [33]
				93548.269, -- [34]
				93548.43700000001, -- [35]
				93548.43800000001, -- [36]
				93548.705, -- [37]
				93549.04000000001, -- [38]
				93549.14200000001, -- [39]
				93549.37700000001, -- [40]
				93549.677, -- [41]
				93549.978, -- [42]
				93550.079, -- [43]
				93550.44500000001, -- [44]
				93550.44500000001, -- [45]
				93550.54700000001, -- [46]
				93550.647, -- [47]
				93550.84700000001, -- [48]
				93551.18300000001, -- [49]
				93551.18400000001, -- [50]
			},
			["Fights"] = {
				["Fight1"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 378960,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 25,
								},
							},
							["amount"] = 41,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 22,
								},
								["Hit"] = {
									["count"] = 35,
								},
							},
							["amount"] = 70,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 15,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 24,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 33,
								},
								["Immune"] = {
									["count"] = 35,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 57,
								},
							},
							["amount"] = 129,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 14,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 14,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 3,
								},
							},
							["amount"] = 21,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 91711,
						["Melee"] = 126598,
						["Frost"] = 25677,
						["Shadow"] = 106493,
						["Nature"] = 28481,
					},
					["DOT_Time"] = 0,
					["Damage"] = 32341,
					["ElementTakenBlock"] = {
						["Physical"] = 120,
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 26743,
						["Physical"] = 5598,
					},
					["PartialAbsorb"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 70,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 26743,
								},
								["Колун всадника"] = {
									["count"] = 5164,
								},
							},
							["amount"] = 31907,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 434,
								},
							},
							["amount"] = 434,
						},
					},
					["PartialBlock"] = {
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["WhoDamaged"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1881,
								},
								["Смерть и разложение"] = {
									["count"] = 11513,
								},
								["Удар смерти"] = {
									["count"] = 8848,
								},
								["Бродячая чума"] = {
									["count"] = 14056,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1141,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 15601,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 19072,
								},
								["Кровавый удар"] = {
									["count"] = 26316,
								},
								["Атака ближнего боя"] = {
									["count"] = 101227,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 15157,
								},
								["Удар Плети"] = {
									["count"] = 28610,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 6199,
								},
								["Удар чумы"] = {
									["count"] = 5357,
								},
								["Ледяное прикосновение"] = {
									["count"] = 6605,
								},
								["Лик смерти"] = {
									["count"] = 28176,
								},
								["Некроз"] = {
									["count"] = 18968,
								},
							},
							["amount"] = 308727,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 25371,
								},
								["Цапнуть"] = {
									["count"] = 16381,
								},
							},
							["amount"] = 41752,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 28481,
								},
							},
							["amount"] = 28481,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 70,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 53.72000000000001,
								},
								["Колун всадника"] = {
									["count"] = 8.17,
								},
							},
							["amount"] = 61.89000000000002,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 61.89000000000002,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1614,
									["min"] = 924,
									["count"] = 14,
									["amount"] = 18963,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 2992,
									["min"] = 2024,
									["count"] = 3,
									["amount"] = 7780,
								},
								["Parry"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 26743,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1889,
									["min"] = 215,
									["count"] = 5,
									["amount"] = 5598,
								},
							},
							["count"] = 5,
							["amount"] = 5598,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 61.89000000000002,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 53.72000000000001,
								},
								["Колун всадника"] = {
									["count"] = 8.17,
								},
							},
							["amount"] = 61.89000000000002,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 378960,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 25,
								},
							},
							["amount"] = 41,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 22,
								},
								["Hit"] = {
									["count"] = 35,
								},
							},
							["amount"] = 70,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 15,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 24,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 33,
								},
								["Immune"] = {
									["count"] = 35,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 57,
								},
							},
							["amount"] = 129,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 14,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 14,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 3,
								},
							},
							["amount"] = 21,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 91711,
						["Melee"] = 126598,
						["Frost"] = 25677,
						["Shadow"] = 106493,
						["Nature"] = 28481,
					},
					["DOT_Time"] = 0,
					["Damage"] = 32341,
					["ElementTakenBlock"] = {
						["Physical"] = 120,
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 26743,
						["Physical"] = 5598,
					},
					["PartialAbsorb"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 70,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 26743,
								},
								["Колун всадника"] = {
									["count"] = 5164,
								},
							},
							["amount"] = 31907,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 434,
								},
							},
							["amount"] = 434,
						},
					},
					["PartialBlock"] = {
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
					},
					["WhoDamaged"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1881,
								},
								["Смерть и разложение"] = {
									["count"] = 11513,
								},
								["Удар смерти"] = {
									["count"] = 8848,
								},
								["Бродячая чума"] = {
									["count"] = 14056,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1141,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 15601,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 19072,
								},
								["Кровавый удар"] = {
									["count"] = 26316,
								},
								["Атака ближнего боя"] = {
									["count"] = 101227,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 15157,
								},
								["Удар Плети"] = {
									["count"] = 28610,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 6199,
								},
								["Удар чумы"] = {
									["count"] = 5357,
								},
								["Ледяное прикосновение"] = {
									["count"] = 6605,
								},
								["Лик смерти"] = {
									["count"] = 28176,
								},
								["Некроз"] = {
									["count"] = 18968,
								},
							},
							["amount"] = 308727,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 25371,
								},
								["Цапнуть"] = {
									["count"] = 16381,
								},
							},
							["amount"] = 41752,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 28481,
								},
							},
							["amount"] = 28481,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 70,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 53.72000000000001,
								},
								["Колун всадника"] = {
									["count"] = 8.17,
								},
							},
							["amount"] = 61.89000000000002,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 61.89000000000002,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1614,
									["min"] = 924,
									["count"] = 14,
									["amount"] = 18963,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 2992,
									["min"] = 2024,
									["count"] = 3,
									["amount"] = 7780,
								},
								["Parry"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 26743,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1889,
									["min"] = 215,
									["count"] = 5,
									["amount"] = 5598,
								},
							},
							["count"] = 5,
							["amount"] = 5598,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 61.89000000000002,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 53.72000000000001,
								},
								["Колун всадника"] = {
									["count"] = 8.17,
								},
							},
							["amount"] = 61.89000000000002,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialBlock"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 5,
									["amount"] = 200,
								},
							},
							["count"] = 5,
							["amount"] = 200,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 2,
									["amount"] = 80,
								},
							},
							["count"] = 2,
							["amount"] = 80,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Блокировано"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 74.88999999999999,
								},
								["Колун всадника"] = {
									["count"] = 8.41,
								},
								["Вихрь всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 83.29999999999998,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 31.87000000000001,
								},
								["Колун всадника"] = {
									["count"] = 2.38,
								},
								["Вихрь всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 37.75,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 1.07,
								},
								["Колун всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1.07,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 7.87,
								},
							},
							["amount"] = 7.87,
						},
					},
					["DamageTaken"] = 763378,
					["PartialResist"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 276,
									["amount"] = 0,
								},
							},
							["count"] = 276,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 31,
									["amount"] = 0,
								},
							},
							["count"] = 31,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 44,
									["amount"] = 0,
								},
							},
							["count"] = 44,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 42,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 41,
									["amount"] = 0,
								},
							},
							["count"] = 41,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 104,
									["amount"] = 0,
								},
							},
							["count"] = 104,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 276,
									["amount"] = 0,
								},
							},
							["count"] = 276,
							["amount"] = 0,
						},
						["Удар горгульи"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 31,
									["amount"] = 0,
								},
							},
							["count"] = 31,
							["amount"] = 0,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["Некроз"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 44,
									["amount"] = 0,
								},
							},
							["count"] = 44,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 42,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 41,
									["amount"] = 0,
								},
							},
							["count"] = 41,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 104,
									["amount"] = 0,
								},
							},
							["count"] = 104,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 129.99,
					["ElementTaken"] = {
						["Shadow"] = 200301,
						["Melee"] = 244252,
						["Frost"] = 55285,
						["Physical"] = 194405,
						["Nature"] = 69135,
					},
					["Damage"] = 75559,
					["ElementTakenBlock"] = {
						["Melee"] = 200,
						["Physical"] = 240,
					},
					["ElementDone"] = {
						["Melee"] = 65232,
						["Physical"] = 10327,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 70,
								},
								["Immune"] = {
									["count"] = 70,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 100,
								},
							},
							["amount"] = 246,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 20,
								},
								["Immune"] = {
									["count"] = 61,
								},
								["Crit"] = {
									["count"] = 38,
								},
								["Hit"] = {
									["count"] = 157,
								},
							},
							["amount"] = 276,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 29,
								},
								["Immune"] = {
									["count"] = 13,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 49,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 21,
								},
								["Crit"] = {
									["count"] = 25,
								},
								["Hit"] = {
									["count"] = 105,
								},
							},
							["amount"] = 151,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 22,
								},
							},
							["amount"] = 31,
						},
					},
					["DamagedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 32999,
								},
								["Колун всадника"] = {
									["count"] = 6793,
								},
								["Вихрь всадника"] = {
									["count"] = 525,
								},
							},
							["amount"] = 40317,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 32233,
								},
								["Колун всадника"] = {
									["count"] = 890,
								},
								["Вихрь всадника"] = {
									["count"] = 1253,
								},
							},
							["amount"] = 34376,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 140,
								},
								["Колун всадника"] = {
									["count"] = 434,
								},
							},
							["amount"] = 574,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 292,
								},
							},
							["amount"] = 292,
						},
					},
					["TimeDamage"] = 129.99,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 74.88999999999999,
								},
								["Колун всадника"] = {
									["count"] = 8.41,
								},
								["Вихрь всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 83.29999999999998,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 31.87000000000001,
								},
								["Колун всадника"] = {
									["count"] = 2.38,
								},
								["Вихрь всадника"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 37.75,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 1.07,
								},
								["Колун всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1.07,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 7.87,
								},
							},
							["amount"] = 7.87,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2736,
									["min"] = 924,
									["count"] = 28,
									["amount"] = 48044,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 4934,
									["min"] = 2024,
									["count"] = 5,
									["amount"] = 17188,
								},
								["Parry"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 43,
							["amount"] = 65232,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1889,
									["min"] = 215,
									["count"] = 9,
									["amount"] = 8117,
								},
							},
							["count"] = 9,
							["amount"] = 8117,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 525,
									["min"] = 65,
									["count"] = 20,
									["amount"] = 2210,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 2210,
						},
					},
					["WhoDamaged"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1881,
								},
								["Смерть и разложение"] = {
									["count"] = 13994,
								},
								["Удар смерти"] = {
									["count"] = 8848,
								},
								["Бродячая чума"] = {
									["count"] = 26842,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 33706,
								},
								["Удар Плети"] = {
									["count"] = 64132,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 38523,
								},
								["Кровавый удар"] = {
									["count"] = 55839,
								},
								["Атака ближнего боя"] = {
									["count"] = 193348,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 2027,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 31542,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 16974,
								},
								["Удар чумы"] = {
									["count"] = 11011,
								},
								["Ледяное прикосновение"] = {
									["count"] = 16762,
								},
								["Лик смерти"] = {
									["count"] = 52925,
								},
								["Некроз"] = {
									["count"] = 37384,
								},
							},
							["amount"] = 605738,
						},
						["Войско мертвых <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 13920,
								},
								["Цапнуть"] = {
									["count"] = 10644,
								},
							},
							["amount"] = 24564,
						},
						["Вороная горгулья <Mazdaqq>"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 69135,
								},
							},
							["amount"] = 69135,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 36984,
								},
								["Цапнуть"] = {
									["count"] = 26957,
								},
							},
							["amount"] = 63941,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 28,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 6,
								},
							},
							["amount"] = 43,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 29,
								},
							},
							["amount"] = 30,
						},
					},
				},
			},
			["UnitLockout"] = 1697820966,
			["LastActive"] = 1697820966,
		},
		["Дознаватель Вишас"] = {
			["GUID"] = "0xF130000F8F000030",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"5328 (100%)", -- [4]
				"5328 (100%)", -- [5]
				"5328 (100%)", -- [6]
				"5328 (100%)", -- [7]
				"1702 (31%)", -- [8]
				"1702 (31%)", -- [9]
				"1702 (31%)", -- [10]
				"984 (18%)", -- [11]
				"984 (18%)", -- [12]
				"984 (18%)", -- [13]
				"984 (18%)", -- [14]
				"2865 (100%)", -- [15]
				"2340 (43%)", -- [16]
				"2340 (43%)", -- [17]
				"2340 (43%)", -- [18]
				"2865 (100%)", -- [19]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"MISC", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"MISC", -- [19]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					15.06, -- [1]
				},
				["TimeDamage"] = {
					15.06, -- [1]
				},
				["DamageTaken"] = {
					15277, -- [1]
				},
				["Damage"] = {
					88, -- [1]
				},
			},
			["enClass"] = "MOB",
			["unit"] = "party1target",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
					},
					["Messages"] = {
						"Mazdaqq Ледяное прикосновение Дознаватель Вишас Crit -2988 (Frost)", -- [1]
						"Дознаватель Вишас Атака ближнего боя Mazdaqq Miss", -- [2]
						"Mazdaqq Атака ближнего боя Дознаватель Вишас Crit -6511 (Physical)", -- [3]
						"Дознаватель Вишас умирает.", -- [4]
					},
					["DeathAt"] = 1697820825,
					["HealthNum"] = {
						43.91891891891892, -- [1]
						43.91891891891892, -- [2]
						43.91891891891892, -- [3]
						100, -- [4]
					},
					["MessageTimes"] = {
						-0.5099999999947613, -- [1]
						-0.375, -- [2]
						-0.2740000000048894, -- [3]
						0, -- [4]
					},
					["KilledBy"] = "Mazdaqq",
					["Health"] = {
						"2340 (43%)", -- [1]
						"2340 (43%)", -- [2]
						"2340 (43%)", -- [3]
						"2865 (100%)", -- [4]
					},
					["EventNum"] = {
						56.08108108108108, -- [1]
						0, -- [2]
						122.2034534534535, -- [3]
						0, -- [4]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"MISC", -- [4]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
					},
					["Messages"] = {
						"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -25 (Physical)", -- [1]
						"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -12 (Physical)", -- [2]
						"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -25 (Physical)", -- [3]
						"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -26 (Physical)", -- [4]
						"Дознаватель Вишас Атака ближнего боя Mazdaqq Miss", -- [5]
						"Дознаватель Вишас Слово Тьмы: Боль Mazdaqq Miss (Shadow)", -- [6]
						"Limbmasher <Mazdaqq> Атака ближнего боя Дознаватель Вишас Crit -1422 (Physical)", -- [7]
						"Limbmasher <Mazdaqq> Цапнуть Дознаватель Вишас Crit -2204 (Physical)", -- [8]
						"Дознаватель Вишас Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [9]
						"Limbmasher <Mazdaqq> Атака ближнего боя Дознаватель Вишас Hit -718 (Physical)", -- [10]
						"Дознаватель Вишас Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [11]
						"Дознаватель Вишас Жертвенный огонь Mazdaqq Miss (Fire)", -- [12]
						"Дознаватель Вишас Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [13]
						"Limbmasher <Mazdaqq> Атака ближнего боя Дознаватель Вишас Crit -1434 (Physical)", -- [14]
						"Дознаватель Вишас умирает.", -- [15]
					},
					["DeathAt"] = 1697820498,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						100, -- [4]
						100, -- [5]
						100, -- [6]
						100, -- [7]
						31.94444444444444, -- [8]
						31.94444444444444, -- [9]
						31.94444444444444, -- [10]
						18.46846846846847, -- [11]
						18.46846846846847, -- [12]
						18.46846846846847, -- [13]
						18.46846846846847, -- [14]
						100, -- [15]
					},
					["MessageTimes"] = {
						-8.555999999996857, -- [1]
						-6.644000000000233, -- [2]
						-6.042000000001281, -- [3]
						-4.559999999997672, -- [4]
						-4.192999999999302, -- [5]
						-3.622000000003027, -- [6]
						-3.218999999997322, -- [7]
						-2.951000000000931, -- [8]
						-2.51600000000326, -- [9]
						-1.573000000003958, -- [10]
						-1.169999999998254, -- [11]
						-0.5040000000008149, -- [12]
						-0.5029999999969732, -- [13]
						-0.001000000003841706, -- [14]
						0, -- [15]
					},
					["KilledBy"] = "Limbmasher <Mazdaqq>",
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
						"???", -- [3]
						"5328 (100%)", -- [4]
						"5328 (100%)", -- [5]
						"5328 (100%)", -- [6]
						"5328 (100%)", -- [7]
						"1702 (31%)", -- [8]
						"1702 (31%)", -- [9]
						"1702 (31%)", -- [10]
						"984 (18%)", -- [11]
						"984 (18%)", -- [12]
						"984 (18%)", -- [13]
						"984 (18%)", -- [14]
						"2865 (100%)", -- [15]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						26.68918918918919, -- [7]
						41.36636636636636, -- [8]
						0, -- [9]
						13.47597597597598, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						26.91441441441441, -- [14]
						0, -- [15]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"MISC", -- [15]
					},
				}, -- [2]
			},
			["level"] = -1,
			["LastDamageAbility"] = "Атака ближнего боя",
			["LastFightIn"] = 10,
			["LastEventNum"] = {
				[10] = 13.47597597597598,
				[16] = 56.08108108108108,
				[7] = 26.68918918918919,
				[18] = 122.2034534534535,
				[8] = 41.36636636636636,
				[14] = 26.91441441441441,
			},
			["type"] = "Boss",
			["FightsSaved"] = 5,
			["LastDamageTaken"] = 6511,
			["TimeLast"] = {
				["DeathCount"] = 1697820823,
				["ActiveTime"] = 1697820823,
				["TimeDamage"] = 1697820823,
				["OVERALL"] = 1697820823,
				["DamageTaken"] = 1697820823,
				["Damage"] = 1697820491,
			},
			["Owner"] = false,
			["LastAbility"] = 93416.08,
			["NextEventNum"] = 20,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				31.94444444444444, -- [8]
				31.94444444444444, -- [9]
				31.94444444444444, -- [10]
				18.46846846846847, -- [11]
				18.46846846846847, -- [12]
				18.46846846846847, -- [13]
				18.46846846846847, -- [14]
				100, -- [15]
				43.91891891891892, -- [16]
				43.91891891891892, -- [17]
				43.91891891891892, -- [18]
				100, -- [19]
			},
			["LastEvents"] = {
				"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -25 (Physical)", -- [1]
				"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -12 (Physical)", -- [2]
				"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -25 (Physical)", -- [3]
				"Дознаватель Вишас Атака ближнего боя Mazdaqq Hit -26 (Physical)", -- [4]
				"Дознаватель Вишас Атака ближнего боя Mazdaqq Miss", -- [5]
				"Дознаватель Вишас Слово Тьмы: Боль Mazdaqq Miss (Shadow)", -- [6]
				"Limbmasher <Mazdaqq> Атака ближнего боя Дознаватель Вишас Crit -1422 (Physical)", -- [7]
				"Limbmasher <Mazdaqq> Цапнуть Дознаватель Вишас Crit -2204 (Physical)", -- [8]
				"Дознаватель Вишас Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [9]
				"Limbmasher <Mazdaqq> Атака ближнего боя Дознаватель Вишас Hit -718 (Physical)", -- [10]
				"Дознаватель Вишас Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [11]
				"Дознаватель Вишас Жертвенный огонь Mazdaqq Miss (Fire)", -- [12]
				"Дознаватель Вишас Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [13]
				"Limbmasher <Mazdaqq> Атака ближнего боя Дознаватель Вишас Crit -1434 (Physical)", -- [14]
				"Дознаватель Вишас умирает.", -- [15]
				"Mazdaqq Ледяное прикосновение Дознаватель Вишас Crit -2988 (Frost)", -- [16]
				"Дознаватель Вишас Атака ближнего боя Mazdaqq Miss", -- [17]
				"Mazdaqq Атака ближнего боя Дознаватель Вишас Crit -6511 (Physical)", -- [18]
				"Дознаватель Вишас умирает.", -- [19]
			},
			["Name"] = "Дознаватель Вишас",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
			},
			["LastEventTimes"] = {
				93080.796, -- [1]
				93082.708, -- [2]
				93083.31, -- [3]
				93084.792, -- [4]
				93085.159, -- [5]
				93085.73, -- [6]
				93086.133, -- [7]
				93086.401, -- [8]
				93086.836, -- [9]
				93087.779, -- [10]
				93088.182, -- [11]
				93088.848, -- [12]
				93088.849, -- [13]
				93089.351, -- [14]
				93089.352, -- [15]
				93415.94500000001, -- [16]
				93416.08, -- [17]
				93416.181, -- [18]
				93416.455, -- [19]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight4"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 9499,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 6511,
						["Frost"] = 2988,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6511,
								},
								["Ледяное прикосновение"] = {
									["count"] = 2988,
								},
							},
							["amount"] = 9499,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3.5,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 9,
						},
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 26,
									["min"] = 12,
									["count"] = 4,
									["amount"] = 88,
								},
							},
							["count"] = 9,
							["amount"] = 88,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Слово Тьмы: Боль"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.36,
								},
								["Жертвенный огонь"] = {
									["count"] = 0.67,
								},
								["Слово Тьмы: Боль"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 12.6,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.46,
								},
							},
							["amount"] = 2.46,
						},
					},
					["DamageTaken"] = 15277,
					["WhoDamaged"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6511,
								},
								["Ледяное прикосновение"] = {
									["count"] = 2988,
								},
							},
							["amount"] = 9499,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3574,
								},
								["Цапнуть"] = {
									["count"] = 2204,
								},
							},
							["amount"] = 5778,
						},
					},
					["ElementDone"] = {
						["Melee"] = 88,
					},
					["DeathCount"] = 2,
					["DamagedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 88,
								},
							},
							["amount"] = 88,
						},
					},
					["TimeDamage"] = 15.06,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.36,
								},
								["Жертвенный огонь"] = {
									["count"] = 0.67,
								},
								["Слово Тьмы: Боль"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 12.6,
						},
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2.46,
								},
							},
							["amount"] = 2.46,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 2204,
						["Melee"] = 10085,
						["Frost"] = 2988,
					},
					["ActiveTime"] = 15.06,
					["Damage"] = 88,
				},
			},
			["UnitLockout"] = 1697820823,
			["LastActive"] = 1697820823,
		},
		["Reyatsu"] = {
			["GUID"] = "0x07000000008AAD61",
			["LastEventHealth"] = {
				"930 (93%)", -- [1]
				"876 (87%)", -- [2]
				"1027 (100%)", -- [3]
			},
			["LastAttackedBy"] = "Истязатель из Алого ордена",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					217, -- [1]
				},
			},
			["enClass"] = "PRIEST",
			["unit"] = "Reyatsu",
			["level"] = 35,
			["LastDamageAbility"] = "Атака ближнего боя",
			["LastFightIn"] = 11,
			["LastEventNum"] = {
				6.720160481444333, -- [1]
				5.516549648946841, -- [2]
				9.250243427458617, -- [3]
			},
			["type"] = "Self",
			["FightsSaved"] = 5,
			["LastDamageTaken"] = 95,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 1697820838,
				["OVERALL"] = 1697820838,
			},
			["NextEventNum"] = 4,
			["LastEventHealthNum"] = {
				93.27983951855566, -- [1]
				87.86359077231695, -- [2]
				100, -- [3]
			},
			["LastEvents"] = {
				"Разведчик Алого ордена Выстрел Reyatsu Hit -67 (Physical)", -- [1]
				"Разведчик Алого ордена Выстрел Reyatsu Hit -55 (Physical)", -- [2]
				"Истязатель из Алого ордена Атака ближнего боя Reyatsu Hit -95 (Physical)", -- [3]
			},
			["Name"] = "Reyatsu",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
			},
			["LastEventTimes"] = {
				93019.785, -- [1]
				93023.39600000001, -- [2]
				93431.011, -- [3]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight3"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 95,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 95,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 95,
								},
							},
							["amount"] = 95,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Выстрел"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Разведчик Алого ордена"] = {
							["Details"] = {
								["Выстрел"] = {
									["count"] = 122,
								},
							},
							["amount"] = 122,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 95,
								},
							},
							["amount"] = 95,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 95,
						["Physical"] = 122,
					},
					["DamageTaken"] = 217,
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 1697820426,
			["LastActive"] = 1697820838,
		},
		["Войско мертвых <Mazdaqq>"] = {
			["GUID"] = "0xF130005E8F000091",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"???", -- [4]
				"???", -- [5]
				"???", -- [6]
				"???", -- [7]
				"???", -- [8]
				"???", -- [9]
				"???", -- [10]
				"???", -- [11]
				"???", -- [12]
				"???", -- [13]
				"???", -- [14]
				"???", -- [15]
				"???", -- [16]
				"???", -- [17]
				"???", -- [18]
				"???", -- [19]
				"???", -- [20]
				"???", -- [21]
				"???", -- [22]
				"???", -- [23]
				"???", -- [24]
				"???", -- [25]
				"???", -- [26]
				"???", -- [27]
				"???", -- [28]
				"???", -- [29]
				"???", -- [30]
				"???", -- [31]
				"???", -- [32]
				"???", -- [33]
				"???", -- [34]
				"???", -- [35]
				"???", -- [36]
				"???", -- [37]
				"???", -- [38]
				"???", -- [39]
				"???", -- [40]
				"???", -- [41]
				"???", -- [42]
				"???", -- [43]
				"???", -- [44]
				"???", -- [45]
				"???", -- [46]
				"???", -- [47]
				"???", -- [48]
				"???", -- [49]
				"???", -- [50]
			},
			["LastAttackedBy"] = "Всадник без головы",
			["LastEventType"] = {
				"MISC", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"MISC", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					3, -- [1]
				},
				["ActiveTime"] = {
					40.52000000000004, -- [1]
				},
				["TimeDamage"] = {
					40.52000000000004, -- [1]
				},
				["DamageTaken"] = {
					34376, -- [1]
				},
				["Damage"] = {
					24564, -- [1]
				},
			},
			["enClass"] = "PET",
			["LastDamageTaken"] = 2477,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						false, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						false, -- [19]
						false, -- [20]
						false, -- [21]
						false, -- [22]
						false, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						false, -- [29]
						false, -- [30]
						false, -- [31]
						false, -- [32]
						false, -- [33]
						false, -- [34]
						false, -- [35]
						false, -- [36]
						false, -- [37]
						false, -- [38]
						false, -- [39]
						true, -- [40]
						false, -- [41]
						true, -- [42]
						false, -- [43]
						false, -- [44]
						false, -- [45]
						false, -- [46]
						false, -- [47]
						false, -- [48]
						false, -- [49]
						false, -- [50]
					},
					["Messages"] = {
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -123 (Physical)", -- [1]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -109 (Physical)", -- [2]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -126 (Physical)", -- [3]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -117 (Physical)", -- [4]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -173 (Physical)", -- [5]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -171 (Physical)", -- [6]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [7]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [8]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [9]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Dodge", -- [10]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -185 (Physical)", -- [11]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -85 (Physical)", -- [12]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [13]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -187 (Physical)", -- [14]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [15]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -128 (Physical)", -- [16]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -176 (Physical)", -- [17]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -121 (Physical)", -- [18]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -129 (Physical)", -- [19]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [20]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -188 (Physical)", -- [21]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -108 (Physical)", -- [22]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -121 (Physical)", -- [23]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [24]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -130 (Physical)", -- [25]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Crit -4934 (Physical)", -- [26]
						"Войско мертвых <Mazdaqq> умирает.", -- [27]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -188 (Physical)", -- [28]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -126 (Physical)", -- [29]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [30]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [31]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -163 (Physical)", -- [32]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [33]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -120 (Physical)", -- [34]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -196 (Physical)", -- [35]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -116 (Physical)", -- [36]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -252 (Physical)", -- [37]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -198 (Physical)", -- [38]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [39]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Hit -2582 (Physical)", -- [40]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -110 (Physical)", -- [41]
						"Войско мертвых <Mazdaqq> умирает.", -- [42]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -109 (Physical)", -- [43]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -124 (Physical)", -- [44]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -109 (Physical)", -- [45]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -163 (Physical)", -- [46]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -187 (Physical)", -- [47]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -183 (Physical)", -- [48]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -115 (Physical)", -- [49]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -132 (Physical)", -- [50]
					},
					["DeathAt"] = 1697820611,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-6.028999999994994, -- [1]
						-5.927999999999884, -- [2]
						-5.927999999999884, -- [3]
						-5.794999999998254, -- [4]
						-5.592999999993481, -- [5]
						-5.592999999993481, -- [6]
						-5.323999999993248, -- [7]
						-4.985999999989872, -- [8]
						-4.885999999998603, -- [9]
						-4.782999999995809, -- [10]
						-4.649999999994179, -- [11]
						-4.381999999997788, -- [12]
						-4.381999999997788, -- [13]
						-4.381999999997788, -- [14]
						-4.281999999991967, -- [15]
						-4.281999999991967, -- [16]
						-3.849999999991269, -- [17]
						-3.715999999985797, -- [18]
						-3.377999999996973, -- [19]
						-3.243999999991502, -- [20]
						-2.977999999988242, -- [21]
						-2.845999999990454, -- [22]
						-2.745999999999185, -- [23]
						-2.745999999999185, -- [24]
						-2.678999999989173, -- [25]
						-2.411999999996624, -- [26]
						-2.410999999992782, -- [27]
						-2.1759999999922, -- [28]
						-2.1759999999922, -- [29]
						-1.807999999989988, -- [30]
						-1.6759999999922, -- [31]
						-1.406999999991967, -- [32]
						-1.139999999999418, -- [33]
						-1.139999999999418, -- [34]
						-1.138999999995576, -- [35]
						-1.138999999995576, -- [36]
						-0.536999999996624, -- [37]
						-0.4019999999873107, -- [38]
						-0.1349999999947613, -- [39]
						-0.0009999999892897904, -- [40]
						-0.0009999999892897904, -- [41]
						0, -- [42]
						0.5360000000073342, -- [43]
						0.5370000000111759, -- [44]
						0.9040000000095461, -- [45]
						1.005000000004657, -- [46]
						1.006000000008498, -- [47]
						1.006000000008498, -- [48]
						1.373000000006869, -- [49]
						1.474000000001979, -- [50]
					},
					["KilledBy"] = "Всадник без головы",
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
						"???", -- [3]
						"???", -- [4]
						"???", -- [5]
						"???", -- [6]
						"???", -- [7]
						"???", -- [8]
						"???", -- [9]
						"???", -- [10]
						"???", -- [11]
						"???", -- [12]
						"???", -- [13]
						"???", -- [14]
						"???", -- [15]
						"???", -- [16]
						"???", -- [17]
						"???", -- [18]
						"???", -- [19]
						"???", -- [20]
						"???", -- [21]
						"???", -- [22]
						"???", -- [23]
						"???", -- [24]
						"???", -- [25]
						"???", -- [26]
						"???", -- [27]
						"???", -- [28]
						"???", -- [29]
						"???", -- [30]
						"???", -- [31]
						"???", -- [32]
						"???", -- [33]
						"???", -- [34]
						"???", -- [35]
						"???", -- [36]
						"???", -- [37]
						"???", -- [38]
						"???", -- [39]
						"???", -- [40]
						"???", -- [41]
						"???", -- [42]
						"???", -- [43]
						"???", -- [44]
						"???", -- [45]
						"???", -- [46]
						"???", -- [47]
						"???", -- [48]
						"???", -- [49]
						"???", -- [50]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"MISC", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"MISC", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"DAMAGE", -- [50]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						false, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						false, -- [19]
						false, -- [20]
						false, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						false, -- [26]
						false, -- [27]
						false, -- [28]
						false, -- [29]
						false, -- [30]
						false, -- [31]
						false, -- [32]
						false, -- [33]
						false, -- [34]
						false, -- [35]
						false, -- [36]
						false, -- [37]
						false, -- [38]
						true, -- [39]
						true, -- [40]
						false, -- [41]
						false, -- [42]
						false, -- [43]
						false, -- [44]
						false, -- [45]
						false, -- [46]
						false, -- [47]
						false, -- [48]
						false, -- [49]
						false, -- [50]
					},
					["Messages"] = {
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [1]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -166 (Physical)", -- [2]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -111 (Physical)", -- [3]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [4]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [5]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [6]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [7]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -173 (Physical)", -- [8]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -125 (Physical)", -- [9]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Hit -2388 (Physical)", -- [10]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -128 (Physical)", -- [11]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -122 (Physical)", -- [12]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -176 (Physical)", -- [13]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -123 (Physical)", -- [14]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -109 (Physical)", -- [15]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -126 (Physical)", -- [16]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -117 (Physical)", -- [17]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -173 (Physical)", -- [18]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -171 (Physical)", -- [19]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [20]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [21]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [22]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Dodge", -- [23]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -185 (Physical)", -- [24]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -85 (Physical)", -- [25]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [26]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -187 (Physical)", -- [27]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [28]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -128 (Physical)", -- [29]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -176 (Physical)", -- [30]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -121 (Physical)", -- [31]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -129 (Physical)", -- [32]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [33]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -188 (Physical)", -- [34]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -108 (Physical)", -- [35]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -121 (Physical)", -- [36]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [37]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -130 (Physical)", -- [38]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Crit -4934 (Physical)", -- [39]
						"Войско мертвых <Mazdaqq> умирает.", -- [40]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -188 (Physical)", -- [41]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -126 (Physical)", -- [42]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [43]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [44]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -163 (Physical)", -- [45]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [46]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -120 (Physical)", -- [47]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -196 (Physical)", -- [48]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -116 (Physical)", -- [49]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -252 (Physical)", -- [50]
					},
					["DeathAt"] = 1697820608,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-5.668000000005122, -- [1]
						-5.668000000005122, -- [2]
						-5.532000000006519, -- [3]
						-5.163000000000466, -- [4]
						-5.029999999998836, -- [5]
						-5.028999999994994, -- [6]
						-5.028999999994994, -- [7]
						-4.927999999999884, -- [8]
						-4.561000000001513, -- [9]
						-4.327000000004773, -- [10]
						-4.054999999993015, -- [11]
						-4.054000000003725, -- [12]
						-3.619000000006054, -- [13]
						-3.618000000002212, -- [14]
						-3.517000000007101, -- [15]
						-3.517000000007101, -- [16]
						-3.384000000005472, -- [17]
						-3.182000000000699, -- [18]
						-3.182000000000699, -- [19]
						-2.913000000000466, -- [20]
						-2.57499999999709, -- [21]
						-2.475000000005821, -- [22]
						-2.372000000003027, -- [23]
						-2.239000000001397, -- [24]
						-1.971000000005006, -- [25]
						-1.971000000005006, -- [26]
						-1.971000000005006, -- [27]
						-1.870999999999185, -- [28]
						-1.870999999999185, -- [29]
						-1.438999999998487, -- [30]
						-1.304999999993015, -- [31]
						-0.967000000004191, -- [32]
						-0.8329999999987194, -- [33]
						-0.5669999999954598, -- [34]
						-0.4349999999976717, -- [35]
						-0.3350000000064028, -- [36]
						-0.3350000000064028, -- [37]
						-0.2679999999963911, -- [38]
						-0.001000000003841706, -- [39]
						0, -- [40]
						0.2350000000005821, -- [41]
						0.2350000000005821, -- [42]
						0.603000000002794, -- [43]
						0.7350000000005821, -- [44]
						1.004000000000815, -- [45]
						1.270999999993364, -- [46]
						1.270999999993364, -- [47]
						1.271999999997206, -- [48]
						1.271999999997206, -- [49]
						1.873999999996158, -- [50]
					},
					["KilledBy"] = "Всадник без головы",
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
						"???", -- [3]
						"???", -- [4]
						"???", -- [5]
						"???", -- [6]
						"???", -- [7]
						"???", -- [8]
						"???", -- [9]
						"???", -- [10]
						"???", -- [11]
						"???", -- [12]
						"???", -- [13]
						"???", -- [14]
						"???", -- [15]
						"???", -- [16]
						"???", -- [17]
						"???", -- [18]
						"???", -- [19]
						"???", -- [20]
						"???", -- [21]
						"???", -- [22]
						"???", -- [23]
						"???", -- [24]
						"???", -- [25]
						"???", -- [26]
						"???", -- [27]
						"???", -- [28]
						"???", -- [29]
						"???", -- [30]
						"???", -- [31]
						"???", -- [32]
						"???", -- [33]
						"???", -- [34]
						"???", -- [35]
						"???", -- [36]
						"???", -- [37]
						"???", -- [38]
						"???", -- [39]
						"???", -- [40]
						"???", -- [41]
						"???", -- [42]
						"???", -- [43]
						"???", -- [44]
						"???", -- [45]
						"???", -- [46]
						"???", -- [47]
						"???", -- [48]
						"???", -- [49]
						"???", -- [50]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"MISC", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"DAMAGE", -- [50]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						false, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						false, -- [19]
						false, -- [20]
						false, -- [21]
						false, -- [22]
						false, -- [23]
						false, -- [24]
						false, -- [25]
						false, -- [26]
						false, -- [27]
						false, -- [28]
						false, -- [29]
						true, -- [30]
						false, -- [31]
						false, -- [32]
						false, -- [33]
						false, -- [34]
						true, -- [35]
						false, -- [36]
						true, -- [37]
						false, -- [38]
						false, -- [39]
						false, -- [40]
						false, -- [41]
						false, -- [42]
						false, -- [43]
						false, -- [44]
						false, -- [45]
						false, -- [46]
						true, -- [47]
						false, -- [48]
						false, -- [49]
						false, -- [50]
					},
					["Messages"] = {
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -125 (Physical)", -- [1]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -119 (Physical)", -- [2]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [3]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -190 (Physical)", -- [4]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -132 (Physical)", -- [5]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -193 (Physical)", -- [6]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -116 (Physical)", -- [7]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -165 (Physical)", -- [8]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -116 (Physical)", -- [9]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -117 (Physical)", -- [10]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [11]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -122 (Physical)", -- [12]
						"Тоскующий мертвец Атака ближнего боя Войско мертвых <Mazdaqq> Miss", -- [13]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -120 (Physical)", -- [14]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -125 (Physical)", -- [15]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Hit -2594 (Physical)", -- [16]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -134 (Physical)", -- [17]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -171 (Physical)", -- [18]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -109 (Physical)", -- [19]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -224 (Physical)", -- [20]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Crit -348 (Physical)", -- [21]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -179 (Physical)", -- [22]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -129 (Physical)", -- [23]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [24]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -129 (Physical)", -- [25]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -194 (Physical)", -- [26]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -131 (Physical)", -- [27]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -108 (Physical)", -- [28]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -123 (Physical)", -- [29]
						"Тоскующий мертвец Атака ближнего боя Войско мертвых <Mazdaqq> Miss", -- [30]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -165 (Physical)", -- [31]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -127 (Physical)", -- [32]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -114 (Physical)", -- [33]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -224 (Physical)", -- [34]
						"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Crit -4474 (Physical)", -- [35]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -124 (Physical)", -- [36]
						"Войско мертвых <Mazdaqq> умирает.", -- [37]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -111 (Physical)", -- [38]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -193 (Physical)", -- [39]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -218 (Physical)", -- [40]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -196 (Physical)", -- [41]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [42]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [43]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -169 (Physical)", -- [44]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [45]
						"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -176 (Physical)", -- [46]
						"Тоскующий мертвец Атака ближнего боя Войско мертвых <Mazdaqq> Miss", -- [47]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -125 (Physical)", -- [48]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -128 (Physical)", -- [49]
						"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -80 (Physical)", -- [50]
					},
					["DeathAt"] = 1697820588,
					["HealthNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-4.282999999995809, -- [1]
						-4.282999999995809, -- [2]
						-4.149000000004889, -- [3]
						-4.014999999999418, -- [4]
						-3.747000000003027, -- [5]
						-3.747000000003027, -- [6]
						-3.580000000001746, -- [7]
						-3.513999999995576, -- [8]
						-3.179999999993015, -- [9]
						-3.179999999993015, -- [10]
						-3.081000000005588, -- [11]
						-2.711999999999534, -- [12]
						-2.578999999997905, -- [13]
						-2.578999999997905, -- [14]
						-2.577999999994063, -- [15]
						-2.411999999996624, -- [16]
						-2.213000000003376, -- [17]
						-2.110000000000582, -- [18]
						-2.110000000000582, -- [19]
						-1.975999999995111, -- [20]
						-1.807000000000699, -- [21]
						-1.807000000000699, -- [22]
						-1.707999999998719, -- [23]
						-1.607000000003609, -- [24]
						-1.607000000003609, -- [25]
						-1.605999999999767, -- [26]
						-1.139999999999418, -- [27]
						-1.005000000004657, -- [28]
						-1.004000000000815, -- [29]
						-0.6009999999951106, -- [30]
						-0.5010000000038417, -- [31]
						-0.5, -- [32]
						-0.5, -- [33]
						-0.1340000000054715, -- [34]
						-0.001000000003841706, -- [35]
						-0.001000000003841706, -- [36]
						0, -- [37]
						0.1680000000051223, -- [38]
						0.2679999999963911, -- [39]
						0.4009999999980209, -- [40]
						0.467000000004191, -- [41]
						0.467000000004191, -- [42]
						0.6000000000058208, -- [43]
						1.001000000003842, -- [44]
						1.069000000003143, -- [45]
						1.202000000004773, -- [46]
						1.470000000001164, -- [47]
						1.471000000005006, -- [48]
						1.572000000000116, -- [49]
						1.706000000005588, -- [50]
					},
					["KilledBy"] = "Всадник без головы",
					["Health"] = {
						"???", -- [1]
						"???", -- [2]
						"???", -- [3]
						"???", -- [4]
						"???", -- [5]
						"???", -- [6]
						"???", -- [7]
						"???", -- [8]
						"???", -- [9]
						"???", -- [10]
						"???", -- [11]
						"???", -- [12]
						"???", -- [13]
						"???", -- [14]
						"???", -- [15]
						"???", -- [16]
						"???", -- [17]
						"???", -- [18]
						"???", -- [19]
						"???", -- [20]
						"???", -- [21]
						"???", -- [22]
						"???", -- [23]
						"???", -- [24]
						"???", -- [25]
						"???", -- [26]
						"???", -- [27]
						"???", -- [28]
						"???", -- [29]
						"???", -- [30]
						"???", -- [31]
						"???", -- [32]
						"???", -- [33]
						"???", -- [34]
						"???", -- [35]
						"???", -- [36]
						"???", -- [37]
						"???", -- [38]
						"???", -- [39]
						"???", -- [40]
						"???", -- [41]
						"???", -- [42]
						"???", -- [43]
						"???", -- [44]
						"???", -- [45]
						"???", -- [46]
						"???", -- [47]
						"???", -- [48]
						"???", -- [49]
						"???", -- [50]
					},
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"MISC", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"DAMAGE", -- [50]
					},
				}, -- [3]
			},
			["level"] = 1,
			["LastDamageAbility"] = "Атака ближнего боя",
			["LastFightIn"] = 4,
			["type"] = "Pet",
			["FightsSaved"] = 5,
			["LastAbility"] = 93207.571,
			["Owner"] = "Mazdaqq",
			["TimeLast"] = {
				["DeathCount"] = 1697820609,
				["ActiveTime"] = 1697820614,
				["TimeDamage"] = 1697820614,
				["OVERALL"] = 1697820614,
				["DamageTaken"] = 1697820611,
				["Damage"] = 1697820614,
			},
			["NextEventNum"] = 21,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				0, -- [4]
				0, -- [5]
				0, -- [6]
				0, -- [7]
				0, -- [8]
				0, -- [9]
				0, -- [10]
				0, -- [11]
				0, -- [12]
				0, -- [13]
				0, -- [14]
				0, -- [15]
				0, -- [16]
				0, -- [17]
				0, -- [18]
				0, -- [19]
				0, -- [20]
				0, -- [21]
				0, -- [22]
				0, -- [23]
				0, -- [24]
				0, -- [25]
				0, -- [26]
				0, -- [27]
				0, -- [28]
				0, -- [29]
				0, -- [30]
				0, -- [31]
				0, -- [32]
				0, -- [33]
				0, -- [34]
				0, -- [35]
				0, -- [36]
				0, -- [37]
				0, -- [38]
				0, -- [39]
				0, -- [40]
				0, -- [41]
				0, -- [42]
				0, -- [43]
				0, -- [44]
				0, -- [45]
				0, -- [46]
				0, -- [47]
				0, -- [48]
				0, -- [49]
				0, -- [50]
			},
			["LastEvents"] = {
				"Войско мертвых <Mazdaqq> умирает.", -- [1]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -109 (Physical)", -- [2]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -124 (Physical)", -- [3]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -109 (Physical)", -- [4]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -163 (Physical)", -- [5]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -187 (Physical)", -- [6]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -183 (Physical)", -- [7]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -115 (Physical)", -- [8]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -132 (Physical)", -- [9]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [10]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -112 (Physical)", -- [11]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -185 (Physical)", -- [12]
				"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Hit -2477 (Physical)", -- [13]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -115 (Physical)", -- [14]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -228 (Physical)", -- [15]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -180 (Physical)", -- [16]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -125 (Physical)", -- [17]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [18]
				"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Dodge", -- [19]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -176 (Physical)", -- [20]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -85 (Physical)", -- [21]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [22]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -187 (Physical)", -- [23]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [24]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -128 (Physical)", -- [25]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -176 (Physical)", -- [26]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -121 (Physical)", -- [27]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -129 (Physical)", -- [28]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [29]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -188 (Physical)", -- [30]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -108 (Physical)", -- [31]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -121 (Physical)", -- [32]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -126 (Physical)", -- [33]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -130 (Physical)", -- [34]
				"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Crit -4934 (Physical)", -- [35]
				"Войско мертвых <Mazdaqq> умирает.", -- [36]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -188 (Physical)", -- [37]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -126 (Physical)", -- [38]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -113 (Physical)", -- [39]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [40]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -163 (Physical)", -- [41]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -114 (Physical)", -- [42]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -120 (Physical)", -- [43]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -196 (Physical)", -- [44]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Glancing -116 (Physical)", -- [45]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Crit -252 (Physical)", -- [46]
				"Войско мертвых <Mazdaqq> Цапнуть Всадник без головы Hit -198 (Physical)", -- [47]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -118 (Physical)", -- [48]
				"Всадник без головы Атака ближнего боя Войско мертвых <Mazdaqq> Hit -2582 (Physical)", -- [49]
				"Войско мертвых <Mazdaqq> Атака ближнего боя Всадник без головы Hit -110 (Physical)", -- [50]
			},
			["Name"] = "Войско мертвых",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				93202.654, -- [1]
				93203.19, -- [2]
				93203.19100000001, -- [3]
				93203.55800000001, -- [4]
				93203.659, -- [5]
				93203.66, -- [6]
				93203.66, -- [7]
				93204.027, -- [8]
				93204.128, -- [9]
				93204.697, -- [10]
				93204.697, -- [11]
				93204.929, -- [12]
				93205.02800000001, -- [13]
				93205.23, -- [14]
				93205.731, -- [15]
				93205.931, -- [16]
				93206.269, -- [17]
				93206.902, -- [18]
				93207.36900000001, -- [19]
				93207.571, -- [20]
				93198.272, -- [21]
				93198.272, -- [22]
				93198.272, -- [23]
				93198.372, -- [24]
				93198.372, -- [25]
				93198.804, -- [26]
				93198.93800000001, -- [27]
				93199.276, -- [28]
				93199.41, -- [29]
				93199.67600000001, -- [30]
				93199.80800000001, -- [31]
				93199.908, -- [32]
				93199.908, -- [33]
				93199.97500000001, -- [34]
				93200.242, -- [35]
				93200.243, -- [36]
				93200.478, -- [37]
				93200.478, -- [38]
				93200.84600000001, -- [39]
				93200.978, -- [40]
				93201.247, -- [41]
				93201.514, -- [42]
				93201.514, -- [43]
				93201.515, -- [44]
				93201.515, -- [45]
				93202.117, -- [46]
				93202.25200000001, -- [47]
				93202.519, -- [48]
				93202.65300000001, -- [49]
				93202.65300000001, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 200,
						["Physical"] = 80,
					},
					["TimeSpent"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.69000000000001,
								},
								["Цапнуть"] = {
									["count"] = 11.83,
								},
							},
							["amount"] = 40.52000000000004,
						},
					},
					["DamageTaken"] = 34376,
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 0,
								},
							},
							["count"] = 24,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DeathCount"] = 3,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 0,
								},
							},
							["count"] = 24,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 40.52000000000004,
					["ElementTaken"] = {
						["Melee"] = 32233,
						["Physical"] = 2143,
					},
					["Damage"] = 24564,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 132,
									["min"] = 108,
									["count"] = 10,
									["amount"] = 1214,
								},
								["Immune"] = {
									["count"] = 38,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 85,
									["min"] = 68,
									["count"] = 5,
									["amount"] = 385,
								},
								["Hit"] = {
									["max"] = 132,
									["min"] = 108,
									["count"] = 94,
									["amount"] = 11175,
								},
								["Crit"] = {
									["max"] = 252,
									["min"] = 218,
									["count"] = 5,
									["amount"] = 1146,
								},
							},
							["count"] = 152,
							["amount"] = 13920,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 150,
									["min"] = 134,
									["count"] = 2,
									["amount"] = 284,
								},
								["Immune"] = {
									["count"] = 15,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 348,
									["min"] = 332,
									["count"] = 2,
									["amount"] = 680,
								},
								["Hit"] = {
									["max"] = 198,
									["min"] = 163,
									["count"] = 54,
									["amount"] = 9680,
								},
							},
							["count"] = 73,
							["amount"] = 10644,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 10,
								},
								["Immune"] = {
									["count"] = 38,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 99,
								},
							},
							["amount"] = 152,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 15,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 56,
								},
							},
							["amount"] = 73,
						},
					},
					["DamagedWho"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 13920,
								},
								["Цапнуть"] = {
									["count"] = 10644,
								},
							},
							["amount"] = 24564,
						},
					},
					["TimeDamage"] = 40.52000000000004,
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 32233,
								},
								["Колун всадника"] = {
									["count"] = 890,
								},
								["Вихрь всадника"] = {
									["count"] = 1253,
								},
							},
							["amount"] = 34376,
						},
					},
					["ElementDone"] = {
						["Melee"] = 13920,
						["Physical"] = 10644,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 17,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 11,
								},
							},
							["amount"] = 24,
						},
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamaging"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 28.69000000000001,
								},
								["Цапнуть"] = {
									["count"] = 11.83,
								},
							},
							["amount"] = 40.52000000000004,
						},
					},
				},
			},
			["UnitLockout"] = 1697820614,
			["LastActive"] = 1697820614,
		},
		["Вороная горгулья <Mazdaqq>"] = {
			["GUID"] = "0xF130006CB500008C",
			["LastEventHealth"] = {
				"???", -- [1]
				"???", -- [2]
				"???", -- [3]
				"???", -- [4]
				"???", -- [5]
				"???", -- [6]
				"???", -- [7]
				"???", -- [8]
				"???", -- [9]
				"???", -- [10]
				"???", -- [11]
				"???", -- [12]
				"???", -- [13]
				"???", -- [14]
				"???", -- [15]
				"???", -- [16]
				"???", -- [17]
				"???", -- [18]
				"???", -- [19]
				"???", -- [20]
				"???", -- [21]
				"???", -- [22]
				"???", -- [23]
				"???", -- [24]
				"???", -- [25]
				"???", -- [26]
				"???", -- [27]
				"???", -- [28]
				"???", -- [29]
				"???", -- [30]
				"???", -- [31]
				"???", -- [32]
				"???", -- [33]
				"???", -- [34]
				"???", -- [35]
				"???", -- [36]
			},
			["LastAttackedBy"] = "Всадник без головы",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					51.28, -- [1]
				},
				["Damage"] = {
					72055, -- [1]
				},
				["DamageTaken"] = {
					574, -- [1]
				},
				["ActiveTime"] = {
					51.28, -- [1]
				},
			},
			["enClass"] = "PET",
			["LastDamageTaken"] = 215,
			["level"] = 1,
			["LastDamageAbility"] = "Колун всадника",
			["LastFightIn"] = 13,
			["LastFlags"] = 4370,
			["type"] = "Pet",
			["FightsSaved"] = 5,
			["TimeLast"] = {
				["ActiveTime"] = 1697820919,
				["TimeDamage"] = 1697820919,
				["OVERALL"] = 1697820919,
				["DamageTaken"] = 1697820901,
				["Damage"] = 1697820919,
			},
			["Owner"] = "Mazdaqq",
			["LastAbility"] = 93512.682,
			["NextEventNum"] = 37,
			["LastEventHealthNum"] = {
				0, -- [1]
				0, -- [2]
				0, -- [3]
				0, -- [4]
				0, -- [5]
				0, -- [6]
				0, -- [7]
				0, -- [8]
				0, -- [9]
				0, -- [10]
				0, -- [11]
				0, -- [12]
				0, -- [13]
				0, -- [14]
				0, -- [15]
				0, -- [16]
				0, -- [17]
				0, -- [18]
				0, -- [19]
				0, -- [20]
				0, -- [21]
				0, -- [22]
				0, -- [23]
				0, -- [24]
				0, -- [25]
				0, -- [26]
				0, -- [27]
				0, -- [28]
				0, -- [29]
				0, -- [30]
				0, -- [31]
				0, -- [32]
				0, -- [33]
				0, -- [34]
				0, -- [35]
				0, -- [36]
			},
			["LastEvents"] = {
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3443 (Nature)", -- [1]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3457 (Nature)", -- [2]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3446 (Nature)", -- [3]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3467 (Nature)", -- [4]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3437 (Nature)", -- [5]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3456 (Nature)", -- [6]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3463 (Nature)", -- [7]
				"Всадник без головы Вихрь всадника Вороная горгулья <Mazdaqq> Hit -65 (Physical)", -- [8]
				"Всадник без головы Вихрь всадника Вороная горгулья <Mazdaqq> Hit -75 (Physical)", -- [9]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3061 (Nature)", -- [10]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3060 (Nature)", -- [11]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3463 (Nature)", -- [12]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3454 (Nature)", -- [13]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -3447 (Nature)", -- [14]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [15]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [16]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [17]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [18]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [19]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2908 (Nature)", -- [20]
				"Всадник без головы Колун всадника Вороная горгулья <Mazdaqq> Hit -219 (Physical)", -- [21]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2899 (Nature)", -- [22]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2904 (Nature)", -- [23]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2928 (Nature)", -- [24]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2937 (Nature)", -- [25]
				"Всадник без головы Колун всадника Вороная горгулья <Mazdaqq> Hit -215 (Physical)", -- [26]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2923 (Nature)", -- [27]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [28]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [29]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [30]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Immune (Nature)", -- [31]
				"Вороная горгулья <Mazdaqq> Удар горгульи Голова Всадника Hit -2920 (Nature)", -- [32]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2582 (Nature)", -- [33]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2572 (Nature)", -- [34]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2912 (Nature)", -- [35]
				"Вороная горгулья <Mazdaqq> Удар горгульи Всадник без головы Hit -2916 (Nature)", -- [36]
			},
			["Name"] = "Вороная горгулья",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
			},
			["LastEventTimes"] = {
				93174.736, -- [1]
				93176.00900000001, -- [2]
				93177.88100000001, -- [3]
				93179.489, -- [4]
				93181.02400000001, -- [5]
				93182.86500000001, -- [6]
				93184.477, -- [7]
				93192.25600000001, -- [8]
				93193.33100000001, -- [9]
				93194.575, -- [10]
				93196.18700000001, -- [11]
				93197.87, -- [12]
				93199.41, -- [13]
				93201.08, -- [14]
				93203.22500000001, -- [15]
				93203.22500000001, -- [16]
				93203.22500000001, -- [17]
				93203.22500000001, -- [18]
				93203.226, -- [19]
				93487.01300000001, -- [20]
				93487.68300000001, -- [21]
				93488.556, -- [22]
				93490.295, -- [23]
				93491.80800000001, -- [24]
				93493.65300000001, -- [25]
				93494.931, -- [26]
				93495.198, -- [27]
				93497.039, -- [28]
				93503.82400000001, -- [29]
				93503.825, -- [30]
				93503.825, -- [31]
				93504.66100000001, -- [32]
				93506.333, -- [33]
				93507.538, -- [34]
				93510.523, -- [35]
				93512.682, -- [36]
			},
			["Fights"] = {
				["Fight1"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 434,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 15,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 434,
					},
					["DOT_Time"] = 0,
					["Damage"] = 31401,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Nature"] = 31401,
					},
					["PartialAbsorb"] = {
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 2920,
								},
							},
							["amount"] = 2920,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 28481,
								},
							},
							["amount"] = 28481,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 434,
								},
							},
							["amount"] = 434,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 0.84,
								},
							},
							["amount"] = 0.84,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 25.05,
								},
							},
							["amount"] = 25.05,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 25.89,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Удар горгульи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 2937,
									["min"] = 2572,
									["count"] = 11,
									["amount"] = 31401,
								},
							},
							["count"] = 15,
							["amount"] = 31401,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 25.89,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 0.84,
								},
							},
							["amount"] = 0.84,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 25.05,
								},
							},
							["amount"] = 25.05,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 434,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 15,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 434,
					},
					["DOT_Time"] = 0,
					["Damage"] = 31401,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Nature"] = 31401,
					},
					["PartialAbsorb"] = {
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 2920,
								},
							},
							["amount"] = 2920,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 28481,
								},
							},
							["amount"] = 28481,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Колун всадника"] = {
									["count"] = 434,
								},
							},
							["amount"] = 434,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 0.84,
								},
							},
							["amount"] = 0.84,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 25.05,
								},
							},
							["amount"] = 25.05,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 25.89,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Удар горгульи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 2937,
									["min"] = 2572,
									["count"] = 11,
									["amount"] = 31401,
								},
							},
							["count"] = 15,
							["amount"] = 31401,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 25.89,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 0.84,
								},
							},
							["amount"] = 0.84,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 25.05,
								},
							},
							["amount"] = 25.05,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["PartialAbsorb"] = {
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Удар горгульи"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 9,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 3467,
									["min"] = 2572,
									["count"] = 23,
									["amount"] = 72055,
								},
							},
							["count"] = 32,
							["amount"] = 72055,
						},
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 0.84,
								},
							},
							["amount"] = 0.84,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 50.44,
								},
							},
							["amount"] = 50.44,
						},
					},
					["DamageTaken"] = 574,
					["WhoDamaged"] = {
						["Всадник без головы"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 140,
								},
								["Колун всадника"] = {
									["count"] = 434,
								},
							},
							["amount"] = 574,
						},
					},
					["ElementDone"] = {
						["Nature"] = 72055,
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 23,
								},
							},
							["amount"] = 32,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 2920,
								},
							},
							["amount"] = 2920,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 69135,
								},
							},
							["amount"] = 69135,
						},
					},
					["TimeDamage"] = 51.28,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 0.84,
								},
							},
							["amount"] = 0.84,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Удар горгульи"] = {
									["count"] = 50.44,
								},
							},
							["amount"] = 50.44,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 574,
					},
					["ActiveTime"] = 51.28,
					["Damage"] = 72055,
				},
			},
			["UnitLockout"] = 1697820919,
			["LastActive"] = 1697820919,
		},
		["Павший воитель"] = {
			["GUID"] = "0xF130001958000001",
			["LastEventHealth"] = {
				"???", -- [1]
				"3330 (100%)", -- [2]
				"1289 (38%)", -- [3]
				"1289 (38%)", -- [4]
				"0 (0%)", -- [5]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"MISC", -- [5]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					3.5, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["DamageTaken"] = {
					3703, -- [1]
				},
				["ActiveTime"] = {
					3.5, -- [1]
				},
			},
			["enClass"] = "MOB",
			["unit"] = "party1target",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
					},
					["Messages"] = {
						"Павший воитель Атака ближнего боя Mazdaqq Miss", -- [1]
						"Limbmasher <Mazdaqq> Атака ближнего боя Павший воитель Hit -801 (Physical)", -- [2]
						"Limbmasher <Mazdaqq> Цапнуть Павший воитель Hit -1240 (Physical)", -- [3]
						"Limbmasher <Mazdaqq> Атака ближнего боя Павший воитель Crit -1662 (Physical)", -- [4]
						"Павший воитель умирает.", -- [5]
					},
					["DeathAt"] = 1697820878,
					["HealthNum"] = {
						0, -- [1]
						100, -- [2]
						38.70870870870871, -- [3]
						38.70870870870871, -- [4]
						0, -- [5]
					},
					["MessageTimes"] = {
						-1.716000000000349, -- [1]
						-1.51600000000326, -- [2]
						-1.213000000003376, -- [3]
						-0.001000000003841706, -- [4]
						0, -- [5]
					},
					["KilledBy"] = "Limbmasher <Mazdaqq>",
					["Health"] = {
						"???", -- [1]
						"3330 (100%)", -- [2]
						"1289 (38%)", -- [3]
						"1289 (38%)", -- [4]
						"0 (0%)", -- [5]
					},
					["EventNum"] = {
						0, -- [1]
						24.05405405405405, -- [2]
						37.23723723723724, -- [3]
						49.90990990990991, -- [4]
						0, -- [5]
					},
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"MISC", -- [5]
					},
				}, -- [1]
			},
			["level"] = -1,
			["LastDamageAbility"] = "Атака ближнего боя",
			["LastFightIn"] = 13,
			["LastEventNum"] = {
				nil, -- [1]
				24.05405405405405, -- [2]
				37.23723723723724, -- [3]
				49.90990990990991, -- [4]
			},
			["type"] = "Boss",
			["FightsSaved"] = 1,
			["LastDamageTaken"] = 1662,
			["TimeLast"] = {
				["DeathCount"] = 1697820876,
				["ActiveTime"] = 1697820874,
				["OVERALL"] = 1697820876,
				["DamageTaken"] = 1697820876,
				["TimeDamage"] = 1697820874,
			},
			["Owner"] = false,
			["LastAbility"] = 93467.82400000001,
			["NextEventNum"] = 6,
			["LastEventHealthNum"] = {
				0, -- [1]
				100, -- [2]
				38.70870870870871, -- [3]
				38.70870870870871, -- [4]
				0, -- [5]
			},
			["LastEvents"] = {
				"Павший воитель Атака ближнего боя Mazdaqq Miss", -- [1]
				"Limbmasher <Mazdaqq> Атака ближнего боя Павший воитель Hit -801 (Physical)", -- [2]
				"Limbmasher <Mazdaqq> Цапнуть Павший воитель Hit -1240 (Physical)", -- [3]
				"Limbmasher <Mazdaqq> Атака ближнего боя Павший воитель Crit -1662 (Physical)", -- [4]
				"Павший воитель умирает.", -- [5]
			},
			["Name"] = "Павший воитель",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
			},
			["LastEventTimes"] = {
				93467.82400000001, -- [1]
				93468.02400000001, -- [2]
				93468.32700000001, -- [3]
				93469.539, -- [4]
				93469.54000000001, -- [5]
			},
			["Fights"] = {
				["Fight1"] = {
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["WhoDamaged"] = {
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
				},
				["LastFightData"] = {
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["WhoDamaged"] = {
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeSpent"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["DamageTaken"] = 3703,
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DeathCount"] = 1,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 3.5,
					["TimeDamaging"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 3.5,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 2463,
						["Physical"] = 1240,
					},
					["WhoDamaged"] = {
						["Limbmasher <Mazdaqq>"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2463,
								},
								["Цапнуть"] = {
									["count"] = 1240,
								},
							},
							["amount"] = 3703,
						},
					},
					["ActiveTime"] = 3.5,
				},
			},
			["UnitLockout"] = 1697820874,
			["LastActive"] = 1697820876,
		},
		["Mazdaqq"] = {
			["GUID"] = "0x0700000000845A82",
			["LastEventHealth"] = {
				"19594 (64%)", -- [1]
				"19594 (64%)", -- [2]
				"19086 (63%)", -- [3]
				"19086 (63%)", -- [4]
				"19086 (63%)", -- [5]
				"19086 (63%)", -- [6]
				"19086 (63%)", -- [7]
				"19086 (63%)", -- [8]
				"19086 (63%)", -- [9]
				"19339 (63%)", -- [10]
				"19342 (63%)", -- [11]
				"19342 (63%)", -- [12]
				"19370 (64%)", -- [13]
				"19370 (64%)", -- [14]
				"19424 (64%)", -- [15]
				"19424 (64%)", -- [16]
				"19481 (64%)", -- [17]
				"19481 (64%)", -- [18]
				"19481 (64%)", -- [19]
				"19481 (64%)", -- [20]
				"19481 (64%)", -- [21]
				"19481 (64%)", -- [22]
				"19481 (64%)", -- [23]
				"19481 (64%)", -- [24]
				"19481 (64%)", -- [25]
				"19481 (64%)", -- [26]
				"19481 (64%)", -- [27]
				"19481 (64%)", -- [28]
				"19554 (64%)", -- [29]
				"19554 (64%)", -- [30]
				"19554 (64%)", -- [31]
				"19554 (64%)", -- [32]
				"19554 (64%)", -- [33]
				"19554 (64%)", -- [34]
				"19684 (65%)", -- [35]
				"19684 (65%)", -- [36]
				"19684 (65%)", -- [37]
				"19793 (65%)", -- [38]
				"19793 (65%)", -- [39]
				"19793 (65%)", -- [40]
				"19793 (65%)", -- [41]
				"19994 (66%)", -- [42]
				"19994 (66%)", -- [43]
				"19994 (66%)", -- [44]
				"19994 (66%)", -- [45]
				"19994 (66%)", -- [46]
				"19995 (66%)", -- [47]
				"19995 (66%)", -- [48]
				"21355 (70%)", -- [49]
				"21380 (70%)", -- [50]
			},
			["LastAttackedBy"] = "Всадник без головы",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"DAMAGE", -- [12]
				"HEAL", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"DAMAGE", -- [16]
				"HEAL", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"HEAL", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"HEAL", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"HEAL", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					33.22000000000002, -- [1]
				},
				["Healing"] = {
					28661, -- [1]
				},
				["DamageTaken"] = {
					42870, -- [1]
				},
				["HOT_Time"] = {
					489, -- [1]
				},
				["HealingTaken"] = {
					28661, -- [1]
				},
				["Overhealing"] = {
					15541, -- [1]
				},
				["ActiveTime"] = {
					262.6599999999992, -- [1]
				},
				["TimeDamage"] = {
					229.4399999999997, -- [1]
				},
				["RunicPowerGain"] = {
					30, -- [1]
				},
				["DOT_Time"] = {
					360, -- [1]
				},
				["Damage"] = {
					988051, -- [1]
				},
			},
			["enClass"] = "DEATHKNIGHT",
			["unit"] = "Mazdaqq",
			["LastAbility"] = 93559.13000000001,
			["LastDamageTaken"] = 1786,
			["level"] = 80,
			["LastDamageAbility"] = "Колун всадника",
			["LastFightIn"] = 13,
			["LastEventNum"] = {
				5.903937059931903, -- [1]
				[47] = 0.003305675845426597,
				[49] = 4.495719149780173,
				[13] = 0.09255892367194472,
				[38] = 0.3603186671514991,
				[42] = 0.6644408449307461,
				[15] = 0.1785064956530363,
				[17] = 0.188423523189316,
				[35] = 0.4297378599054577,
				[10] = 0.8363359888929292,
				[50] = 0.08264189613566493,
				[11] = 0.009917027536279792,
				[29] = 0.2413143367161416,
			},
			["type"] = "Grouped",
			["FightsSaved"] = 5,
			["GuardianReverseGUIDs"] = {
				["Вороная горгулья"] = {
					["LatestGuardian"] = 1,
					["GUIDs"] = {
						"0xF130006CB500008C", -- [1]
						[0] = "0xF130006CB5000096",
					},
				},
				["Войско мертвых"] = {
					["LatestGuardian"] = 7,
					["GUIDs"] = {
						"0xF130005E8F00008F", -- [1]
						"0xF130005E8F000090", -- [2]
						"0xF130005E8F000091", -- [3]
						"0xF130005E8F000092", -- [4]
						"0xF130005E8F000093", -- [5]
						"0xF130005E8F000094", -- [6]
						"0xF130005E8F000095", -- [7]
						[0] = "0xF130005E8F00008E",
					},
				},
			},
			["TimeLast"] = {
				["TimeHeal"] = 1697820966,
				["OVERALL"] = 1697820966,
				["DamageTaken"] = 1697820966,
				["HOT_Time"] = 1697820966,
				["ActiveTime"] = 1697820966,
				["HealingTaken"] = 1697820966,
				["Overhealing"] = 1697820891,
				["TimeDamage"] = 1697820966,
				["Healing"] = 1697820966,
				["RunicPowerGain"] = 1697820956,
				["DOT_Time"] = 1697820965,
				["Damage"] = 1697820966,
			},
			["Owner"] = false,
			["Pet"] = {
				"Limbmasher <Mazdaqq>", -- [1]
				"Войско мертвых <Mazdaqq>", -- [2]
				"Вороная горгулья <Mazdaqq>", -- [3]
			},
			["NextEventNum"] = 3,
			["LastEventHealthNum"] = {
				64.77141251528875, -- [1]
				64.77141251528875, -- [2]
				63.09212918581204, -- [3]
				63.09212918581204, -- [4]
				63.09212918581204, -- [5]
				63.09212918581204, -- [6]
				63.09212918581204, -- [7]
				63.09212918581204, -- [8]
				63.09212918581204, -- [9]
				63.92846517470497, -- [10]
				63.93838220224125, -- [11]
				63.93838220224125, -- [12]
				64.03094112591319, -- [13]
				64.03094112591319, -- [14]
				64.20944762156623, -- [15]
				64.20944762156623, -- [16]
				64.39787114475554, -- [17]
				64.39787114475554, -- [18]
				64.39787114475554, -- [19]
				64.39787114475554, -- [20]
				64.39787114475554, -- [21]
				64.39787114475554, -- [22]
				64.39787114475554, -- [23]
				64.39787114475554, -- [24]
				64.39787114475554, -- [25]
				64.39787114475554, -- [26]
				64.39787114475554, -- [27]
				64.39787114475554, -- [28]
				64.63918548147169, -- [29]
				64.63918548147169, -- [30]
				64.63918548147169, -- [31]
				64.63918548147169, -- [32]
				64.63918548147169, -- [33]
				64.63918548147169, -- [34]
				65.06892334137714, -- [35]
				65.06892334137714, -- [36]
				65.06892334137714, -- [37]
				65.42924200852865, -- [38]
				65.42924200852865, -- [39]
				65.42924200852865, -- [40]
				65.42924200852865, -- [41]
				66.09368285345938, -- [42]
				66.09368285345938, -- [43]
				66.09368285345938, -- [44]
				66.09368285345938, -- [45]
				66.09368285345938, -- [46]
				66.09698852930481, -- [47]
				66.09698852930481, -- [48]
				70.592707679085, -- [49]
				70.67534957522065, -- [50]
			},
			["LastEvents"] = {
				"Всадник без головы Колун всадника Mazdaqq Hit -1786 (Physical)", -- [1]
				"Mazdaqq Удар Плети Голова Всадника Crit -8182 (Physical)", -- [2]
				"Mazdaqq Бродячая чума Всадник без головы Hit -930 (Shadow)", -- [3]
				"Mazdaqq Смерть и разложение Злобная тыква Hit -590 (Shadow)", -- [4]
				"Mazdaqq Смерть и разложение Злобная тыква Hit -590 (Shadow)", -- [5]
				"Mazdaqq Смерть и разложение Злобная тыква Hit -590 (Shadow)", -- [6]
				"Mazdaqq Смерть и разложение Злобная тыква Hit -589 (Shadow)", -- [7]
				"Mazdaqq Смерть и разложение Всадник без головы Hit -733 (Shadow)", -- [8]
				"Mazdaqq Атака ближнего боя Всадник без головы Crit -6342 (Physical)", -- [9]
				"Mazdaqq Власть крови Mazdaqq Tick +253", -- [10]
				"Mazdaqq Власть крови Mazdaqq Tick +3", -- [11]
				"Mazdaqq Вскипание крови Злобная тыква Hit -1039 (Shadow)", -- [12]
				"Mazdaqq Власть крови Mazdaqq Tick +28", -- [13]
				"Mazdaqq Вскипание крови Злобная тыква Hit -1015 (Shadow)", -- [14]
				"Mazdaqq Власть крови Mazdaqq Tick +54", -- [15]
				"Mazdaqq Вскипание крови Злобная тыква Crit -2126 (Shadow)", -- [16]
				"Mazdaqq Власть крови Mazdaqq Tick +57", -- [17]
				"Mazdaqq Вскипание крови Всадник без головы Hit -1881 (Shadow)", -- [18]
				"Mazdaqq Некроз Всадник без головы Immune (Shadow)", -- [19]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [20]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [21]
				"Mazdaqq Удар смерти Всадник без головы Immune (Physical)", -- [22]
				"Mazdaqq Озноб Всадник без головы Immune (Frost)", -- [23]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [24]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [25]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [26]
				"Mazdaqq Кровавая чума Всадник без головы Immune (Shadow)", -- [27]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [28]
				"Mazdaqq Власть крови Mazdaqq Tick +73", -- [29]
				"Mazdaqq Ледяное прикосновение Голова Всадника Hit -1839 (Frost)", -- [30]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [31]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [32]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [33]
				"Mazdaqq Смерть и разложение Всадник без головы Immune (Shadow)", -- [34]
				"Mazdaqq Власть крови Mazdaqq Tick +130", -- [35]
				"Mazdaqq Лик смерти Голова Всадника Hit -3262 (Shadow)", -- [36]
				"Mazdaqq Атака ближнего боя Голова Всадника Hit -2725 (Physical)", -- [37]
				"Mazdaqq Власть крови Mazdaqq Tick +109", -- [38]
				"Mazdaqq Удар закаленным в крови клинком Голова Всадника Hit -1392 (Physical)", -- [39]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [40]
				"Mazdaqq Некроз Голова Всадника Hit -545 (Shadow)", -- [41]
				"Mazdaqq Власть крови Mazdaqq Tick +201", -- [42]
				"Mazdaqq Удар чумы Голова Всадника Crit -5041 (Physical)", -- [43]
				"Mazdaqq Озноб (УЗВ) Голова Всадника Tick -1488 (Frost)", -- [44]
				"Mazdaqq Бродячая чума Голова Всадника Hit -1407 (Shadow)", -- [45]
				"Mazdaqq Нечестивая порча Всадник без головы Immune (Shadow)", -- [46]
				"Mazdaqq Власть крови Mazdaqq Tick +1", -- [47]
				"Mazdaqq Нечестивая порча (УЗВ) Голова Всадника Tick -32 (Shadow)", -- [48]
				"Mazdaqq Нечестивая сила Mazdaqq Crit +1360", -- [49]
				"Mazdaqq Власть крови Mazdaqq Tick +25", -- [50]
			},
			["Name"] = "Mazdaqq",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				93559.129, -- [1]
				93559.13000000001, -- [2]
				93551.387, -- [3]
				93551.387, -- [4]
				93551.387, -- [5]
				93551.38800000001, -- [6]
				93551.38800000001, -- [7]
				93551.38800000001, -- [8]
				93551.48700000001, -- [9]
				93551.621, -- [10]
				93551.621, -- [11]
				93551.622, -- [12]
				93551.622, -- [13]
				93551.62300000001, -- [14]
				93551.62300000001, -- [15]
				93551.62300000001, -- [16]
				93551.624, -- [17]
				93551.625, -- [18]
				93551.82400000001, -- [19]
				93552.228, -- [20]
				93552.22900000001, -- [21]
				93552.73, -- [22]
				93552.731, -- [23]
				93553.099, -- [24]
				93553.232, -- [25]
				93554.072, -- [26]
				93554.17200000001, -- [27]
				93554.17200000001, -- [28]
				93554.776, -- [29]
				93554.777, -- [30]
				93555.18000000001, -- [31]
				93555.18000000001, -- [32]
				93556.084, -- [33]
				93556.15000000001, -- [34]
				93556.485, -- [35]
				93556.485, -- [36]
				93556.92, -- [37]
				93557.121, -- [38]
				93557.121, -- [39]
				93557.121, -- [40]
				93557.454, -- [41]
				93557.454, -- [42]
				93557.455, -- [43]
				93557.822, -- [44]
				93558.09, -- [45]
				93558.09, -- [46]
				93558.091, -- [47]
				93558.091, -- [48]
				93558.86, -- [49]
				93559.126, -- [50]
			},
			["Fights"] = {
				["Fight5"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 99,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Shadow"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 13,
								},
							},
							["amount"] = 15,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 99,
					},
					["DOT_Time"] = 0,
					["Damage"] = 7802,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 0,
						["Shadow"] = 7802,
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 7348,
								},
							},
							["amount"] = 7348,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 454,
								},
							},
							["amount"] = 454,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 99,
								},
							},
							["amount"] = 99,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 4.99,
								},
							},
							["amount"] = 4.99,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 2.75,
								},
							},
							["amount"] = 2.75,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["WhoHealed"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.74,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Смерть и разложение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 950,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 1899,
								},
								["Hit"] = {
									["max"] = 455,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 5903,
								},
							},
							["count"] = 15,
							["amount"] = 7802,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 7.74,
					["TimeDamaging"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 4.99,
								},
							},
							["amount"] = 4.99,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 2.75,
								},
							},
							["amount"] = 2.75,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight2"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 17,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Shadow"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 17,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 0,
						["Shadow"] = 0,
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 17,
								},
							},
							["amount"] = 17,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Смерть и разложение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Истязатель из Алого ордена"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
								["Parry"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 0,
						["Frost"] = 0,
						["Melee"] = 0,
						["Shadow"] = 0,
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight3"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 4730,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 740,
						["Shadow"] = 0,
						["Melee"] = 2751,
						["Frost"] = 1239,
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2751,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1239,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 740,
								},
							},
							["amount"] = 4730,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.1,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 4.84,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 4.84,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 2751,
									["min"] = 2751,
									["count"] = 1,
									["amount"] = 2751,
								},
							},
							["count"] = 1,
							["amount"] = 2751,
						},
						["Смерть и разложение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1239,
									["min"] = 1239,
									["count"] = 1,
									["amount"] = 1239,
								},
							},
							["count"] = 1,
							["amount"] = 1239,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 740,
									["min"] = 740,
									["count"] = 1,
									["amount"] = 740,
								},
							},
							["count"] = 1,
							["amount"] = 740,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 4.84,
					["TimeDamaging"] = {
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1.1,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 4.84,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight4"] = {
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Всадник без головы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 0,
								},
								["Всадник без головы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 0,
								},
								["Всадник без головы"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 74,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 74,
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 17560,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Physical"] = 0,
						["Frost"] = 2988,
						["Melee"] = 6511,
						["Shadow"] = 8061,
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6511,
								},
								["Ледяное прикосновение"] = {
									["count"] = 2988,
								},
							},
							["amount"] = 9499,
						},
						["Крыса"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1731,
								},
							},
							["amount"] = 1731,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Лик смерти"] = {
									["count"] = 4702,
								},
								["Вскипание крови"] = {
									["count"] = 1628,
								},
							},
							["amount"] = 6330,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Колун всадника"] = {
									["count"] = 0,
								},
								["Вихрь всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 74,
								},
							},
							["amount"] = 74,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Physical"] = 0,
					},
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Лик смерти"] = {
									["count"] = 1.14,
								},
								["Вскипание крови"] = {
									["count"] = 2.42,
								},
							},
							["amount"] = 3.56,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0.24,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 2.12,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавая чума"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Нечестивая порча"] = {
									["count"] = 0,
								},
								["Озноб"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["WhoHealed"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Нечестивая сила"] = {
									["count"] = 0,
								},
								["Власть крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 5.68,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 6511,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 6511,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 6511,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2988,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 2988,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 2988,
						},
						["Некроз"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1731,
									["min"] = 1731,
									["count"] = 1,
									["amount"] = 1731,
								},
								["Hit"] = {
									["max"] = 824,
									["min"] = 804,
									["count"] = 2,
									["amount"] = 1628,
								},
							},
							["count"] = 3,
							["amount"] = 3359,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Озноб"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Crit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4702,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 4702,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 4702,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 5.68,
					["TimeDamaging"] = {
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавая чума"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Нечестивая порча"] = {
									["count"] = 0,
								},
								["Озноб"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0.24,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 2.12,
						},
						["Крыса"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Лик смерти"] = {
									["count"] = 1.14,
								},
								["Вскипание крови"] = {
									["count"] = 2.42,
								},
							},
							["amount"] = 3.56,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Голова Всадника"] = {
							["Details"] = {
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 80,
					},
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.4300000000000001,
								},
								["Нечестивая сила"] = {
									["count"] = 2.08,
								},
								["Власть крови"] = {
									["count"] = 20.2,
								},
							},
							["amount"] = 22.71,
						},
					},
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Пульсирующая тыква"] = {
									["count"] = 12,
								},
								["Всадник без головы"] = {
									["count"] = 45,
								},
							},
							["amount"] = 57,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 9,
								},
								["Всадник без головы"] = {
									["count"] = 45,
								},
								["Пульсирующая тыква"] = {
									["count"] = 12,
								},
							},
							["amount"] = 66,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 3,
								},
								["Всадник без головы"] = {
									["count"] = 54,
								},
							},
							["amount"] = 57,
						},
					},
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 246,
								},
							},
							["amount"] = 246,
						},
					},
					["HOT_Time"] = 246,
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 0.27,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.37,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.61,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.13,
								},
							},
							["amount"] = 3.38,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 2.31,
								},
								["Кровавая чума"] = {
									["count"] = 2.35,
								},
								["Мор"] = {
									["count"] = 0.37,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5.209999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0.71,
								},
								["Атака ближнего боя"] = {
									["count"] = 12.09,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.87,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 5.34,
								},
								["Бродячая чума"] = {
									["count"] = 1.04,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.53,
								},
								["Озноб"] = {
									["count"] = 1.67,
								},
								["Нечестивая порча"] = {
									["count"] = 9.560000000000001,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.17,
								},
								["Удар чумы"] = {
									["count"] = 0.17,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 9.34,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
							},
							["amount"] = 55.23000000000003,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0.6,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 0.8,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.4300000000000001,
								},
								["Нечестивая сила"] = {
									["count"] = 2.08,
								},
								["Власть крови"] = {
									["count"] = 20.2,
								},
							},
							["amount"] = 22.71,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 32108,
					["WhoHealed"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 9072,
								},
								["Нечестивая сила"] = {
									["count"] = 3808,
								},
								["Власть крови"] = {
									["count"] = 9692,
								},
							},
							["amount"] = 22572,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Слово Тьмы: Боль"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1532,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 12754,
								},
								["Hit"] = {
									["max"] = 733,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 15780,
								},
							},
							["count"] = 39,
							["amount"] = 28534,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1654,
									["min"] = 1033,
									["count"] = 22,
									["amount"] = 28885,
								},
							},
							["count"] = 22,
							["amount"] = 28885,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4492,
									["min"] = 3977,
									["count"] = 4,
									["amount"] = 16858,
								},
								["Hit"] = {
									["max"] = 2341,
									["min"] = 1533,
									["count"] = 6,
									["amount"] = 11799,
								},
							},
							["count"] = 10,
							["amount"] = 28657,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 2604,
									["min"] = 2604,
									["count"] = 1,
									["amount"] = 2604,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 6573,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 90840,
								},
								["Hit"] = {
									["max"] = 3307,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 31070,
								},
							},
							["count"] = 29,
							["amount"] = 124514,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4612,
									["min"] = 1891,
									["count"] = 4,
									["amount"] = 15157,
								},
							},
							["count"] = 4,
							["amount"] = 15157,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3363,
									["min"] = 3363,
									["count"] = 1,
									["amount"] = 3363,
								},
								["Hit"] = {
									["max"] = 1939,
									["min"] = 1303,
									["count"] = 5,
									["amount"] = 8471,
								},
							},
							["count"] = 6,
							["amount"] = 11834,
						},
						["Некроз"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1314,
									["min"] = 0,
									["count"] = 27,
									["amount"] = 23624,
								},
							},
							["count"] = 28,
							["amount"] = 23624,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1501,
									["min"] = 823,
									["count"] = 21,
									["amount"] = 21702,
								},
							},
							["count"] = 21,
							["amount"] = 21702,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2126,
									["min"] = 2126,
									["count"] = 1,
									["amount"] = 2126,
								},
								["Hit"] = {
									["max"] = 1881,
									["min"] = 1015,
									["count"] = 3,
									["amount"] = 3935,
								},
							},
							["count"] = 4,
							["amount"] = 6061,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4492,
									["min"] = 4356,
									["count"] = 2,
									["amount"] = 8848,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 8848,
						},
						["Озноб"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 98,
									["min"] = 30,
									["count"] = 19,
									["amount"] = 1173,
								},
							},
							["count"] = 19,
							["amount"] = 1173,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 1379,
									["min"] = 1379,
									["count"] = 1,
									["amount"] = 1379,
								},
								["Hit"] = {
									["max"] = 1915,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 8909,
								},
							},
							["count"] = 7,
							["amount"] = 10288,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5111,
									["min"] = 4398,
									["count"] = 3,
									["amount"] = 14550,
								},
								["Hit"] = {
									["max"] = 2020,
									["min"] = 1452,
									["count"] = 3,
									["amount"] = 5357,
								},
							},
							["count"] = 6,
							["amount"] = 19907,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1336,
									["min"] = 871,
									["count"] = 19,
									["amount"] = 19751,
								},
							},
							["count"] = 19,
							["amount"] = 19751,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7498,
									["min"] = 7498,
									["count"] = 1,
									["amount"] = 7498,
								},
								["Hit"] = {
									["max"] = 3844,
									["min"] = 3093,
									["count"] = 7,
									["amount"] = 23940,
								},
							},
							["count"] = 8,
							["amount"] = 31438,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 8503,
									["min"] = 7863,
									["count"] = 3,
									["amount"] = 24548,
								},
								["Crit (Блокировано)"] = {
									["max"] = 8722,
									["min"] = 8722,
									["count"] = 1,
									["amount"] = 8722,
								},
								["Hit"] = {
									["max"] = 3522,
									["min"] = 3522,
									["count"] = 1,
									["amount"] = 3522,
								},
							},
							["count"] = 5,
							["amount"] = 36792,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Слово Тьмы: Боль"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 82.12000000000005,
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 726,
									["min"] = 726,
									["count"] = 1,
									["amount"] = 726,
								},
							},
							["count"] = 1,
							["amount"] = 726,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 26944,
						["Physical"] = 5164,
					},
					["DOT_Time"] = 180,
					["Damage"] = 417165,
					["Overhealing"] = 726,
					["TimeHeal"] = 22.71,
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 9072,
								},
								["Нечестивая сила"] = {
									["count"] = 3808,
								},
								["Власть крови"] = {
									["count"] = 9692,
								},
							},
							["amount"] = 22572,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4536,
									["min"] = 4536,
									["count"] = 2,
									["amount"] = 9072,
								},
							},
							["count"] = 2,
							["amount"] = 9072,
						},
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1360,
									["min"] = 634,
									["count"] = 2,
									["amount"] = 1994,
								},
								["Hit"] = {
									["max"] = 907,
									["min"] = 907,
									["count"] = 2,
									["amount"] = 1814,
								},
							},
							["count"] = 4,
							["amount"] = 3808,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 348,
									["min"] = 1,
									["count"] = 82,
									["amount"] = 9692,
								},
							},
							["count"] = 82,
							["amount"] = 9692,
						},
					},
					["RunicPowerGainedFrom"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["Healing"] = 22572,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 22,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 34,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 31,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 29,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 38,
								},
								["Immune"] = {
									["count"] = 35,
								},
								["Crit"] = {
									["count"] = 12,
								},
								["Hit"] = {
									["count"] = 86,
								},
							},
							["amount"] = 171,
						},
					},
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 201,
								},
							},
							["amount"] = 201,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 26743,
								},
								["Колун всадника"] = {
									["count"] = 5164,
								},
							},
							["amount"] = 31907,
						},
					},
					["ElementDone"] = {
						["Frost"] = 40719,
						["Physical"] = 104492,
						["Melee"] = 124514,
						["Shadow"] = 147440,
					},
					["HealingTaken"] = 22572,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 1407,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 4400,
								},
								["Кровавый удар"] = {
									["count"] = 2341,
								},
								["Атака ближнего боя"] = {
									["count"] = 23287,
								},
								["Удар Плети"] = {
									["count"] = 8182,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 32,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 4089,
								},
								["Удар чумы"] = {
									["count"] = 14550,
								},
								["Ледяное прикосновение"] = {
									["count"] = 5229,
								},
								["Лик смерти"] = {
									["count"] = 3262,
								},
								["Некроз"] = {
									["count"] = 4656,
								},
							},
							["amount"] = 71435,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1881,
								},
								["Смерть и разложение"] = {
									["count"] = 11513,
								},
								["Удар смерти"] = {
									["count"] = 8848,
								},
								["Бродячая чума"] = {
									["count"] = 14056,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1141,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 15601,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 19072,
								},
								["Кровавый удар"] = {
									["count"] = 26316,
								},
								["Атака ближнего боя"] = {
									["count"] = 101227,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 15157,
								},
								["Удар Плети"] = {
									["count"] = 28610,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 6199,
								},
								["Удар чумы"] = {
									["count"] = 5357,
								},
								["Ледяное прикосновение"] = {
									["count"] = 6605,
								},
								["Лик смерти"] = {
									["count"] = 28176,
								},
								["Некроз"] = {
									["count"] = 18968,
								},
							},
							["amount"] = 308727,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 13290,
								},
								["Вскипание крови"] = {
									["count"] = 4180,
								},
								["Бродячая чума"] = {
									["count"] = 3294,
								},
							},
							["amount"] = 20764,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 3731,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 4150,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5413,
								},
								["Бродячая чума"] = {
									["count"] = 2945,
								},
							},
							["amount"] = 16239,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 59.41000000000001,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 0.27,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.37,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.61,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.13,
								},
							},
							["amount"] = 3.38,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 2.31,
								},
								["Кровавая чума"] = {
									["count"] = 2.35,
								},
								["Мор"] = {
									["count"] = 0.37,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5.209999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0.71,
								},
								["Атака ближнего боя"] = {
									["count"] = 12.09,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.87,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 5.34,
								},
								["Бродячая чума"] = {
									["count"] = 1.04,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.53,
								},
								["Озноб"] = {
									["count"] = 1.67,
								},
								["Нечестивая порча"] = {
									["count"] = 9.560000000000001,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.17,
								},
								["Удар чумы"] = {
									["count"] = 0.17,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 9.34,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
							},
							["amount"] = 55.23000000000003,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0.6,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 0.8,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 20,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 4,
								},
							},
							["amount"] = 25,
						},
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
				},
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 80,
					},
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.4300000000000001,
								},
								["Нечестивая сила"] = {
									["count"] = 2.08,
								},
								["Власть крови"] = {
									["count"] = 20.2,
								},
							},
							["amount"] = 22.71,
						},
					},
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Пульсирующая тыква"] = {
									["count"] = 12,
								},
								["Всадник без головы"] = {
									["count"] = 45,
								},
							},
							["amount"] = 57,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 9,
								},
								["Всадник без головы"] = {
									["count"] = 45,
								},
								["Пульсирующая тыква"] = {
									["count"] = 12,
								},
							},
							["amount"] = 66,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 3,
								},
								["Всадник без головы"] = {
									["count"] = 54,
								},
							},
							["amount"] = 57,
						},
					},
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 246,
								},
							},
							["amount"] = 246,
						},
					},
					["HOT_Time"] = 246,
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 0.27,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.37,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.61,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.13,
								},
							},
							["amount"] = 3.38,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 2.31,
								},
								["Кровавая чума"] = {
									["count"] = 2.35,
								},
								["Мор"] = {
									["count"] = 0.37,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5.209999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0.71,
								},
								["Атака ближнего боя"] = {
									["count"] = 12.09,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.87,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 5.34,
								},
								["Бродячая чума"] = {
									["count"] = 1.04,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.53,
								},
								["Озноб"] = {
									["count"] = 1.67,
								},
								["Нечестивая порча"] = {
									["count"] = 9.560000000000001,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.17,
								},
								["Удар чумы"] = {
									["count"] = 0.17,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 9.34,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
							},
							["amount"] = 55.23000000000003,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0.6,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 0.8,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.4300000000000001,
								},
								["Нечестивая сила"] = {
									["count"] = 2.08,
								},
								["Власть крови"] = {
									["count"] = 20.2,
								},
							},
							["amount"] = 22.71,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 32108,
					["WhoHealed"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 9072,
								},
								["Нечестивая сила"] = {
									["count"] = 3808,
								},
								["Власть крови"] = {
									["count"] = 9692,
								},
							},
							["amount"] = 22572,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Слово Тьмы: Боль"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1532,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 12754,
								},
								["Hit"] = {
									["max"] = 733,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 15780,
								},
							},
							["count"] = 39,
							["amount"] = 28534,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1654,
									["min"] = 1033,
									["count"] = 22,
									["amount"] = 28885,
								},
							},
							["count"] = 22,
							["amount"] = 28885,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4492,
									["min"] = 3977,
									["count"] = 4,
									["amount"] = 16858,
								},
								["Hit"] = {
									["max"] = 2341,
									["min"] = 1533,
									["count"] = 6,
									["amount"] = 11799,
								},
							},
							["count"] = 10,
							["amount"] = 28657,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 2604,
									["min"] = 2604,
									["count"] = 1,
									["amount"] = 2604,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 6573,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 90840,
								},
								["Hit"] = {
									["max"] = 3307,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 31070,
								},
							},
							["count"] = 29,
							["amount"] = 124514,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4612,
									["min"] = 1891,
									["count"] = 4,
									["amount"] = 15157,
								},
							},
							["count"] = 4,
							["amount"] = 15157,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3363,
									["min"] = 3363,
									["count"] = 1,
									["amount"] = 3363,
								},
								["Hit"] = {
									["max"] = 1939,
									["min"] = 1303,
									["count"] = 5,
									["amount"] = 8471,
								},
							},
							["count"] = 6,
							["amount"] = 11834,
						},
						["Некроз"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1314,
									["min"] = 0,
									["count"] = 27,
									["amount"] = 23624,
								},
							},
							["count"] = 28,
							["amount"] = 23624,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1501,
									["min"] = 823,
									["count"] = 21,
									["amount"] = 21702,
								},
							},
							["count"] = 21,
							["amount"] = 21702,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2126,
									["min"] = 2126,
									["count"] = 1,
									["amount"] = 2126,
								},
								["Hit"] = {
									["max"] = 1881,
									["min"] = 1015,
									["count"] = 3,
									["amount"] = 3935,
								},
							},
							["count"] = 4,
							["amount"] = 6061,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4492,
									["min"] = 4356,
									["count"] = 2,
									["amount"] = 8848,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 8848,
						},
						["Озноб"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 98,
									["min"] = 30,
									["count"] = 19,
									["amount"] = 1173,
								},
							},
							["count"] = 19,
							["amount"] = 1173,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 1379,
									["min"] = 1379,
									["count"] = 1,
									["amount"] = 1379,
								},
								["Hit"] = {
									["max"] = 1915,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 8909,
								},
							},
							["count"] = 7,
							["amount"] = 10288,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5111,
									["min"] = 4398,
									["count"] = 3,
									["amount"] = 14550,
								},
								["Hit"] = {
									["max"] = 2020,
									["min"] = 1452,
									["count"] = 3,
									["amount"] = 5357,
								},
							},
							["count"] = 6,
							["amount"] = 19907,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1336,
									["min"] = 871,
									["count"] = 19,
									["amount"] = 19751,
								},
							},
							["count"] = 19,
							["amount"] = 19751,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7498,
									["min"] = 7498,
									["count"] = 1,
									["amount"] = 7498,
								},
								["Hit"] = {
									["max"] = 3844,
									["min"] = 3093,
									["count"] = 7,
									["amount"] = 23940,
								},
							},
							["count"] = 8,
							["amount"] = 31438,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 8503,
									["min"] = 7863,
									["count"] = 3,
									["amount"] = 24548,
								},
								["Crit (Блокировано)"] = {
									["max"] = 8722,
									["min"] = 8722,
									["count"] = 1,
									["amount"] = 8722,
								},
								["Hit"] = {
									["max"] = 3522,
									["min"] = 3522,
									["count"] = 1,
									["amount"] = 3522,
								},
							},
							["count"] = 5,
							["amount"] = 36792,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Слово Тьмы: Боль"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 82.12000000000005,
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 726,
									["min"] = 726,
									["count"] = 1,
									["amount"] = 726,
								},
							},
							["count"] = 1,
							["amount"] = 726,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 26944,
						["Physical"] = 5164,
					},
					["DOT_Time"] = 180,
					["Damage"] = 417165,
					["Overhealing"] = 726,
					["TimeHeal"] = 22.71,
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 9072,
								},
								["Нечестивая сила"] = {
									["count"] = 3808,
								},
								["Власть крови"] = {
									["count"] = 9692,
								},
							},
							["amount"] = 22572,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4536,
									["min"] = 4536,
									["count"] = 2,
									["amount"] = 9072,
								},
							},
							["count"] = 2,
							["amount"] = 9072,
						},
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1360,
									["min"] = 634,
									["count"] = 2,
									["amount"] = 1994,
								},
								["Hit"] = {
									["max"] = 907,
									["min"] = 907,
									["count"] = 2,
									["amount"] = 1814,
								},
							},
							["count"] = 4,
							["amount"] = 3808,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 348,
									["min"] = 1,
									["count"] = 82,
									["amount"] = 9692,
								},
							},
							["count"] = 82,
							["amount"] = 9692,
						},
					},
					["RunicPowerGainedFrom"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["Healing"] = 22572,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 22,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 34,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 31,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 29,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 38,
								},
								["Immune"] = {
									["count"] = 35,
								},
								["Crit"] = {
									["count"] = 12,
								},
								["Hit"] = {
									["count"] = 86,
								},
							},
							["amount"] = 171,
						},
					},
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 201,
								},
							},
							["amount"] = 201,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 26743,
								},
								["Колун всадника"] = {
									["count"] = 5164,
								},
							},
							["amount"] = 31907,
						},
					},
					["ElementDone"] = {
						["Frost"] = 40719,
						["Physical"] = 104492,
						["Melee"] = 124514,
						["Shadow"] = 147440,
					},
					["HealingTaken"] = 22572,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 1407,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 4400,
								},
								["Кровавый удар"] = {
									["count"] = 2341,
								},
								["Атака ближнего боя"] = {
									["count"] = 23287,
								},
								["Удар Плети"] = {
									["count"] = 8182,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 32,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 4089,
								},
								["Удар чумы"] = {
									["count"] = 14550,
								},
								["Ледяное прикосновение"] = {
									["count"] = 5229,
								},
								["Лик смерти"] = {
									["count"] = 3262,
								},
								["Некроз"] = {
									["count"] = 4656,
								},
							},
							["amount"] = 71435,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1881,
								},
								["Смерть и разложение"] = {
									["count"] = 11513,
								},
								["Удар смерти"] = {
									["count"] = 8848,
								},
								["Бродячая чума"] = {
									["count"] = 14056,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1141,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 15601,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 19072,
								},
								["Кровавый удар"] = {
									["count"] = 26316,
								},
								["Атака ближнего боя"] = {
									["count"] = 101227,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 15157,
								},
								["Удар Плети"] = {
									["count"] = 28610,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 6199,
								},
								["Удар чумы"] = {
									["count"] = 5357,
								},
								["Ледяное прикосновение"] = {
									["count"] = 6605,
								},
								["Лик смерти"] = {
									["count"] = 28176,
								},
								["Некроз"] = {
									["count"] = 18968,
								},
							},
							["amount"] = 308727,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 13290,
								},
								["Вскипание крови"] = {
									["count"] = 4180,
								},
								["Бродячая чума"] = {
									["count"] = 3294,
								},
							},
							["amount"] = 20764,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 3731,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 4150,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5413,
								},
								["Бродячая чума"] = {
									["count"] = 2945,
								},
							},
							["amount"] = 16239,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 59.41000000000001,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 0.27,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.37,
								},
								["Кровавый удар"] = {
									["count"] = 0,
								},
								["Атака ближнего боя"] = {
									["count"] = 1.61,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
								["Удар чумы"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 1.13,
								},
							},
							["amount"] = 3.38,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 2.31,
								},
								["Кровавая чума"] = {
									["count"] = 2.35,
								},
								["Мор"] = {
									["count"] = 0.37,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5.209999999999999,
								},
								["Кровавый удар"] = {
									["count"] = 0.71,
								},
								["Атака ближнего боя"] = {
									["count"] = 12.09,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 0.87,
								},
								["Ледяное прикосновение"] = {
									["count"] = 3.5,
								},
								["Некроз"] = {
									["count"] = 5.34,
								},
								["Бродячая чума"] = {
									["count"] = 1.04,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.53,
								},
								["Озноб"] = {
									["count"] = 1.67,
								},
								["Нечестивая порча"] = {
									["count"] = 9.560000000000001,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.17,
								},
								["Удар чумы"] = {
									["count"] = 0.17,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 9.34,
								},
								["Лик смерти"] = {
									["count"] = 0,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
							},
							["amount"] = 55.23000000000003,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Крыса"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0.6,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 0.8,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Некроз"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGain"] = 20,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 4,
								},
							},
							["amount"] = 25,
						},
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 120,
					},
					["TimeHealing"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.4300000000000001,
								},
								["Нечестивая сила"] = {
									["count"] = 5.120000000000001,
								},
								["Власть крови"] = {
									["count"] = 27.67000000000001,
								},
							},
							["amount"] = 33.22000000000002,
						},
					},
					["DOTs"] = {
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Пульсирующая тыква"] = {
									["count"] = 12,
								},
								["Всадник без головы"] = {
									["count"] = 87,
								},
							},
							["amount"] = 99,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 15,
								},
								["Истязатель из Алого ордена"] = {
									["count"] = 3,
								},
								["Пульсирующая тыква"] = {
									["count"] = 12,
								},
								["Всадник без головы"] = {
									["count"] = 87,
								},
							},
							["amount"] = 117,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Голова Всадника"] = {
									["count"] = 21,
								},
								["Всадник без головы"] = {
									["count"] = 123,
								},
							},
							["amount"] = 144,
						},
					},
					["HOTs"] = {
						["Власть крови"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 489,
								},
							},
							["amount"] = 489,
						},
					},
					["HOT_Time"] = 489,
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 0.27,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.92,
								},
								["Кровавый удар"] = {
									["count"] = 0.37,
								},
								["Атака ближнего боя"] = {
									["count"] = 4.93,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.16,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.24,
								},
								["Удар чумы"] = {
									["count"] = 0.27,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.44,
								},
								["Лик смерти"] = {
									["count"] = 1.18,
								},
								["Некроз"] = {
									["count"] = 2.950000000000001,
								},
							},
							["amount"] = 12.73,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 8.74,
								},
								["Бродячая чума"] = {
									["count"] = 0.1,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.47,
								},
								["Вскипание крови"] = {
									["count"] = 2.42,
								},
								["Атака ближнего боя"] = {
									["count"] = 6.98,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.41,
								},
								["Ледяное прикосновение"] = {
									["count"] = 10.5,
								},
								["Лик смерти"] = {
									["count"] = 1.14,
								},
								["Некроз"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 32.33000000000001,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.01,
								},
								["Смерть и разложение"] = {
									["count"] = 1.01,
								},
							},
							["amount"] = 5.02,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0.24,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 2.12,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 1.17,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 1.37,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.3,
								},
							},
							["amount"] = 0.3,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 5.41,
								},
								["Кровавая чума"] = {
									["count"] = 5.409999999999999,
								},
								["Мор"] = {
									["count"] = 0.37,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7.39,
								},
								["Кровавый удар"] = {
									["count"] = 4.69,
								},
								["Атака ближнего боя"] = {
									["count"] = 24.45,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 2.01,
								},
								["Ледяное прикосновение"] = {
									["count"] = 9.050000000000001,
								},
								["Некроз"] = {
									["count"] = 10.27,
								},
								["Бродячая чума"] = {
									["count"] = 1.34,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.53,
								},
								["Нечестивая порча"] = {
									["count"] = 16.03,
								},
								["Озноб"] = {
									["count"] = 2.15,
								},
								["Удар Плети"] = {
									["count"] = 1.91,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1.2,
								},
								["Удар чумы"] = {
									["count"] = 1.87,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 16.11,
								},
								["Лик смерти"] = {
									["count"] = 1.01,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 5.279999999999999,
								},
							},
							["amount"] = 116.48,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.75,
								},
								["Ледяное прикосновение"] = {
									["count"] = 6.35,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 13.23,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 6.18,
								},
							},
							["amount"] = 6.18,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Смерть и разложение"] = {
									["count"] = 2.31,
								},
								["Вскипание крови"] = {
									["count"] = 0.74,
								},
							},
							["amount"] = 6.55,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.14,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 5.07,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.17,
								},
							},
							["amount"] = 19.88,
						},
						["Крыса"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 13.25,
								},
							},
							["amount"] = 13.25,
						},
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 0.4300000000000001,
								},
								["Нечестивая сила"] = {
									["count"] = 5.120000000000001,
								},
								["Власть крови"] = {
									["count"] = 27.67000000000001,
								},
							},
							["amount"] = 33.22000000000002,
						},
					},
					["DamageTaken"] = 42870,
					["RunicPowerGainedFrom"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Кровоотвод"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 135,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Слово Тьмы: Боль"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 39,
								},
								["Immune"] = {
									["count"] = 13,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 72,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 23,
								},
								["Hit"] = {
									["count"] = 41,
								},
							},
							["amount"] = 65,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 45,
								},
								["Hit"] = {
									["count"] = 23,
								},
							},
							["amount"] = 74,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 81,
								},
								["Immune"] = {
									["count"] = 70,
								},
								["Crit"] = {
									["count"] = 50,
								},
								["Hit"] = {
									["count"] = 213,
								},
							},
							["amount"] = 414,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 135,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 0,
						},
						["Жертвенный огонь"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Пелена Тени"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Колун всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Слово Тьмы: Боль"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 262.6599999999992,
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1548,
								},
							},
							["amount"] = 1548,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 651,
								},
							},
							["amount"] = 651,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 101,
								},
							},
							["amount"] = 101,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 42,
								},
							},
							["amount"] = 42,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 32999,
								},
								["Колун всадника"] = {
									["count"] = 6793,
								},
								["Вихрь всадника"] = {
									["count"] = 525,
								},
							},
							["amount"] = 40317,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 97,
								},
							},
							["amount"] = 97,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 88,
								},
							},
							["amount"] = 88,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 35552,
						["Physical"] = 7318,
					},
					["DOT_Time"] = 360,
					["Damage"] = 988051,
					["WhoHealed"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 9072,
								},
								["Нечестивая сила"] = {
									["count"] = 6654,
								},
								["Власть крови"] = {
									["count"] = 12935,
								},
							},
							["amount"] = 28661,
						},
					},
					["TimeHeal"] = 33.22000000000002,
					["Attacks"] = {
						["Смерть и разложение"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 13,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1678,
									["min"] = 905,
									["count"] = 43,
									["amount"] = 48018,
								},
								["Hit"] = {
									["max"] = 803,
									["min"] = 433,
									["count"] = 82,
									["amount"] = 45796,
								},
							},
							["count"] = 138,
							["amount"] = 93814,
						},
						["Кровавая чума"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Мор"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Озноб (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1721,
									["min"] = 985,
									["count"] = 39,
									["amount"] = 52409,
								},
							},
							["count"] = 39,
							["amount"] = 52409,
						},
						["Кровавый удар"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4880,
									["min"] = 2894,
									["count"] = 11,
									["amount"] = 44272,
								},
								["Hit"] = {
									["max"] = 2341,
									["min"] = 1461,
									["count"] = 11,
									["amount"] = 21526,
								},
							},
							["count"] = 22,
							["amount"] = 65798,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 3360,
									["min"] = 2562,
									["count"] = 3,
									["amount"] = 8526,
								},
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 7074,
									["min"] = 4439,
									["count"] = 45,
									["amount"] = 263897,
								},
								["Hit"] = {
									["max"] = 3369,
									["min"] = 1932,
									["count"] = 23,
									["amount"] = 65351,
								},
							},
							["count"] = 74,
							["amount"] = 337774,
						},
						["Удар Плети (Shadow)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4799,
									["min"] = 1719,
									["count"] = 10,
									["amount"] = 33706,
								},
							},
							["count"] = 10,
							["amount"] = 33706,
						},
						["Ледяное прикосновение"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4932,
									["min"] = 2589,
									["count"] = 4,
									["amount"] = 13872,
								},
								["Hit"] = {
									["max"] = 2090,
									["min"] = 1224,
									["count"] = 16,
									["amount"] = 25207,
								},
							},
							["count"] = 20,
							["amount"] = 39079,
						},
						["Некроз"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1414,
									["min"] = 386,
									["count"] = 55,
									["amount"] = 49326,
								},
							},
							["count"] = 56,
							["amount"] = 49326,
						},
						["Бродячая чума"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1630,
									["min"] = 813,
									["count"] = 43,
									["amount"] = 48726,
								},
							},
							["count"] = 43,
							["amount"] = 48726,
						},
						["Удар смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 4492,
									["min"] = 4356,
									["count"] = 2,
									["amount"] = 8848,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 8848,
						},
						["Озноб"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["Нечестивая порча"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 42,
							["amount"] = 0,
						},
						["Удар Плети"] = {
							["Details"] = {
								["Crit (Блокировано)"] = {
									["max"] = 8722,
									["min"] = 8636,
									["count"] = 2,
									["amount"] = 17358,
								},
								["Crit"] = {
									["max"] = 9076,
									["min"] = 7352,
									["count"] = 5,
									["amount"] = 40976,
								},
								["Hit"] = {
									["max"] = 3975,
									["min"] = 3203,
									["count"] = 4,
									["amount"] = 13980,
								},
							},
							["count"] = 11,
							["amount"] = 72314,
						},
						["Нечестивая порча (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 98,
									["min"] = 29,
									["count"] = 48,
									["amount"] = 2295,
								},
							},
							["count"] = 48,
							["amount"] = 2295,
						},
						["Удар закаленным в крови клинком"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 1379,
									["min"] = 1379,
									["count"] = 1,
									["amount"] = 1379,
								},
								["Hit"] = {
									["max"] = 2161,
									["min"] = 636,
									["count"] = 17,
									["amount"] = 24393,
								},
							},
							["count"] = 18,
							["amount"] = 25772,
						},
						["Удар чумы"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 5111,
									["min"] = 4398,
									["count"] = 3,
									["amount"] = 14550,
								},
								["Hit"] = {
									["max"] = 2369,
									["min"] = 1452,
									["count"] = 8,
									["amount"] = 15338,
								},
							},
							["count"] = 11,
							["amount"] = 29888,
						},
						["Кровавая чума (УЗВ)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 1446,
									["min"] = 871,
									["count"] = 33,
									["amount"] = 35692,
								},
							},
							["count"] = 33,
							["amount"] = 35692,
						},
						["Лик смерти"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 7498,
									["min"] = 4702,
									["count"] = 5,
									["amount"] = 32418,
								},
								["Hit"] = {
									["max"] = 4101,
									["min"] = 2587,
									["count"] = 14,
									["amount"] = 47146,
								},
							},
							["count"] = 19,
							["amount"] = 79564,
						},
						["Вскипание крови"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2126,
									["min"] = 1731,
									["count"] = 2,
									["amount"] = 3857,
								},
								["Hit"] = {
									["max"] = 1881,
									["min"] = 804,
									["count"] = 9,
									["amount"] = 9189,
								},
							},
							["count"] = 11,
							["amount"] = 13046,
						},
					},
					["OverHeals"] = {
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1360,
									["min"] = 726,
									["count"] = 5,
									["amount"] = 5417,
								},
								["Hit"] = {
									["max"] = 907,
									["min"] = 170,
									["count"] = 6,
									["amount"] = 4705,
								},
							},
							["count"] = 11,
							["amount"] = 10122,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 345,
									["min"] = 1,
									["count"] = 59,
									["amount"] = 5419,
								},
							},
							["count"] = 59,
							["amount"] = 5419,
						},
					},
					["Overhealing"] = 15541,
					["Healing"] = 28661,
					["HealedWho"] = {
						["Mazdaqq"] = {
							["Details"] = {
								["Удар смерти"] = {
									["count"] = 9072,
								},
								["Нечестивая сила"] = {
									["count"] = 6654,
								},
								["Власть крови"] = {
									["count"] = 12935,
								},
							},
							["amount"] = 28661,
						},
					},
					["Heals"] = {
						["Удар смерти"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 4536,
									["min"] = 4536,
									["count"] = 2,
									["amount"] = 9072,
								},
							},
							["count"] = 2,
							["amount"] = 9072,
						},
						["Нечестивая сила"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1360,
									["min"] = 262,
									["count"] = 5,
									["amount"] = 4103,
								},
								["Hit"] = {
									["max"] = 907,
									["min"] = 737,
									["count"] = 3,
									["amount"] = 2551,
								},
							},
							["count"] = 8,
							["amount"] = 6654,
						},
						["Власть крови"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 363,
									["min"] = 1,
									["count"] = 105,
									["amount"] = 12935,
								},
							},
							["count"] = 105,
							["amount"] = 12935,
						},
					},
					["ElementDone"] = {
						["Frost"] = 91488,
						["Physical"] = 202620,
						["Melee"] = 337774,
						["Shadow"] = 356169,
					},
					["HealingTaken"] = 28661,
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 1407,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7335,
								},
								["Кровавый удар"] = {
									["count"] = 3802,
								},
								["Атака ближнего боя"] = {
									["count"] = 59782,
								},
								["Удар Плети"] = {
									["count"] = 8182,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 268,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 6701,
								},
								["Удар чумы"] = {
									["count"] = 18877,
								},
								["Ледяное прикосновение"] = {
									["count"] = 8862,
								},
								["Лик смерти"] = {
									["count"] = 19350,
								},
								["Некроз"] = {
									["count"] = 11354,
								},
							},
							["amount"] = 145920,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 26059,
								},
								["Бродячая чума"] = {
									["count"] = 1150,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1138,
								},
								["Вскипание крови"] = {
									["count"] = 1628,
								},
								["Атака ближнего боя"] = {
									["count"] = 24054,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1461,
								},
								["Ледяное прикосновение"] = {
									["count"] = 5229,
								},
								["Лик смерти"] = {
									["count"] = 4702,
								},
								["Некроз"] = {
									["count"] = 588,
								},
							},
							["amount"] = 66009,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 12003,
								},
								["Смерть и разложение"] = {
									["count"] = 2159,
								},
							},
							["amount"] = 14162,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6511,
								},
								["Ледяное прикосновение"] = {
									["count"] = 2988,
								},
							},
							["amount"] = 9499,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 27141,
								},
								["Вскипание крови"] = {
									["count"] = 4180,
								},
								["Бродячая чума"] = {
									["count"] = 3294,
								},
							},
							["amount"] = 34615,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 4150,
								},
								["Смерть и разложение"] = {
									["count"] = 7015,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 5413,
								},
								["Бродячая чума"] = {
									["count"] = 13542,
								},
							},
							["amount"] = 30120,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 24776,
								},
								["Бродячая чума"] = {
									["count"] = 2491,
								},
								["Ледяное прикосновение"] = {
									["count"] = 2782,
								},
								["Лик смерти"] = {
									["count"] = 2587,
								},
								["Кровавый удар"] = {
									["count"] = 6157,
								},
							},
							["amount"] = 38793,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 2718,
								},
								["Смерть и разложение"] = {
									["count"] = 11947,
								},
							},
							["amount"] = 14665,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6167,
								},
								["Смерть и разложение"] = {
									["count"] = 2987,
								},
								["Вскипание крови"] = {
									["count"] = 908,
								},
							},
							["amount"] = 10062,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1881,
								},
								["Смерть и разложение"] = {
									["count"] = 13994,
								},
								["Удар смерти"] = {
									["count"] = 8848,
								},
								["Бродячая чума"] = {
									["count"] = 26842,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 33706,
								},
								["Удар Плети"] = {
									["count"] = 64132,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 38523,
								},
								["Кровавый удар"] = {
									["count"] = 55839,
								},
								["Атака ближнего боя"] = {
									["count"] = 193348,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 2027,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 31542,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 16974,
								},
								["Удар чумы"] = {
									["count"] = 11011,
								},
								["Ледяное прикосновение"] = {
									["count"] = 16762,
								},
								["Лик смерти"] = {
									["count"] = 52925,
								},
								["Некроз"] = {
									["count"] = 37384,
								},
							},
							["amount"] = 605738,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11133,
								},
								["Ледяное прикосновение"] = {
									["count"] = 2456,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 636,
								},
							},
							["amount"] = 14225,
						},
						["Крыса"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 1731,
								},
								["Смерть и разложение"] = {
									["count"] = 2512,
								},
							},
							["amount"] = 4243,
						},
					},
					["TimeDamage"] = 229.4399999999997,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Бродячая чума"] = {
									["count"] = 0.27,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0.92,
								},
								["Кровавый удар"] = {
									["count"] = 0.37,
								},
								["Атака ближнего боя"] = {
									["count"] = 4.93,
								},
								["Удар Плети"] = {
									["count"] = 0,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 1.16,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.24,
								},
								["Удар чумы"] = {
									["count"] = 0.27,
								},
								["Ледяное прикосновение"] = {
									["count"] = 0.44,
								},
								["Лик смерти"] = {
									["count"] = 1.18,
								},
								["Некроз"] = {
									["count"] = 2.950000000000001,
								},
							},
							["amount"] = 12.73,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 8.74,
								},
								["Бродячая чума"] = {
									["count"] = 0.1,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 1.47,
								},
								["Вскипание крови"] = {
									["count"] = 2.42,
								},
								["Атака ближнего боя"] = {
									["count"] = 6.98,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.41,
								},
								["Ледяное прикосновение"] = {
									["count"] = 10.5,
								},
								["Лик смерти"] = {
									["count"] = 1.14,
								},
								["Некроз"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 32.33000000000001,
						},
						["Иллюзорный фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.01,
								},
								["Смерть и разложение"] = {
									["count"] = 1.01,
								},
							},
							["amount"] = 5.02,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0.24,
								},
								["Ледяное прикосновение"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 2.12,
						},
						["Злобная тыква"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 1.17,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 1.37,
						},
						["Пульсирующая тыква"] = {
							["Details"] = {
								["Кровавая чума (УЗВ)"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 0,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 0,
								},
								["Бродячая чума"] = {
									["count"] = 0.3,
								},
							},
							["amount"] = 0.3,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 11.14,
								},
								["Бродячая чума"] = {
									["count"] = 0,
								},
								["Ледяное прикосновение"] = {
									["count"] = 5.07,
								},
								["Лик смерти"] = {
									["count"] = 3.5,
								},
								["Кровавый удар"] = {
									["count"] = 0.17,
								},
							},
							["amount"] = 19.88,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 6.18,
								},
							},
							["amount"] = 6.18,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Смерть и разложение"] = {
									["count"] = 2.31,
								},
								["Вскипание крови"] = {
									["count"] = 0.74,
								},
							},
							["amount"] = 6.55,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Смерть и разложение"] = {
									["count"] = 5.41,
								},
								["Кровавая чума"] = {
									["count"] = 5.409999999999999,
								},
								["Мор"] = {
									["count"] = 0.37,
								},
								["Озноб (УЗВ)"] = {
									["count"] = 7.39,
								},
								["Кровавый удар"] = {
									["count"] = 4.69,
								},
								["Атака ближнего боя"] = {
									["count"] = 24.45,
								},
								["Удар Плети (Shadow)"] = {
									["count"] = 2.01,
								},
								["Ледяное прикосновение"] = {
									["count"] = 9.050000000000001,
								},
								["Некроз"] = {
									["count"] = 10.27,
								},
								["Бродячая чума"] = {
									["count"] = 1.34,
								},
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Удар смерти"] = {
									["count"] = 0.53,
								},
								["Нечестивая порча"] = {
									["count"] = 16.03,
								},
								["Озноб"] = {
									["count"] = 2.15,
								},
								["Удар Плети"] = {
									["count"] = 1.91,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 1.2,
								},
								["Удар чумы"] = {
									["count"] = 1.87,
								},
								["Кровавая чума (УЗВ)"] = {
									["count"] = 16.11,
								},
								["Лик смерти"] = {
									["count"] = 1.01,
								},
								["Нечестивая порча (УЗВ)"] = {
									["count"] = 5.279999999999999,
								},
							},
							["amount"] = 116.48,
						},
						["Караульный Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.75,
								},
								["Ледяное прикосновение"] = {
									["count"] = 6.35,
								},
								["Удар закаленным в крови клинком"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 13.23,
						},
						["Крыса"] = {
							["Details"] = {
								["Вскипание крови"] = {
									["count"] = 0,
								},
								["Смерть и разложение"] = {
									["count"] = 13.25,
								},
							},
							["amount"] = 13.25,
						},
					},
					["RunicPowerGain"] = 30,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 15,
								},
								["Miss"] = {
									["count"] = 20,
								},
								["Hit"] = {
									["count"] = 78,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 19,
								},
							},
							["amount"] = 135,
						},
						["Fire"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["RunicPowerGained"] = {
						["Кровоотвод"] = {
							["Details"] = {
								["Mazdaqq"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
				},
			},
			["UnitLockout"] = 1697820475,
			["LastActive"] = 1697820966,
		},
		["Limbmasher <Mazdaqq>"] = {
			["GUID"] = "0xF1403A1848000001",
			["LastEventHealth"] = {
				"24972 (100%)", -- [1]
				"24972 (100%)", -- [2]
				"24972 (100%)", -- [3]
				"24972 (100%)", -- [4]
				"24972 (100%)", -- [5]
				"24972 (100%)", -- [6]
				"24972 (100%)", -- [7]
				"24972 (100%)", -- [8]
				"24972 (100%)", -- [9]
				"24972 (100%)", -- [10]
				"24972 (100%)", -- [11]
				"24972 (100%)", -- [12]
				"24972 (100%)", -- [13]
				"24972 (100%)", -- [14]
				"24972 (100%)", -- [15]
				"24972 (100%)", -- [16]
				"24972 (100%)", -- [17]
				"24972 (100%)", -- [18]
				"24972 (100%)", -- [19]
				"24972 (100%)", -- [20]
				"24972 (100%)", -- [21]
				"24972 (100%)", -- [22]
				"24972 (100%)", -- [23]
				"24972 (100%)", -- [24]
				"24972 (100%)", -- [25]
				"24972 (100%)", -- [26]
				"24972 (100%)", -- [27]
				"24972 (100%)", -- [28]
				"24972 (100%)", -- [29]
				"24972 (100%)", -- [30]
				"24839 (99%)", -- [31]
				"24839 (99%)", -- [32]
				"24839 (99%)", -- [33]
				"24839 (99%)", -- [34]
				"24839 (99%)", -- [35]
				"24839 (99%)", -- [36]
				"24839 (99%)", -- [37]
				"24839 (99%)", -- [38]
				"24839 (99%)", -- [39]
				"24839 (99%)", -- [40]
				"24839 (99%)", -- [41]
				"24972 (100%)", -- [42]
				"24972 (100%)", -- [43]
				"24972 (100%)", -- [44]
				"24972 (100%)", -- [45]
				"24972 (100%)", -- [46]
				"24972 (100%)", -- [47]
				"24972 (100%)", -- [48]
				"24972 (100%)", -- [49]
				"24972 (100%)", -- [50]
			},
			["LastAttackedBy"] = "Злобная тыква",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					205.77, -- [1]
				},
				["Damage"] = {
					140702, -- [1]
				},
				["DamageTaken"] = {
					780, -- [1]
				},
				["ActiveTime"] = {
					205.77, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "Limbmasher",
			["level"] = 1,
			["LastDamageAbility"] = "Атака ближнего боя",
			["LastFightIn"] = 13,
			["LastEventNum"] = {
				[30] = 0.5325965080890598,
			},
			["type"] = "Pet",
			["FightsSaved"] = 5,
			["LastDamageTaken"] = 133,
			["TimeLast"] = {
				["ActiveTime"] = 1697820965,
				["TimeDamage"] = 1697820965,
				["OVERALL"] = 1697820965,
				["DamageTaken"] = 1697820954,
				["Damage"] = 1697820965,
			},
			["Owner"] = "Mazdaqq",
			["LastAbility"] = 93558.727,
			["NextEventNum"] = 42,
			["LastEventHealthNum"] = {
				100, -- [1]
				100, -- [2]
				100, -- [3]
				100, -- [4]
				100, -- [5]
				100, -- [6]
				100, -- [7]
				100, -- [8]
				100, -- [9]
				100, -- [10]
				100, -- [11]
				100, -- [12]
				100, -- [13]
				100, -- [14]
				100, -- [15]
				100, -- [16]
				100, -- [17]
				100, -- [18]
				100, -- [19]
				100, -- [20]
				100, -- [21]
				100, -- [22]
				100, -- [23]
				100, -- [24]
				100, -- [25]
				100, -- [26]
				100, -- [27]
				100, -- [28]
				100, -- [29]
				100, -- [30]
				99.46740349191094, -- [31]
				99.46740349191094, -- [32]
				99.46740349191094, -- [33]
				99.46740349191094, -- [34]
				99.46740349191094, -- [35]
				99.46740349191094, -- [36]
				99.46740349191094, -- [37]
				99.46740349191094, -- [38]
				99.46740349191094, -- [39]
				99.46740349191094, -- [40]
				99.46740349191094, -- [41]
				100, -- [42]
				100, -- [43]
				100, -- [44]
				100, -- [45]
				100, -- [46]
				100, -- [47]
				100, -- [48]
				100, -- [49]
				100, -- [50]
			},
			["LastEvents"] = {
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1184 (Physical)", -- [1]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -571 (Physical)", -- [2]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -581 (Physical)", -- [3]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -870 (Physical)", -- [4]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -542 (Physical)", -- [5]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -545 (Physical)", -- [6]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -815 (Physical)", -- [7]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -534 (Physical)", -- [8]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [9]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [10]
				"Limbmasher <Mazdaqq> Атака ближнего боя Голова Всадника Glancing -541 (Physical)", -- [11]
				"Limbmasher <Mazdaqq> Цапнуть Голова Всадника Crit -1644 (Physical)", -- [12]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1088 (Physical)", -- [13]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Crit -1586 (Physical)", -- [14]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1056 (Physical)", -- [15]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -785 (Physical)", -- [16]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -526 (Physical)", -- [17]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -522 (Physical)", -- [18]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -789 (Physical)", -- [19]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -532 (Physical)", -- [20]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1062 (Physical)", -- [21]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -541 (Physical)", -- [22]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Crit -1578 (Physical)", -- [23]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -523 (Physical)", -- [24]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1054 (Physical)", -- [25]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -807 (Physical)", -- [26]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1076 (Physical)", -- [27]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -532 (Physical)", -- [28]
				"Злобная тыква Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [29]
				"Злобная тыква Атака ближнего боя Limbmasher <Mazdaqq> Hit -133 (Physical)", -- [30]
				"Злобная тыква Атака ближнего боя Limbmasher <Mazdaqq> Dodge", -- [31]
				"Злобная тыква Атака ближнего боя Limbmasher <Mazdaqq> Miss", -- [32]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -527 (Physical)", -- [33]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Crit -1574 (Physical)", -- [34]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -526 (Physical)", -- [35]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [36]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [37]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Immune (Physical)", -- [38]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [39]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Immune", -- [40]
				"Limbmasher <Mazdaqq> Атака ближнего боя Голова Всадника Hit -533 (Physical)", -- [41]
				"Limbmasher <Mazdaqq> Цапнуть Голова Всадника Hit -901 (Physical)", -- [42]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -566 (Physical)", -- [43]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -804 (Physical)", -- [44]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -579 (Physical)", -- [45]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -853 (Physical)", -- [46]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -557 (Physical)", -- [47]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Crit -1140 (Physical)", -- [48]
				"Limbmasher <Mazdaqq> Атака ближнего боя Всадник без головы Hit -575 (Physical)", -- [49]
				"Limbmasher <Mazdaqq> Цапнуть Всадник без головы Hit -879 (Physical)", -- [50]
			},
			["Name"] = "Limbmasher",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				93514.696, -- [1]
				93516.171, -- [2]
				93517.716, -- [3]
				93518.087, -- [4]
				93519.22, -- [5]
				93520.868, -- [6]
				93522.14600000001, -- [7]
				93522.249, -- [8]
				93523.89, -- [9]
				93525.368, -- [10]
				93527.481, -- [11]
				93527.751, -- [12]
				93532.177, -- [13]
				93532.379, -- [14]
				93533.82000000001, -- [15]
				93534.02, -- [16]
				93535.228, -- [17]
				93536.83900000001, -- [18]
				93538.18400000001, -- [19]
				93538.41800000001, -- [20]
				93539.887, -- [21]
				93541.32800000001, -- [22]
				93542.135, -- [23]
				93542.943, -- [24]
				93544.41800000001, -- [25]
				93546.02400000001, -- [26]
				93546.02400000001, -- [27]
				93547.499, -- [28]
				93547.632, -- [29]
				93547.632, -- [30]
				93547.73300000001, -- [31]
				93547.833, -- [32]
				93549.04000000001, -- [33]
				93549.978, -- [34]
				93550.54700000001, -- [35]
				93551.82400000001, -- [36]
				93553.232, -- [37]
				93553.97100000001, -- [38]
				93554.644, -- [39]
				93556.016, -- [40]
				93558.727, -- [41]
				93503.216, -- [42]
				93507.103, -- [43]
				93507.204, -- [44]
				93508.641, -- [45]
				93510.02, -- [46]
				93510.12, -- [47]
				93511.60000000001, -- [48]
				93513.117, -- [49]
				93514.19500000001, -- [50]
			},
			["Fights"] = {
				["Fight3"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 2083,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 821,
						["Physical"] = 1262,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 821,
								},
								["Цапнуть"] = {
									["count"] = 1262,
								},
							},
							["amount"] = 2083,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Цапнуть"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 3.6,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3.6,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 821,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 821,
								},
							},
							["count"] = 1,
							["amount"] = 821,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 1262,
									["min"] = 1262,
									["count"] = 1,
									["amount"] = 1262,
								},
							},
							["count"] = 1,
							["amount"] = 1262,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3.6,
					["TimeDamaging"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3.5,
								},
								["Цапнуть"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 3.6,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight2"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 8289,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 4740,
						["Physical"] = 3549,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4740,
								},
								["Цапнуть"] = {
									["count"] = 3549,
								},
							},
							["amount"] = 8289,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Physical"] = 0,
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5.869999999999999,
								},
								["Цапнуть"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 6.15,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6.15,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1600,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 4740,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 4740,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Hit (Блокировано)"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 2342,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 2342,
								},
								["Hit"] = {
									["max"] = 1207,
									["min"] = 1207,
									["count"] = 1,
									["amount"] = 1207,
								},
							},
							["count"] = 2,
							["amount"] = 3549,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 6.15,
					["TimeDamaging"] = {
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5.869999999999999,
								},
								["Цапнуть"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 6.15,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight5"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 7073,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 5814,
						["Physical"] = 1259,
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 5814,
								},
								["Цапнуть"] = {
									["count"] = 1259,
								},
							},
							["amount"] = 7073,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.92,
								},
								["Цапнуть"] = {
									["count"] = 0.37,
								},
							},
							["amount"] = 8.290000000000001,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 8.290000000000001,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1692,
									["min"] = 1638,
									["count"] = 3,
									["amount"] = 4970,
								},
								["Hit"] = {
									["max"] = 844,
									["min"] = 844,
									["count"] = 1,
									["amount"] = 844,
								},
							},
							["count"] = 4,
							["amount"] = 5814,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1259,
									["min"] = 1259,
									["count"] = 1,
									["amount"] = 1259,
								},
							},
							["count"] = 1,
							["amount"] = 1259,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 8.290000000000001,
					["TimeDamaging"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 7.92,
								},
								["Цапнуть"] = {
									["count"] = 0.37,
								},
							},
							["amount"] = 8.290000000000001,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight4"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 7439,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 2454,
						["Physical"] = 4985,
					},
					["PartialAbsorb"] = {
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2454,
								},
								["Цапнуть"] = {
									["count"] = 4985,
								},
							},
							["amount"] = 7439,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Physical"] = 15,
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.87,
								},
								["Цапнуть"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 7.109999999999999,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.109999999999999,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1620,
									["min"] = 1620,
									["count"] = 1,
									["amount"] = 1620,
								},
								["Hit"] = {
									["max"] = 834,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 834,
								},
							},
							["count"] = 2,
							["amount"] = 2454,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit (Блокировано)"] = {
									["max"] = 2455,
									["min"] = 2455,
									["count"] = 1,
									["amount"] = 2455,
								},
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 2530,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 2530,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 4985,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 7.109999999999999,
					["TimeDamaging"] = {
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.87,
								},
								["Цапнуть"] = {
									["count"] = 0.24,
								},
							},
							["amount"] = 7.109999999999999,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 40,
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.46,
								},
								["Цапнуть"] = {
									["count"] = 0.34,
								},
							},
							["amount"] = 6.8,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 59.80999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.34,
								},
							},
							["amount"] = 73.14999999999999,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 133,
								},
							},
							["amount"] = 133,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1658,
								},
								["Цапнуть"] = {
									["count"] = 2545,
								},
							},
							["amount"] = 4203,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 25371,
								},
								["Цапнуть"] = {
									["count"] = 16381,
								},
							},
							["amount"] = 41752,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 28,
								},
							},
							["amount"] = 49,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 13,
								},
							},
							["amount"] = 20,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["DamageTaken"] = 133,
					["ElementDone"] = {
						["Melee"] = 27029,
						["Physical"] = 18926,
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 587,
									["min"] = 527,
									["count"] = 3,
									["amount"] = 1655,
								},
								["Immune"] = {
									["count"] = 9,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1208,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 9882,
								},
								["Hit"] = {
									["max"] = 596,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 15492,
								},
							},
							["count"] = 49,
							["amount"] = 27029,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1736,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 8118,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 804,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 804,
								},
								["Hit"] = {
									["max"] = 903,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 10004,
								},
							},
							["count"] = 20,
							["amount"] = 18926,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 79.94999999999999,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.46,
								},
								["Цапнуть"] = {
									["count"] = 0.34,
								},
							},
							["amount"] = 6.8,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 59.80999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.34,
								},
							},
							["amount"] = 73.14999999999999,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 133,
					},
					["ActiveTime"] = 79.94999999999999,
					["Damage"] = 45955,
				},
				["Fight1"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 40,
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.46,
								},
								["Цапнуть"] = {
									["count"] = 0.34,
								},
							},
							["amount"] = 6.8,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 59.80999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.34,
								},
							},
							["amount"] = 73.14999999999999,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 133,
								},
							},
							["amount"] = 133,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1658,
								},
								["Цапнуть"] = {
									["count"] = 2545,
								},
							},
							["amount"] = 4203,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 25371,
								},
								["Цапнуть"] = {
									["count"] = 16381,
								},
							},
							["amount"] = 41752,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 28,
								},
							},
							["amount"] = 49,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 13,
								},
							},
							["amount"] = 20,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["DamageTaken"] = 133,
					["ElementDone"] = {
						["Melee"] = 27029,
						["Physical"] = 18926,
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 587,
									["min"] = 527,
									["count"] = 3,
									["amount"] = 1655,
								},
								["Immune"] = {
									["count"] = 9,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1208,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 9882,
								},
								["Hit"] = {
									["max"] = 596,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 15492,
								},
							},
							["count"] = 49,
							["amount"] = 27029,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1736,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 8118,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 804,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 804,
								},
								["Hit"] = {
									["max"] = 903,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 10004,
								},
							},
							["count"] = 20,
							["amount"] = 18926,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 79.94999999999999,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.46,
								},
								["Цапнуть"] = {
									["count"] = 0.34,
								},
							},
							["amount"] = 6.8,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 59.80999999999999,
								},
								["Цапнуть"] = {
									["count"] = 13.34,
								},
							},
							["amount"] = 73.14999999999999,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 0,
								},
								["Цапнуть"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 133,
					},
					["ActiveTime"] = 79.94999999999999,
					["Damage"] = 45955,
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 85,
					},
					["TimeSpent"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.46,
								},
								["Цапнуть"] = {
									["count"] = 0.34,
								},
							},
							["amount"] = 6.8,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 100.11,
								},
								["Цапнуть"] = {
									["count"] = 21.52,
								},
							},
							["amount"] = 121.63,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.96,
								},
								["Цапнуть"] = {
									["count"] = 0.27,
								},
							},
							["amount"] = 5.23,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.969999999999999,
								},
								["Цапнуть"] = {
									["count"] = 1.39,
								},
							},
							["amount"] = 11.36,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Цапнуть"] = {
									["count"] = 1.08,
								},
							},
							["amount"] = 1.08,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.55,
								},
								["Цапнуть"] = {
									["count"] = 0.3,
								},
							},
							["amount"] = 4.85,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.87,
								},
								["Цапнуть"] = {
									["count"] = 0.7200000000000001,
								},
							},
							["amount"] = 20.59,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30.8,
								},
								["Цапнуть"] = {
									["count"] = 3.430000000000001,
								},
							},
							["amount"] = 34.23000000000001,
						},
					},
					["WhoDamaged"] = {
						["Злобная тыква"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 488,
								},
							},
							["amount"] = 488,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Вихрь всадника"] = {
									["count"] = 292,
								},
							},
							["amount"] = 292,
						},
					},
					["DamagedWho"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 1658,
								},
								["Цапнуть"] = {
									["count"] = 2545,
								},
							},
							["amount"] = 4203,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 36984,
								},
								["Цапнуть"] = {
									["count"] = 26957,
								},
							},
							["amount"] = 63941,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3574,
								},
								["Цапнуть"] = {
									["count"] = 2204,
								},
							},
							["amount"] = 5778,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 3799,
								},
								["Цапнуть"] = {
									["count"] = 4532,
								},
							},
							["amount"] = 8331,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Цапнуть"] = {
									["count"] = 2162,
								},
							},
							["amount"] = 2162,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 2463,
								},
								["Цапнуть"] = {
									["count"] = 1240,
								},
							},
							["amount"] = 3703,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9494,
								},
								["Цапнуть"] = {
									["count"] = 10639,
								},
							},
							["amount"] = 20133,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 16753,
								},
								["Цапнуть"] = {
									["count"] = 15698,
								},
							},
							["amount"] = 32451,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 27,
								},
								["Hit"] = {
									["count"] = 53,
								},
							},
							["amount"] = 108,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 18,
								},
								["Hit"] = {
									["count"] = 30,
								},
							},
							["amount"] = 53,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 21,
								},
							},
							["amount"] = 26,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DamageTaken"] = 780,
					["ElementDone"] = {
						["Melee"] = 74725,
						["Physical"] = 65977,
					},
					["PartialResist"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 26,
									["amount"] = 0,
								},
							},
							["count"] = 26,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет сопротивлений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 611,
									["min"] = 527,
									["count"] = 8,
									["amount"] = 4591,
								},
								["Immune"] = {
									["count"] = 20,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1692,
									["min"] = 1014,
									["count"] = 27,
									["amount"] = 38052,
								},
								["Hit"] = {
									["max"] = 844,
									["min"] = 513,
									["count"] = 53,
									["amount"] = 32082,
								},
							},
							["count"] = 108,
							["amount"] = 74725,
						},
						["Цапнуть"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Hit (Блокировано)"] = {
									["max"] = 1130,
									["min"] = 804,
									["count"] = 3,
									["amount"] = 3053,
								},
								["Hit"] = {
									["max"] = 1262,
									["min"] = 766,
									["count"] = 27,
									["amount"] = 25465,
								},
								["Crit"] = {
									["max"] = 2530,
									["min"] = 1574,
									["count"] = 17,
									["amount"] = 35004,
								},
								["Crit (Блокировано)"] = {
									["max"] = 2455,
									["min"] = 2455,
									["count"] = 1,
									["amount"] = 2455,
								},
							},
							["count"] = 53,
							["amount"] = 65977,
						},
					},
					["PartialAbsorb"] = {
						["Атака ближнего боя"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 26,
									["amount"] = 0,
								},
							},
							["count"] = 26,
							["amount"] = 0,
						},
						["Вихрь всадника"] = {
							["Details"] = {
								["Нет поглощений"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 205.77,
					["TimeDamaging"] = {
						["Голова Всадника"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 6.46,
								},
								["Цапнуть"] = {
									["count"] = 0.34,
								},
							},
							["amount"] = 6.8,
						},
						["Всадник без головы"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 100.11,
								},
								["Цапнуть"] = {
									["count"] = 21.52,
								},
							},
							["amount"] = 121.63,
						},
						["Дознаватель Вишас"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.96,
								},
								["Цапнуть"] = {
									["count"] = 0.27,
								},
							},
							["amount"] = 5.23,
						},
						["Освобожденный дух"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 9.969999999999999,
								},
								["Цапнуть"] = {
									["count"] = 1.39,
								},
							},
							["amount"] = 11.36,
						},
						["Блуждающий фантазм"] = {
							["Details"] = {
								["Цапнуть"] = {
									["count"] = 1.08,
								},
							},
							["amount"] = 1.08,
						},
						["Павший воитель"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 4.55,
								},
								["Цапнуть"] = {
									["count"] = 0.3,
								},
							},
							["amount"] = 4.85,
						},
						["Тоскующий мертвец"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 19.87,
								},
								["Цапнуть"] = {
									["count"] = 0.7200000000000001,
								},
							},
							["amount"] = 20.59,
						},
						["Истязатель из Алого ордена"] = {
							["Details"] = {
								["Атака ближнего боя"] = {
									["count"] = 30.8,
								},
								["Цапнуть"] = {
									["count"] = 3.430000000000001,
								},
							},
							["amount"] = 34.23000000000001,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 488,
						["Physical"] = 292,
					},
					["ActiveTime"] = 205.77,
					["Damage"] = 140702,
				},
			},
			["UnitLockout"] = 1697820482,
			["LastActive"] = 1697820965,
		},
	},
	["FightNum"] = 14,
	["CombatTimes"] = {
		{
			1697820426, -- [1]
			1697820439, -- [2]
			"22:47:06", -- [3]
			"22:47:19", -- [4]
			"Разведчик Алого ордена", -- [5]
		}, -- [1]
		{
			1697820482, -- [1]
			1697820504, -- [2]
			"22:48:03", -- [3]
			"22:48:24", -- [4]
			"Дознаватель Вишас", -- [5]
		}, -- [2]
		{
			1697820512, -- [1]
			1697820517, -- [2]
			"22:48:32", -- [3]
			"22:48:37", -- [4]
			"Истязатель из Алого ордена", -- [5]
		}, -- [3]
		{
			1697820523, -- [1]
			1697820552, -- [2]
			"22:48:43", -- [3]
			"22:49:12", -- [4]
			"Освобожденный дух", -- [5]
		}, -- [4]
		{
			1697820574, -- [1]
			1697820653, -- [2]
			"22:49:35", -- [3]
			"22:50:53", -- [4]
			"Всадник без головы", -- [5]
		}, -- [5]
		{
			1697820677, -- [1]
			1697820684, -- [2]
			"22:51:18", -- [3]
			"22:51:24", -- [4]
			"Крыса", -- [5]
		}, -- [6]
		{
			1697820687, -- [1]
			1697820694, -- [2]
			"22:51:28", -- [3]
			"22:51:34", -- [4]
			"Тоскующий мертвец", -- [5]
		}, -- [7]
		{
			1697820702, -- [1]
			1697820707, -- [2]
			"22:51:42", -- [3]
			"22:51:47", -- [4]
			"Освобожденный дух", -- [5]
		}, -- [8]
		{
			1697820808, -- [1]
			1697820812, -- [2]
			"22:53:29", -- [3]
			"22:53:32", -- [4]
			"Истязатель из Алого ордена", -- [5]
		}, -- [9]
		{
			1697820812, -- [1]
			1697820821, -- [2]
			"22:53:33", -- [3]
			"22:53:41", -- [4]
			"Истязатель из Алого ордена", -- [5]
		}, -- [10]
		{
			1697820821, -- [1]
			1697820827, -- [2]
			"22:53:41", -- [3]
			"22:53:47", -- [4]
			"Дознаватель Вишас", -- [5]
		}, -- [11]
		{
			1697820836, -- [1]
			1697820840, -- [2]
			"22:53:56", -- [3]
			"22:54:00", -- [4]
			"Истязатель из Алого ордена", -- [5]
		}, -- [12]
		{
			1697820868, -- [1]
			1697820872, -- [2]
			"22:54:28", -- [3]
			"22:54:32", -- [4]
			"Тоскующий мертвец", -- [5]
		}, -- [13]
		{
			1697820887, -- [1]
			1697820967, -- [2]
			"22:54:47", -- [3]
			"22:56:07", -- [4]
			"Всадник без головы", -- [5]
		}, -- [14]
	},
	["FoughtWho"] = {
		"Всадник без головы 22:54:47-22:56:07", -- [1]
		"Тоскующий мертвец 22:54:28-22:54:32", -- [2]
		"Истязатель из Алого ордена 22:53:56-22:54:00", -- [3]
		"Дознаватель Вишас 22:53:41-22:53:47", -- [4]
		"Истязатель из Алого ордена 22:53:33-22:53:41", -- [5]
	},
}
